[
  {
    "source": "arXiv",
    "article_id": "2512.21866v1",
    "title": "Secure and Explainable Fraud Detection in Finance via Hierarchical Multi-source Dataset Distillation",
    "authors": [
      "Yiming Qian",
      "Thorsten Neumann",
      "Xueyining Huang",
      "David Hardoon",
      "Fei Gao",
      "Yong Liu",
      "Siow Mong Rick Goh"
    ],
    "summary": "We propose an explainable, privacy-preserving dataset distillation framework for collaborative financial fraud detection. A trained random forest is converted into transparent, axis-aligned rule regions (leaf hyperrectangles), and synthetic transactions are generated by uniformly sampling within each region. This produces a compact, auditable surrogate dataset that preserves local feature interactions without exposing sensitive original records. The rule regions also support explainability: aggr",
    "published": "2025-12-26",
    "url": "http://arxiv.org/abs/2512.21866v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21866v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.21866v1_Secure_and_Explainable_Fraud_Detection_in_Finance_via_Hierarchical_Multi-source_Dataset_Distillation.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.21804v1",
    "title": "S&P 500 Stock's Movement Prediction using CNN",
    "authors": [
      "Rahul Gupta"
    ],
    "summary": "This paper is about predicting the movement of stock consist of S&P 500 index. Historically there are many approaches have been tried using various methods to predict the stock movement and being used in the market currently for algorithm trading and alpha generating systems using traditional mathematical approaches [1, 2].\n  The success of artificial neural network recently created a lot of interest and paved the way to enable prediction using cutting-edge research in the machine learning and d",
    "published": "2025-12-25",
    "url": "http://arxiv.org/abs/2512.21804v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21804v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.21804v1_SP_500_Stocks_Movement_Prediction_using_CNN.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.21791v1",
    "title": "Synthetic Financial Data Generation for Enhanced Financial Modelling",
    "authors": [
      "Christophe D. Hounwanou",
      "Yae Ulrich Gaba",
      "Pierre Ntakirutimana"
    ],
    "summary": "Data scarcity and confidentiality in finance often impede model development and robust testing. This paper presents a unified multi-criteria evaluation framework for synthetic financial data and applies it to three representative generative paradigms: the statistical ARIMA-GARCH baseline, Variational Autoencoders (VAEs), and Time-series Generative Adversarial Networks (TimeGAN). Using historical S and P 500 daily data, we evaluate fidelity (Maximum Mean Discrepancy, MMD), temporal structure (aut",
    "published": "2025-12-25",
    "url": "http://arxiv.org/abs/2512.21791v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21791v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.21791v1_Synthetic_Financial_Data_Generation_for_Enhanced_Financial_Modelling.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.20460v1",
    "title": "The Aligned Economic Index & The State Switching Model",
    "authors": [
      "Ilias Aarab"
    ],
    "summary": "A growing empirical literature suggests that equity-premium predictability is state dependent, with much of the forecasting power concentrated around recessionary periods \\parencite{Henkel2011,DanglHalling2012,Devpura2018}. I study U.S. stock return predictability across economic regimes and document strong evidence of time-varying expected returns across both expansionary and contractionary states. I contribute in two ways. First, I introduce a state-switching predictive regression in which the",
    "published": "2025-12-23",
    "url": "http://arxiv.org/abs/2512.20460v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20460v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.20460v1_The_Aligned_Economic_Index_The_State_Switching_Model.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.20272v1",
    "title": "HGAN-SDEs: Learning Neural Stochastic Differential Equations with Hermite-Guided Adversarial Training",
    "authors": [
      "Yuanjian Xu",
      "Yuan Shuai",
      "Jianing Hao",
      "Guang Zhang"
    ],
    "summary": "Neural Stochastic Differential Equations (Neural SDEs) provide a principled framework for modeling continuous-time stochastic processes and have been widely adopted in fields ranging from physics to finance. Recent advances suggest that Generative Adversarial Networks (GANs) offer a promising solution to learning the complex path distributions induced by SDEs. However, a critical bottleneck lies in designing a discriminator that faithfully captures temporal dependencies while remaining computati",
    "published": "2025-12-23",
    "url": "http://arxiv.org/abs/2512.20272v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20272v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.20272v1_HGAN-SDEs_Learning_Neural_Stochastic_Differential_Equations_with_Hermite-Guided_Adversarial_Training.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.20002v1",
    "title": "LoFT-LLM: Low-Frequency Time-Series Forecasting with Large Language Models",
    "authors": [
      "Jiacheng You",
      "Jingcheng Yang",
      "Yuhang Xie",
      "Zhongxuan Wu",
      "Xiucheng Li",
      "Feng Li",
      "Pengjie Wang",
      "Jian Xu",
      "Bo Zheng",
      "Xinyang Chen"
    ],
    "summary": "Time-series forecasting in real-world applications such as finance and energy often faces challenges due to limited training data and complex, noisy temporal dynamics. Existing deep forecasting models typically supervise predictions using full-length temporal windows, which include substantial high-frequency noise and obscure long-term trends. Moreover, auxiliary variables containing rich domain-specific information are often underutilized, especially in few-shot settings. To address these chall",
    "published": "2025-12-23",
    "url": "http://arxiv.org/abs/2512.20002v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20002v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.20002v1_LoFT-LLM_Low-Frequency_Time-Series_Forecasting_with_Large_Language_Models.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.19986v1",
    "title": "Covariance-Aware Simplex Projection for Cardinality-Constrained Portfolio Optimization",
    "authors": [
      "Nikolaos Iliopoulos"
    ],
    "summary": "Metaheuristic algorithms for cardinality-constrained portfolio optimization require repair operators to map infeasible candidates onto the feasible region. Standard Euclidean projection treats assets as independent and can ignore the covariance structure that governs portfolio risk, potentially producing less diversified portfolios. This paper introduces Covariance-Aware Simplex Projection (CASP), a two-stage repair operator that (i) selects a target number of assets using volatility-normalized ",
    "published": "2025-12-23",
    "url": "http://arxiv.org/abs/2512.19986v1",
    "pdf_url": "https://arxiv.org/pdf/2512.19986v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.19986v1_Covariance-Aware_Simplex_Projection_for_Cardinality-Constrained_Portfolio_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.19484v1",
    "title": "Structured Event Representation and Stock Return Predictability",
    "authors": [
      "Gang Li",
      "Dandan Qiao",
      "Mingxuan Zheng"
    ],
    "summary": "We find that event features extracted by large language models (LLMs) are effective for text-based stock return prediction. Using a pre-trained LLM to extract event features from news articles, we propose a novel deep learning model based on structured event representation (SER) and attention mechanisms to predict stock returns in the cross-section. Our SER-based model provides superior performance compared with other existing text-driven models to forecast stock returns out of sample and offers",
    "published": "2025-12-22",
    "url": "http://arxiv.org/abs/2512.19484v1",
    "pdf_url": "https://arxiv.org/pdf/2512.19484v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.19484v1_Structured_Event_Representation_and_Stock_Return_Predictability.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17225v1",
    "title": "Modelling financial time series with $φ^{4}$ quantum field theory",
    "authors": [
      "Dimitrios Bachtis",
      "David S. Berman",
      "Arabella Schelpe"
    ],
    "summary": "We use a $φ^{4}$ quantum field theory with inhomogeneous couplings and explicit symmetry-breaking to model an ensemble of financial time series from the S$\\&$P 500 index. The continuum nature of the $φ^4$ theory avoids the inaccuracies that occur in Ising-based models which require a discretization of the time series. We demonstrate this using the example of the 2008 global financial crisis. The $φ^{4}$ quantum field theory is expressive enough to reproduce the higher-order statistics such as th",
    "published": "2025-12-19",
    "url": "http://arxiv.org/abs/2512.17225v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17225v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17225v1_Modelling_financial_time_series_with_φ4_quantum_field_theory.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17185v1",
    "title": "Systemic Risk Radar: A Multi-Layer Graph Framework for Early Market Crash Warning",
    "authors": [
      "Sandeep Neela"
    ],
    "summary": "Financial crises emerge when structural vulnerabilities accumulate across sectors, markets, and investor behavior. Predicting these systemic transitions is challenging because they arise from evolving interactions between market participants, not isolated price movements alone. We present Systemic Risk Radar (SRR), a framework that models financial markets as multi-layer graphs to detect early signs of systemic fragility and crash-regime transitions.\n  We evaluate SRR across three major crises: ",
    "published": "2025-12-19",
    "url": "http://arxiv.org/abs/2512.17185v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17185v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17185v1_Systemic_Risk_Radar_A_Multi-Layer_Graph_Framework_for_Early_Market_Crash_Warning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16433v1",
    "title": "Emergent Bias and Fairness in Multi-Agent Decision Systems",
    "authors": [
      "Maeve Madigan",
      "Parameswaran Kamalaruban",
      "Glenn Moynihan",
      "Tom Kempton",
      "David Sutton",
      "Stuart Burrell"
    ],
    "summary": "Multi-agent systems have demonstrated the ability to improve performance on a variety of predictive tasks by leveraging collaborative decision making. However, the lack of effective evaluation methodologies has made it difficult to estimate the risk of bias, making deployment of such systems unsafe in high stakes domains such as consumer finance, where biased decisions can translate directly into regulatory breaches and financial loss. To address this challenge, we need to develop fairness evalu",
    "published": "2025-12-18",
    "url": "http://arxiv.org/abs/2512.16433v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16433v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16433v1_Emergent_Bias_and_Fairness_in_Multi-Agent_Decision_Systems.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16251v2",
    "title": "Interpretable Deep Learning for Stock Returns: A Consensus-Bottleneck Asset Pricing Model",
    "authors": [
      "Bong-Gyu Jang",
      "Younwoo Jeong",
      "Changeun Kim"
    ],
    "summary": "We introduce the Consensus-Bottleneck Asset Pricing Model (CB-APM), a partially interpretable neural network that replicates the reasoning processes of sell-side analysts by capturing how dispersed investor beliefs are compressed into asset prices through a consensus formation process. By modeling this \"bottleneck\" to summarize firm- and macro-level information, CB-APM not only predicts future risk premiums of U.S. equities but also links belief aggregation to expected returns in a structurally ",
    "published": "2025-12-18",
    "url": "http://arxiv.org/abs/2512.16251v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16251v2",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16251v2_Interpretable_Deep_Learning_for_Stock_Returns_A_Consensus-Bottleneck_Asset_Pricing_Model.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16115v2",
    "title": "An Efficient Machine Learning Framework for Option Pricing via Fourier Transform",
    "authors": [
      "Liying Zhang",
      "Ying Gao"
    ],
    "summary": "The increasing need for rapid recalibration of option pricing models in dynamic markets places stringent computational demands on data generation and valuation algorithms. In this work, we propose a hybrid algorithmic framework that integrates the smooth offset algorithm (SOA) with supervised machine learning models for the fast pricing of multiple path-independent options under exponential Lévy dynamics. Building upon the SOA-generated dataset, we train neural networks, random forests, and grad",
    "published": "2025-12-18",
    "url": "http://arxiv.org/abs/2512.16115v2",
    "pdf_url": "https://arxiv.org/pdf/2512.16115v2",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16115v2_An_Efficient_Machine_Learning_Framework_for_Option_Pricing_via_Fourier_Transform.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16103v1",
    "title": "AIMM: An AI-Driven Multimodal Framework for Detecting Social-Media-Influenced Stock Market Manipulation",
    "authors": [
      "Sandeep Neela"
    ],
    "summary": "Market manipulation now routinely originates from coordinated social media campaigns, not isolated trades. Retail investors, regulators, and brokerages need tools that connect online narratives and coordination patterns to market behavior. We present AIMM, an AI-driven framework that fuses Reddit activity, bot and coordination indicators, and OHLCV market features into a daily AIMM Manipulation Risk Score for each ticker.\n  The system uses a parquet-native pipeline with a Streamlit dashboard tha",
    "published": "2025-12-18",
    "url": "http://arxiv.org/abs/2512.16103v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16103v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16103v1_AIMM_An_AI-Driven_Multimodal_Framework_for_Detecting_Social-Media-Influenced_Stock_Market_Manipulati.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16046v1",
    "title": "CauSTream: Causal Spatio-Temporal Representation Learning for Streamflow Forecasting",
    "authors": [
      "Shu Wan",
      "Reepal Shah",
      "John Sabo",
      "Huan Liu",
      "K. Selçuk Candan"
    ],
    "summary": "Streamflow forecasting is crucial for water resource management and risk mitigation. While deep learning models have achieved strong predictive performance, they often overlook underlying physical processes, limiting interpretability and generalization. Recent causal learning approaches address these issues by integrating domain knowledge, yet they typically rely on fixed causal graphs that fail to adapt to data. We propose CauStream, a unified framework for causal spatiotemporal streamflow fore",
    "published": "2025-12-18",
    "url": "http://arxiv.org/abs/2512.16046v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16046v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16046v1_CauSTream_Causal_Spatio-Temporal_Representation_Learning_for_Streamflow_Forecasting.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16037v1",
    "title": "Explainable AI in Big Data Fraud Detection",
    "authors": [
      "Ayush Jain",
      "Rahul Kulkarni",
      "Siyi Lin"
    ],
    "summary": "Big Data has become central to modern applications in finance, insurance, and cybersecurity, enabling machine learning systems to perform large-scale risk assessments and fraud detection. However, the increasing dependence on automated analytics introduces important concerns about transparency, regulatory compliance, and trust. This paper examines how explainable artificial intelligence (XAI) can be integrated into Big Data analytics pipelines for fraud detection and risk management. We review k",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.16037v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16037v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16037v1_Explainable_AI_in_Big_Data_Fraud_Detection.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16032v1",
    "title": "Techno-economic optimization of a heat-pipe microreactor, part I: theory and cost optimization",
    "authors": [
      "Paul Seurin",
      "Dean Price",
      "Luis Nunez"
    ],
    "summary": "Microreactors, particularly heat-pipe microreactors (HPMRs), are compact, transportable, self-regulated power systems well-suited for access-challenged remote areas where costly fossil fuels dominate. However, they suffer from diseconomies of scale, and their financial viability remains unconvincing. One step in addressing this shortcoming is to design these reactors with comprehensive economic and physics analyses informing early-stage design iteration. In this work, we present a novel unifying",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.16032v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16032v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16032v1_Techno-economic_optimization_of_a_heat-pipe_microreactor_part_I_theory_and_cost_optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.15113v1",
    "title": "Adaptive Weighted Genetic Algorithm-Optimized SVR for Robust Long-Term Forecasting of Global Stock Indices for investment decisions",
    "authors": [
      "Mohit Beniwal"
    ],
    "summary": "Long-term price forecasting remains a formidable challenge due to the inherent uncertainty over the long term, despite some success in short-term predictions. Nonetheless, accurate long-term forecasts are essential for high-net-worth individuals, institutional investors, and traders. The proposed improved genetic algorithm-optimized support vector regression (IGA-SVR) model is specifically designed for long-term price prediction of global indices. The performance of the IGA-SVR model is rigorous",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.15113v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15113v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.15113v1_Adaptive_Weighted_Genetic_Algorithm-Optimized_SVR_for_Robust_Long-Term_Forecasting_of_Global_Stock_I.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.15088v1",
    "title": "SigMA: Path Signatures and Multi-head Attention for Learning Parameters in fBm-driven SDEs",
    "authors": [
      "Xianglin Wu",
      "Chiheb Ben Hammouda",
      "Cornelis W. Oosterlee"
    ],
    "summary": "Stochastic differential equations (SDEs) driven by fractional Brownian motion (fBm) are increasingly used to model systems with rough dynamics and long-range dependence, such as those arising in quantitative finance and reliability engineering. However, these processes are non-Markovian and lack a semimartingale structure, rendering many classical parameter estimation techniques inapplicable or computationally intractable beyond very specific cases. This work investigates two central questions: ",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.15088v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15088v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.15088v1_SigMA_Path_Signatures_and_Multi-head_Attention_for_Learning_Parameters_in_fBm-driven_SDEs.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.14991v1",
    "title": "Adaptive Partitioning and Learning for Stochastic Control of Diffusion Processes",
    "authors": [
      "Hanqing Jin",
      "Renyuan Xu",
      "Yanzhao Yang"
    ],
    "summary": "We study reinforcement learning for controlled diffusion processes with unbounded continuous state spaces, bounded continuous actions, and polynomially growing rewards: settings that arise naturally in finance, economics, and operations research. To overcome the challenges of continuous and high-dimensional domains, we introduce a model-based algorithm that adaptively partitions the joint state-action space. The algorithm maintains estimators of drift, volatility, and rewards within each partiti",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.14991v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14991v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.14991v1_Adaptive_Partitioning_and_Learning_for_Stochastic_Control_of_Diffusion_Processes.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.14990v1",
    "title": "Imitation Game: Reproducing Deep Learning Bugs Leveraging an Intelligent Agent",
    "authors": [
      "Mehil B Shah",
      "Mohammad Masudur Rahman",
      "Foutse Khomh"
    ],
    "summary": "Despite their wide adoption in various domains (e.g., healthcare, finance, software engineering), Deep Learning (DL)-based applications suffer from many bugs, failures, and vulnerabilities. Reproducing these bugs is essential for their resolution, but it is extremely challenging due to the inherent nondeterminism of DL models and their tight coupling with hardware and software environments. According to recent studies, only about 3% of DL bugs can be reliably reproduced using manual approaches. ",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.14990v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14990v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.14990v1_Imitation_Game_Reproducing_Deep_Learning_Bugs_Leveraging_an_Intelligent_Agent.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.14967v1",
    "title": "Deep Learning and Elicitability for McKean-Vlasov FBSDEs With Common Noise",
    "authors": [
      "Felipe J. P. Antunes",
      "Yuri F. Saporito",
      "Sebastian Jaimungal"
    ],
    "summary": "We present a novel numerical method for solving McKean-Vlasov forward-backward stochastic differential equations (MV-FBSDEs) with common noise, combining Picard iterations, elicitability and deep learning. The key innovation involves elicitability to derive a path-wise loss function, enabling efficient training of neural networks to approximate both the backward process and the conditional expectations arising from common noise - without requiring computationally expensive nested Monte Carlo sim",
    "published": "2025-12-16",
    "url": "http://arxiv.org/abs/2512.14967v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14967v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.14967v1_Deep_Learning_and_Elicitability_for_McKean-Vlasov_FBSDEs_With_Common_Noise.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.14078v1",
    "title": "FusAD: Time-Frequency Fusion with Adaptive Denoising for General Time Series Analysis",
    "authors": [
      "Da Zhang",
      "Bingyu Li",
      "Zhiyuan Zhao",
      "Feiping Nie",
      "Junyu Gao",
      "Xuelong Li"
    ],
    "summary": "Time series analysis plays a vital role in fields such as finance, healthcare, industry, and meteorology, underpinning key tasks including classification, forecasting, and anomaly detection. Although deep learning models have achieved remarkable progress in these areas in recent years, constructing an efficient, multi-task compatible, and generalizable unified framework for time series analysis remains a significant challenge. Existing approaches are often tailored to single tasks or specific da",
    "published": "2025-12-16",
    "url": "http://arxiv.org/abs/2512.14078v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14078v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.14078v1_FusAD_Time-Frequency_Fusion_with_Adaptive_Denoising_for_General_Time_Series_Analysis.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.13323v1",
    "title": "Error-Driven Prompt Optimization for Arithmetic Reasoning",
    "authors": [
      "Árpád Pándy",
      "Róbert Lakatos",
      "András Hajdu"
    ],
    "summary": "Recent advancements in artificial intelligence have sparked interest in industrial agents capable of supporting analysts in regulated sectors, such as finance and healthcare, within tabular data workflows. A key capability for such systems is performing accurate arithmetic operations on structured data while ensuring sensitive information never leaves secure, on-premises environments. Here, we introduce an error-driven optimization framework for arithmetic reasoning that enhances a Code Generati",
    "published": "2025-12-15",
    "url": "http://arxiv.org/abs/2512.13323v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13323v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.13323v1_Error-Driven_Prompt_Optimization_for_Arithmetic_Reasoning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12932v1",
    "title": "Investigating Data Pruning for Pretraining Biological Foundation Models at Scale",
    "authors": [
      "Yifan Wu",
      "Jiyue Jiang",
      "Xichen Ye",
      "Yiqi Wang",
      "Chang Zhou",
      "Yitao Xu",
      "Jiayang Chen",
      "He Hu",
      "Weizhong Zhang",
      "Cheng Jin",
      "Jiao Yuan",
      "Yu Li"
    ],
    "summary": "Biological foundation models (BioFMs), pretrained on large-scale biological sequences, have recently shown strong potential in providing meaningful representations for diverse downstream bioinformatics tasks. However, such models often rely on millions to billions of training sequences and billions of parameters, resulting in prohibitive computational costs and significant barriers to reproducibility and accessibility, particularly for academic labs. To address these challenges, we investigate t",
    "published": "2025-12-15",
    "url": "http://arxiv.org/abs/2512.12932v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12932v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12932v1_Investigating_Data_Pruning_for_Pretraining_Biological_Foundation_Models_at_Scale.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12924v1",
    "title": "Interpretable Hypothesis-Driven Trading:A Rigorous Walk-Forward Validation Framework for Market Microstructure Signals",
    "authors": [
      "Gagan Deep",
      "Akash Deep",
      "William Lamptey"
    ],
    "summary": "We develop a rigorous walk-forward validation framework for algorithmic trading designed to mitigate overfitting and lookahead bias. Our methodology combines interpretable hypothesis-driven signal generation with reinforcement learning and strict out-of-sample testing. The framework enforces strict information set discipline, employs rolling window validation across 34 independent test periods, maintains complete interpretability through natural language hypothesis explanations, and incorporates",
    "published": "2025-12-15",
    "url": "http://arxiv.org/abs/2512.12924v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12924v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12924v1_Interpretable_Hypothesis-Driven_TradingA_Rigorous_Walk-Forward_Validation_Framework_for_Market_Micro.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17945v1",
    "title": "What's the Price of Monotonicity? A Multi-Dataset Benchmark of Monotone-Constrained Gradient Boosting for Credit PD",
    "authors": [
      "Petr Koklev"
    ],
    "summary": "Financial institutions face a trade-off between predictive accuracy and interpretability when deploying machine learning models for credit risk. Monotonicity constraints align model behavior with domain knowledge, but their performance cost - the price of monotonicity - is not well quantified. This paper benchmarks monotone-constrained versus unconstrained gradient boosting models for credit probability of default across five public datasets and three libraries. We define the Price of Monotonici",
    "published": "2025-12-14",
    "url": "http://arxiv.org/abs/2512.17945v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17945v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17945v1_Whats_the_Price_of_Monotonicity_A_Multi-Dataset_Benchmark_of_Monotone-Constrained_Gradient_Boosting_.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12858v1",
    "title": "Information-Consistent Language Model Recommendations through Group Relative Policy Optimization",
    "authors": [
      "Sonal Prabhune",
      "Balaji Padmanabhan",
      "Kaushik Dutta"
    ],
    "summary": "Large Language Models (LLMs) are increasingly deployed in business-critical domains such as finance, education, healthcare, and customer support, where users expect consistent and reliable recommendations. Yet LLMs often exhibit variability when prompts are phrased with minor differences, even when semantically equivalent. Such inconsistency undermines trust, complicates compliance, and disrupts user experience. While personalization is desirable in certain contexts, many enterprise scenarios-su",
    "published": "2025-12-14",
    "url": "http://arxiv.org/abs/2512.12858v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12858v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12858v1_Information-Consistent_Language_Model_Recommendations_through_Group_Relative_Policy_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12783v2",
    "title": "Credit Risk Estimation with Non-Financial Features: Evidence from a Synthetic Istanbul Dataset",
    "authors": [
      "Atalay Denknalbant",
      "Emre Sezdi",
      "Zeki Furkan Kutlu",
      "Polat Goktas"
    ],
    "summary": "Financial exclusion constrains entrepreneurship, increases income volatility, and widens wealth gaps. Underbanked consumers in Istanbul often have no bureau file because their earnings and payments flow through informal channels. To study how such borrowers can be evaluated we create a synthetic dataset of one hundred thousand Istanbul residents that reproduces first quarter 2025 TÜİK census marginals and telecom usage patterns. Retrieval augmented generation feeds these public statistics into t",
    "published": "2025-12-14",
    "url": "http://arxiv.org/abs/2512.12783v2",
    "pdf_url": "https://arxiv.org/pdf/2512.12783v2",
    "pdf_path": null
  },
  {
    "source": "arXiv",
    "article_id": "2512.12708v1",
    "title": "Multi-Trajectory Physics-Informed Neural Networks for HJB Equations with Hard-Zero Terminal Inventory: Optimal Execution on Synthetic & SPY Data",
    "authors": [
      "Anthime Valin"
    ],
    "summary": "We study optimal trade execution with a hard-zero terminal inventory constraint, modeled via Hamilton-Jacobi-Bellman (HJB) equations. Vanilla PINNs often under-enforce this constraint and produce unstable controls. We propose a Multi-Trajectory PINN (MT-PINN) that adds a rollout-based trajectory loss and propagates a terminal penalty on terminal inventory via backpropagation-through-time, directly enforcing zero terminal inventory. A lightweight lambda-curriculum is adopted to stabilize training",
    "published": "2025-12-14",
    "url": "http://arxiv.org/abs/2512.12708v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12708v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12708v1_Multi-Trajectory_Physics-Informed_Neural_Networks_for_HJB_Equations_with_Hard-Zero_Terminal_Inventor.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12526v1",
    "title": "Empirical Mode Decomposition and Graph Transformation of the MSCI World Index: A Multiscale Topological Analysis for Graph Neural Network Modeling",
    "authors": [
      "Agustín M. de los Riscos",
      "Julio E. Sandubete",
      "Diego Carmona-Fernández",
      "León Beleña"
    ],
    "summary": "This study applies Empirical Mode Decomposition (EMD) to the MSCI World index and converts the resulting intrinsic mode functions (IMFs) into graph representations to enable modeling with graph neural networks (GNNs). Using CEEMDAN, we extract nine IMFs spanning high-frequency fluctuations to long-term trends. Each IMF is transformed into a graph using four time-series-to-graph methods: natural visibility, horizontal visibility, recurrence, and transition graphs. Topological analysis shows clear",
    "published": "2025-12-14",
    "url": "http://arxiv.org/abs/2512.12526v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12526v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12526v1_Empirical_Mode_Decomposition_and_Graph_Transformation_of_the_MSCI_World_Index_A_Multiscale_Topologic.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12334v1",
    "title": "Extending the application of dynamic Bayesian networks in calculating market risk: Standard and stressed expected shortfall",
    "authors": [
      "Eden Gross",
      "Ryan Kruger",
      "Francois Toerien"
    ],
    "summary": "In the last five years, expected shortfall (ES) and stressed ES (SES) have become key required regulatory measures of market risk in the banking sector, especially following events such as the global financial crisis. Thus, finding ways to optimize their estimation is of great importance. We extend the application of dynamic Bayesian networks (DBNs) to the estimation of 10-day 97.5% ES and stressed ES, building on prior work applying DBNs to value at risk. Using the S&P 500 index as a proxy for ",
    "published": "2025-12-13",
    "url": "http://arxiv.org/abs/2512.12334v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12334v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12334v1_Extending_the_application_of_dynamic_Bayesian_networks_in_calculating_market_risk_Standard_and_stres.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12250v1",
    "title": "Stochastic Volatility Modelling with LSTM Networks: A Hybrid Approach for S&P 500 Index Volatility Forecasting",
    "authors": [
      "Anna Perekhodko",
      "Robert Ślepaczuk"
    ],
    "summary": "Accurate volatility forecasting is essential in banking, investment, and risk management, because expectations about future market movements directly influence current decisions. This study proposes a hybrid modelling framework that integrates a Stochastic Volatility model with a Long Short Term Memory neural network. The SV model improves statistical precision and captures latent volatility dynamics, especially in response to unforeseen events, while the LSTM network enhances the model's abilit",
    "published": "2025-12-13",
    "url": "http://arxiv.org/abs/2512.12250v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12250v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12250v1_Stochastic_Volatility_Modelling_with_LSTM_Networks_A_Hybrid_Approach_for_SP_500_Index_Volatility_For.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.11412v1",
    "title": "Task-Specific Sparse Feature Masks for Molecular Toxicity Prediction with Chemical Language Models",
    "authors": [
      "Kwun Sy Lee",
      "Jiawei Chen",
      "Fuk Sheng Ford Chung",
      "Tianyu Zhao",
      "Zhenyuan Chen",
      "Debby D. Wang"
    ],
    "summary": "Reliable in silico molecular toxicity prediction is a cornerstone of modern drug discovery, offering a scalable alternative to experimental screening. However, the black-box nature of state-of-the-art models remains a significant barrier to adoption, as high-stakes safety decisions demand verifiable structural insights alongside predictive performance. To address this, we propose a novel multi-task learning (MTL) framework designed to jointly enhance accuracy and interpretability. Our architectu",
    "published": "2025-12-12",
    "url": "http://arxiv.org/abs/2512.11412v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11412v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.11412v1_Task-Specific_Sparse_Feature_Masks_for_Molecular_Toxicity_Prediction_with_Chemical_Language_Models.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.11273v2",
    "title": "Integrated Prediction and Multi-period Portfolio Optimization",
    "authors": [
      "Yuxuan Linghu",
      "Zhiyuan Liu",
      "Qi Deng"
    ],
    "summary": "Multi-period portfolio optimization is important for real portfolio management, as it accounts for transaction costs, path-dependent risks, and the intertemporal structure of trading decisions that single-period models cannot capture. Classical methods usually follow a two-stage framework: machine learning algorithms are employed to produce forecasts that closely fit the realized returns, and the predicted values are then used in a downstream portfolio optimization problem to determine the asset",
    "published": "2025-12-12",
    "url": "http://arxiv.org/abs/2512.11273v2",
    "pdf_url": "https://arxiv.org/pdf/2512.11273v2",
    "pdf_path": "pdfs_articles\\arxiv\\2512.11273v2_Integrated_Prediction_and_Multi-period_Portfolio_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.11251v1",
    "title": "Insight Miner: A Time Series Analysis Dataset for Cross-Domain Alignment with Natural Language",
    "authors": [
      "Yunkai Zhang",
      "Yawen Zhang",
      "Ming Zheng",
      "Kezhen Chen",
      "Chongyang Gao",
      "Ruian Ge",
      "Siyuan Teng",
      "Amine Jelloul",
      "Jinmeng Rao",
      "Xiaoyuan Guo",
      "Chiang-Wei Fang",
      "Zeyu Zheng",
      "Jie Yang"
    ],
    "summary": "Time-series data is critical across many scientific and industrial domains, including environmental analysis, agriculture, transportation, and finance. However, mining insights from this data typically requires deep domain expertise, a process that is both time-consuming and labor-intensive. In this paper, we propose \\textbf{Insight Miner}, a large-scale multimodal model (LMM) designed to generate high-quality, comprehensive time-series descriptions enriched with domain-specific knowledge. To fa",
    "published": "2025-12-12",
    "url": "http://arxiv.org/abs/2512.11251v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11251v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.11251v1_Insight_Miner_A_Time_Series_Analysis_Dataset_for_Cross-Domain_Alignment_with_Natural_Language.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.10886v1",
    "title": "Physics-Informed Learning of Flow Distribution and Receiver Heat Losses in Parabolic Trough Solar Fields",
    "authors": [
      "Stefan Matthes",
      "Markus Schramm"
    ],
    "summary": "Parabolic trough Concentrating Solar Power (CSP) plants operate large hydraulic networks of collector loops that must deliver a uniform outlet temperature despite spatially heterogeneous optical performance, heat losses, and pressure drops. While loop temperatures are measured, loop-level mass flows and receiver heat-loss parameters are unobserved, making it impossible to diagnose hydraulic imbalances or receiver degradation using standard monitoring tools.\n  We present a physics-informed learni",
    "published": "2025-12-11",
    "url": "http://arxiv.org/abs/2512.10886v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10886v1",
    "pdf_path": null
  },
  {
    "source": "arXiv",
    "article_id": "2512.17936v1",
    "title": "Risk-Aware Financial Forecasting Enhanced by Machine Learning and Intuitionistic Fuzzy Multi-Criteria Decision-Making",
    "authors": [
      "Safiye Turgay",
      "Serkan Erdoğan",
      "Željko Stević",
      "Orhan Emre Elma",
      "Tevfik Eren",
      "Zhiyuan Wang",
      "Mahmut Baydaş"
    ],
    "summary": "In the face of increasing financial uncertainty and market complexity, this study presents a novel risk-aware financial forecasting framework that integrates advanced machine learning techniques with intuitionistic fuzzy multi-criteria decision-making (MCDM). Tailored to the BIST 100 index and validated through a case study of a major defense company in Türkiye, the framework fuses structured financial data, unstructured text data, and macroeconomic indicators to enhance predictive accuracy and ",
    "published": "2025-12-11",
    "url": "http://arxiv.org/abs/2512.17936v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17936v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17936v1_Risk-Aware_Financial_Forecasting_Enhanced_by_Machine_Learning_and_Intuitionistic_Fuzzy_Multi-Criteri.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.11901v1",
    "title": "CLARGA: Multimodal Graph Representation Learning over Arbitrary Sets of Modalities",
    "authors": [
      "Santosh Patapati"
    ],
    "summary": "We introduce CLARGA, a general-purpose multimodal fusion architecture for multimodal representation learning that works with any number and type of modalities without changing the underlying framework. Given a supervised dataset, CLARGA can be applied to virtually any machine learning task to fuse different multimodal representations for processing by downstream layers. On a sample-by-sample basis, CLARGA learns how modalities should inform one another by building an attention weighted graph ove",
    "published": "2025-12-10",
    "url": "http://arxiv.org/abs/2512.11901v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11901v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.11901v1_CLARGA_Multimodal_Graph_Representation_Learning_over_Arbitrary_Sets_of_Modalities.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.09224v1",
    "title": "Exploratory Mean-Variance with Jumps: An Equilibrium Approach",
    "authors": [
      "Yuling Max Chen",
      "Bin Li",
      "David Saunders"
    ],
    "summary": "Revisiting the continuous-time Mean-Variance (MV) Portfolio Optimization problem, we model the market dynamics with a jump-diffusion process and apply Reinforcement Learning (RL) techniques to facilitate informed exploration within the control space. We recognize the time-inconsistency of the MV problem and adopt the time-inconsistent control (TIC) approach to analytically solve for an exploratory equilibrium investment policy, which is a Gaussian distribution centered on the equilibrium control",
    "published": "2025-12-10",
    "url": "http://arxiv.org/abs/2512.09224v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09224v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.09224v1_Exploratory_Mean-Variance_with_Jumps_An_Equilibrium_Approach.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17929v1",
    "title": "Reinforcement Learning for Monetary Policy Under Macroeconomic Uncertainty: Analyzing Tabular and Function Approximation Methods",
    "authors": [
      "Sheryl Chen",
      "Tony Wang",
      "Kyle Feinstein"
    ],
    "summary": "We study how a central bank should dynamically set short-term nominal interest rates to stabilize inflation and unemployment when macroeconomic relationships are uncertain and time-varying. We model monetary policy as a sequential decision-making problem where the central bank observes macroeconomic conditions quarterly and chooses interest rate adjustments. Using publically accessible historical Federal Reserve Economic Data (FRED), we construct a linear-Gaussian transition model and implement ",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.17929v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17929v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17929v1_Reinforcement_Learning_for_Monetary_Policy_Under_Macroeconomic_Uncertainty_Analyzing_Tabular_and_Fun.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08851v1",
    "title": "A New Application of Hoeffding's Inequality Can Give Traders Early Warning of Financial Regime Change",
    "authors": [
      "Daniel Egger",
      "Jacob Vestal"
    ],
    "summary": "Hoeffding's Inequality provides the maximum probability that a series of n draws from a bounded random variable differ from the variable's true expectation u by more than given tolerance t. The random variable is typically the error rate of a classifier in machine learning applications. Here, a trading strategy is premised on the assumption of an underlying distribution of causal factors, in other words, a market regime, and the random variable is the performance of that trading strategy. A larg",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08851v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08851v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08851v1_A_New_Application_of_Hoeffdings_Inequality_Can_Give_Traders_Early_Warning_of_Financial_Regime_Change.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08828v1",
    "title": "Prediction Intervals for Individual Treatment Effects in a Multiple Decision Point Framework using Conformal Inference",
    "authors": [
      "Swaraj Bose",
      "Walter Dempsey"
    ],
    "summary": "Accurately quantifying uncertainty of individual treatment effects (ITEs) across multiple decision points is crucial for personalized decision-making in fields such as healthcare, finance, education, and online marketplaces. Previous work has focused on predicting non-causal longitudinal estimands or constructing prediction bands for ITEs using cross-sectional data based on exchangeability assumptions. We propose a novel method for constructing prediction intervals using conformal inference tech",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08828v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08828v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08828v1_Prediction_Intervals_for_Individual_Treatment_Effects_in_a_Multiple_Decision_Point_Framework_using_C.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08567v1",
    "title": "A Hybrid Model for Stock Market Forecasting: Integrating News Sentiment and Time Series Data with Graph Neural Networks",
    "authors": [
      "Nader Sadek",
      "Mirette Moawad",
      "Christina Naguib",
      "Mariam Elzahaby"
    ],
    "summary": "Stock market prediction is a long-standing challenge in finance, as accurate forecasts support informed investment decisions. Traditional models rely mainly on historical prices, but recent work shows that financial news can provide useful external signals. This paper investigates a multimodal approach that integrates companies' news articles with their historical stock data to improve prediction performance. We compare a Graph Neural Network (GNN) model with a baseline LSTM model. Historical da",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08567v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08567v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08567v1_A_Hybrid_Model_for_Stock_Market_Forecasting_Integrating_News_Sentiment_and_Time_Series_Data_with_Gra.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.07828v2",
    "title": "The Adoption and Usage of AI Agents: Early Evidence from Perplexity",
    "authors": [
      "Jeremy Yang",
      "Noah Yonack",
      "Kate Zyskowski",
      "Denis Yarats",
      "Johnny Ho",
      "Jerry Ma"
    ],
    "summary": "This paper presents the first large-scale field study of the adoption, usage intensity, and use cases of general-purpose AI agents operating in open-world web environments. Our analysis centers on Comet, an AI-powered browser developed by Perplexity, and its integrated agent, Comet Assistant. Drawing on hundreds of millions of anonymized user interactions, we address three fundamental questions: Who is using AI agents? How intensively are they using them? And what are they using them for? Our fi",
    "published": "2025-12-08",
    "url": "http://arxiv.org/abs/2512.07828v2",
    "pdf_url": "https://arxiv.org/pdf/2512.07828v2",
    "pdf_path": "pdfs_articles\\arxiv\\2512.07828v2_The_Adoption_and_Usage_of_AI_Agents_Early_Evidence_from_Perplexity.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17923v1",
    "title": "Inferring Latent Market Forces: Evaluating LLM Detection of Gamma Exposure Patterns via Obfuscation Testing",
    "authors": [
      "Christopher Regan",
      "Ying Xie"
    ],
    "summary": "We introduce obfuscation testing, a novel methodology for validating whether large language models detect structural market patterns through causal reasoning rather than temporal association. Testing three dealer hedging constraint patterns (gamma positioning, stock pinning, 0DTE hedging) on 242 trading days (95.6% coverage) of S&P 500 options data, we find LLMs achieve 71.5% detection rate using unbiased prompts that provide only raw gamma exposure values without regime labels or temporal conte",
    "published": "2025-12-08",
    "url": "http://arxiv.org/abs/2512.17923v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17923v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17923v1_Inferring_Latent_Market_Forces_Evaluating_LLM_Detection_of_Gamma_Exposure_Patterns_via_Obfuscation_T.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.07390v1",
    "title": "Towards Reliable Test-Time Adaptation: Style Invariance as a Correctness Likelihood",
    "authors": [
      "Gilhyun Nam",
      "Taewon Kim",
      "Joonhyun Jeong",
      "Eunho Yang"
    ],
    "summary": "Test-time adaptation (TTA) enables efficient adaptation of deployed models, yet it often leads to poorly calibrated predictive uncertainty - a critical issue in high-stakes domains such as autonomous driving, finance, and healthcare. Existing calibration methods typically assume fixed models or static distributions, resulting in degraded performance under real-world, dynamic test conditions. To address these challenges, we introduce Style Invariance as a Correctness Likelihood (SICL), a framewor",
    "published": "2025-12-08",
    "url": "http://arxiv.org/abs/2512.07390v1",
    "pdf_url": "https://arxiv.org/pdf/2512.07390v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.07390v1_Towards_Reliable_Test-Time_Adaptation_Style_Invariance_as_a_Correctness_Likelihood.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.07162v1",
    "title": "DeepSVM: Learning Stochastic Volatility Models with Physics-Informed Deep Operator Networks",
    "authors": [
      "Kieran A. Malandain",
      "Selim Kalici",
      "Hakob Chakhoyan"
    ],
    "summary": "Real-time calibration of stochastic volatility models (SVMs) is computationally bottlenecked by the need to repeatedly solve coupled partial differential equations (PDEs). In this work, we propose DeepSVM, a physics-informed Deep Operator Network (PI-DeepONet) designed to learn the solution operator of the Heston model across its entire parameter space. Unlike standard data-driven deep learning (DL) approaches, DeepSVM requires no labelled training data. Rather, we employ a hard-constrained ansa",
    "published": "2025-12-08",
    "url": "http://arxiv.org/abs/2512.07162v1",
    "pdf_url": "https://arxiv.org/pdf/2512.07162v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.07162v1_DeepSVM_Learning_Stochastic_Volatility_Models_with_Physics-Informed_Deep_Operator_Networks.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.06678v1",
    "title": "GradientSpace: Unsupervised Data Clustering for Improved Instruction Tuning",
    "authors": [
      "Shrihari Sridharan",
      "Deepak Ravikumar",
      "Anand Raghunathan",
      "Kaushik Roy"
    ],
    "summary": "Instruction tuning is one of the key steps required for adapting large language models (LLMs) to a broad spectrum of downstream applications. However, this procedure is difficult because real-world datasets are rarely homogeneous; they consist of a mixture of diverse information, causing gradient interference, where conflicting gradients pull the model in opposing directions, degrading performance. A common strategy to mitigate this issue is to group data based on semantic or embedding similarit",
    "published": "2025-12-07",
    "url": "http://arxiv.org/abs/2512.06678v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06678v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.06678v1_GradientSpace_Unsupervised_Data_Clustering_for_Improved_Instruction_Tuning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.06639v1",
    "title": "Learning to Hedge Swaptions",
    "authors": [
      "Zaniar Ahmadi",
      "Frédéric Godin"
    ],
    "summary": "This paper investigates the deep hedging framework, based on reinforcement learning (RL), for the dynamic hedging of swaptions, contrasting its performance with traditional sensitivity-based rho-hedging. We design agents under three distinct objective functions (mean squared error, downside risk, and Conditional Value-at-Risk) to capture alternative risk preferences and evaluate how these objectives shape hedging styles. Relying on a three-factor arbitrage-free dynamic Nelson-Siegel model for ou",
    "published": "2025-12-07",
    "url": "http://arxiv.org/abs/2512.06639v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06639v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.06639v1_Learning_to_Hedge_Swaptions.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.21804v1",
    "title": "S&P 500 Stock's Movement Prediction using CNN",
    "authors": [
      "Rahul Gupta"
    ],
    "summary": "This paper is about predicting the movement of stock consist of S&P 500 index. Historically there are many approaches have been tried using various methods to predict the stock movement and being used in the market currently for algorithm trading and alpha generating systems using traditional mathematical approaches [1, 2].\n  The success of artificial neural network recently created a lot of interest and paved the way to enable prediction using cutting-edge research in the machine learning and d",
    "published": "2025-12-25",
    "url": "http://arxiv.org/abs/2512.21804v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21804v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.21804v1_SP_500_Stocks_Movement_Prediction_using_CNN.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.16266v1",
    "title": "Pixel Super-Resolved Fluorescence Lifetime Imaging Using Deep Learning",
    "authors": [
      "Paloma Casteleiro Costa",
      "Parnian Ghapandar Kashani",
      "Xuhui Liu",
      "Alexander Chen",
      "Ary Portes",
      "Julien Bec",
      "Laura Marcu",
      "Aydogan Ozcan"
    ],
    "summary": "Fluorescence lifetime imaging microscopy (FLIM) is a powerful quantitative technique that provides metabolic and molecular contrast, offering strong translational potential for label-free, real-time diagnostics. However, its clinical adoption remains limited by long pixel dwell times and low signal-to-noise ratio (SNR), which impose a stricter resolution-speed trade-off than conventional optical imaging approaches. Here, we introduce FLIM_PSR_k, a deep learning-based multi-channel pixel super-re",
    "published": "2025-12-18",
    "url": "http://arxiv.org/abs/2512.16266v1",
    "pdf_url": "https://arxiv.org/pdf/2512.16266v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.16266v1_Pixel_Super-Resolved_Fluorescence_Lifetime_Imaging_Using_Deep_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.15088v1",
    "title": "SigMA: Path Signatures and Multi-head Attention for Learning Parameters in fBm-driven SDEs",
    "authors": [
      "Xianglin Wu",
      "Chiheb Ben Hammouda",
      "Cornelis W. Oosterlee"
    ],
    "summary": "Stochastic differential equations (SDEs) driven by fractional Brownian motion (fBm) are increasingly used to model systems with rough dynamics and long-range dependence, such as those arising in quantitative finance and reliability engineering. However, these processes are non-Markovian and lack a semimartingale structure, rendering many classical parameter estimation techniques inapplicable or computationally intractable beyond very specific cases. This work investigates two central questions: ",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.15088v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15088v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.15088v1_SigMA_Path_Signatures_and_Multi-head_Attention_for_Learning_Parameters_in_fBm-driven_SDEs.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.14992v1",
    "title": "Multi-Objective Bayesian Optimization of Deep Reinforcement Learning for Environmental, Social, and Governance (ESG) Financial Portfolio Management",
    "authors": [
      "M. Coronado-Vaca"
    ],
    "summary": "DRL agents circumvent the issue of classic models in the sense that they do not make assumptions like the financial returns being normally distributed and are able to deal with any information like the ESG score if they are configured to gain a reward that makes an objective better. However, the performance of DRL agents has high variability and it is very sensible to the value of their hyperparameters. Bayesian optimization is a class of methods that are suited to the optimization of black-box ",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.14992v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14992v1",
    "pdf_path": null
  },
  {
    "source": "arXiv",
    "article_id": "2512.14410v1",
    "title": "Pattern Recognition of Aluminium Arbitrage in Global Trade Data",
    "authors": [
      "Muhammad Sukri Bin Ramli"
    ],
    "summary": "As the global economy transitions toward decarbonization, the aluminium sector has become a focal point for strategic resource management. While policies such as the Carbon Border Adjustment Mechanism (CBAM) aim to reduce emissions, they have inadvertently widened the price arbitrage between primary metal, scrap, and semi-finished goods, creating new incentives for market optimization. This study presents a unified, unsupervised machine learning framework to detect and classify emerging trade an",
    "published": "2025-12-16",
    "url": "http://arxiv.org/abs/2512.14410v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14410v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.14410v1_Pattern_Recognition_of_Aluminium_Arbitrage_in_Global_Trade_Data.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.13480v1",
    "title": "Element-wise Modulation of Random Matrices for Efficient Neural Layers",
    "authors": [
      "Maksymilian Szorc"
    ],
    "summary": "Fully connected layers are a primary source of memory and computational overhead in deep neural networks due to their dense, often redundant parameterization. While various compression techniques exist, they frequently introduce complex engineering trade-offs or degrade model performance. We propose the Parametrized Random Projection (PRP) layer, a novel approach that decouples feature mixing from adaptation by utilizing a fixed random matrix modulated by lightweight, learnable element-wise para",
    "published": "2025-12-15",
    "url": "http://arxiv.org/abs/2512.13480v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13480v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.13480v1_Element-wise_Modulation_of_Random_Matrices_for_Efficient_Neural_Layers.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12924v1",
    "title": "Interpretable Hypothesis-Driven Trading:A Rigorous Walk-Forward Validation Framework for Market Microstructure Signals",
    "authors": [
      "Gagan Deep",
      "Akash Deep",
      "William Lamptey"
    ],
    "summary": "We develop a rigorous walk-forward validation framework for algorithmic trading designed to mitigate overfitting and lookahead bias. Our methodology combines interpretable hypothesis-driven signal generation with reinforcement learning and strict out-of-sample testing. The framework enforces strict information set discipline, employs rolling window validation across 34 independent test periods, maintains complete interpretability through natural language hypothesis explanations, and incorporates",
    "published": "2025-12-15",
    "url": "http://arxiv.org/abs/2512.12924v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12924v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12924v1_Interpretable_Hypothesis-Driven_TradingA_Rigorous_Walk-Forward_Validation_Framework_for_Market_Micro.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.13729v1",
    "title": "Composite Classifier-Free Guidance for Multi-Modal Conditioning in Wind Dynamics Super-Resolution",
    "authors": [
      "Jacob Schnell",
      "Aditya Makkar",
      "Gunadi Gani",
      "Aniket Srinivasan Ashok",
      "Darren Lo",
      "Mike Optis",
      "Alexander Wong",
      "Yuhao Chen"
    ],
    "summary": "Various weather modelling problems (e.g., weather forecasting, optimizing turbine placements, etc.) require ample access to high-resolution, highly accurate wind data. Acquiring such high-resolution wind data, however, remains a challenging and expensive endeavour. Traditional reconstruction approaches are typically either cost-effective or accurate, but not both. Deep learning methods, including diffusion models, have been proposed to resolve this trade-off by leveraging advances in natural ima",
    "published": "2025-12-13",
    "url": "http://arxiv.org/abs/2512.13729v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13729v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.13729v1_Composite_Classifier-Free_Guidance_for_Multi-Modal_Conditioning_in_Wind_Dynamics_Super-Resolution.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.13727v1",
    "title": "RAST-MoE-RL: A Regime-Aware Spatio-Temporal MoE Framework for Deep Reinforcement Learning in Ride-Hailing",
    "authors": [
      "Yuhan Tang",
      "Kangxin Cui",
      "Jung Ho Park",
      "Yibo Zhao",
      "Xuan Jiang",
      "Haoze He",
      "Dingyi Zhuang",
      "Shenhao Wang",
      "Jiangbo Yu",
      "Haris Koutsopoulos",
      "Jinhua Zhao"
    ],
    "summary": "Ride-hailing platforms face the challenge of balancing passenger waiting times with overall system efficiency under highly uncertain supply-demand conditions. Adaptive delayed matching creates a trade-off between matching and pickup delays by deciding whether to assign drivers immediately or batch requests. Since outcomes accumulate over long horizons with stochastic dynamics, reinforcement learning (RL) is a suitable framework. However, existing approaches often oversimplify traffic dynamics or",
    "published": "2025-12-13",
    "url": "http://arxiv.org/abs/2512.13727v1",
    "pdf_url": "https://arxiv.org/pdf/2512.13727v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.13727v1_RAST-MoE-RL_A_Regime-Aware_Spatio-Temporal_MoE_Framework_for_Deep_Reinforcement_Learning_in_Ride-Hai.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12420v1",
    "title": "Deep Hedging with Reinforcement Learning: A Practical Framework for Option Risk Management",
    "authors": [
      "Travon Lucius",
      "Christian Koch",
      "Jacob Starling",
      "Julia Zhu",
      "Miguel Urena",
      "Carrie Hu"
    ],
    "summary": "We present a reinforcement-learning (RL) framework for dynamic hedging of equity index option exposures under realistic transaction costs and position limits. We hedge a normalized option-implied equity exposure (one unit of underlying delta, offset via SPY) by trading the underlying index ETF, using the option surface and macro variables only as state information and not as a direct pricing engine. Building on the \"deep hedging\" paradigm of Buehler et al. (2019), we design a leak-free environme",
    "published": "2025-12-13",
    "url": "http://arxiv.org/abs/2512.12420v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12420v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12420v1_Deep_Hedging_with_Reinforcement_Learning_A_Practical_Framework_for_Option_Risk_Management.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12142v1",
    "title": "MeltwaterBench: Deep learning for spatiotemporal downscaling of surface meltwater",
    "authors": [
      "Björn Lütjens",
      "Patrick Alexander",
      "Raf Antwerpen",
      "Til Widmann",
      "Guido Cervone",
      "Marco Tedesco"
    ],
    "summary": "The Greenland ice sheet is melting at an accelerated rate due to processes that are not fully understood and hard to measure. The distribution of surface meltwater can help understand these processes and is observable through remote sensing, but current maps of meltwater face a trade-off: They are either high-resolution in time or space, but not both. We develop a deep learning model that creates gridded surface meltwater maps at daily 100m resolution by fusing data streams from remote sensing o",
    "published": "2025-12-13",
    "url": "http://arxiv.org/abs/2512.12142v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12142v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12142v1_MeltwaterBench_Deep_learning_for_spatiotemporal_downscaling_of_surface_meltwater.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12060v1",
    "title": "CreativeVR: Diffusion-Prior-Guided Approach for Structure and Motion Restoration in Generative and Real Videos",
    "authors": [
      "Tejas Panambur",
      "Ishan Rajendrakumar Dave",
      "Chongjian Ge",
      "Ersin Yumer",
      "Xue Bai"
    ],
    "summary": "Modern text-to-video (T2V) diffusion models can synthesize visually compelling clips, yet they remain brittle at fine-scale structure: even state-of-the-art generators often produce distorted faces and hands, warped backgrounds, and temporally inconsistent motion. Such severe structural artifacts also appear in very low-quality real-world videos. Classical video restoration and super-resolution (VR/VSR) methods, in contrast, are tuned for synthetic degradations such as blur and downsampling and ",
    "published": "2025-12-12",
    "url": "http://arxiv.org/abs/2512.12060v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12060v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12060v1_CreativeVR_Diffusion-Prior-Guided_Approach_for_Structure_and_Motion_Restoration_in_Generative_and_Re.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.11525v1",
    "title": "NeuralOGCM: Differentiable Ocean Modeling with Learnable Physics",
    "authors": [
      "Hao Wu",
      "Yuan Gao",
      "Fan Xu",
      "Fan Zhang",
      "Guangliang Liu",
      "Yuxuan Liang",
      "Xiaomeng Huang"
    ],
    "summary": "High-precision scientific simulation faces a long-standing trade-off between computational efficiency and physical fidelity. To address this challenge, we propose NeuralOGCM, an ocean modeling framework that fuses differentiable programming with deep learning. At the core of NeuralOGCM is a fully differentiable dynamical solver, which leverages physics knowledge as its core inductive bias. The learnable physics integration captures large-scale, deterministic physical evolution, and transforms ke",
    "published": "2025-12-12",
    "url": "http://arxiv.org/abs/2512.11525v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11525v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.11525v1_NeuralOGCM_Differentiable_Ocean_Modeling_with_Learnable_Physics.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.09074v1",
    "title": "Modular Deep-Learning-Based Early Warning System for Deadly Heatwave Prediction",
    "authors": [
      "Shangqing Xu",
      "Zhiyuan Zhao",
      "Megha Sharma",
      "José María Martín-Olalla",
      "Alexander Rodríguez",
      "Gregory A. Wellenius",
      "B. Aditya Prakash"
    ],
    "summary": "Severe heatwaves in urban areas significantly threaten public health, calling for establishing early warning strategies. Despite predicting occurrence of heatwaves and attributing historical mortality, predicting an incoming deadly heatwave remains a challenge due to the difficulty in defining and estimating heat-related mortality. Furthermore, establishing an early warning system imposes additional requirements, including data availability, spatial and temporal robustness, and decision costs. T",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.09074v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09074v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.09074v1_Modular_Deep-Learning-Based_Early_Warning_System_for_Deadly_Heatwave_Prediction.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08341v1",
    "title": "Multi-Agent Deep Reinforcement Learning for Collaborative UAV Relay Networks under Jamming Atatcks",
    "authors": [
      "Thai Duong Nguyen",
      "Ngoc-Tan Nguyen",
      "Thanh-Dao Nguyen",
      "Nguyen Van Huynh",
      "Dinh-Hieu Tran",
      "Symeon Chatzinotas"
    ],
    "summary": "The deployment of Unmanned Aerial Vehicle (UAV) swarms as dynamic communication relays is critical for next-generation tactical networks. However, operating in contested environments requires solving a complex trade-off, including maximizing system throughput while ensuring collision avoidance and resilience against adversarial jamming. Existing heuristic-based approaches often struggle to find effective solutions due to the dynamic and multi-objective nature of this problem. This paper formulat",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08341v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08341v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08341v1_Multi-Agent_Deep_Reinforcement_Learning_for_Collaborative_UAV_Relay_Networks_under_Jamming_Atatcks.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08996v1",
    "title": "Demo: Generative AI helps Radiotherapy Planning with User Preference",
    "authors": [
      "Riqiang Gao",
      "Simon Arberet",
      "Martin Kraus",
      "Han Liu",
      "Wilko FAR Verbakel",
      "Dorin Comaniciu",
      "Florin-Cristian Ghesu",
      "Ali Kamen"
    ],
    "summary": "Radiotherapy planning is a highly complex process that often varies significantly across institutions and individual planners. Most existing deep learning approaches for 3D dose prediction rely on reference plans as ground truth during training, which can inadvertently bias models toward specific planning styles or institutional preferences. In this study, we introduce a novel generative model that predicts 3D dose distributions based solely on user-defined preference flavors. These customizable",
    "published": "2025-12-08",
    "url": "http://arxiv.org/abs/2512.08996v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08996v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08996v1_Demo_Generative_AI_helps_Radiotherapy_Planning_with_User_Preference.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.15732v1",
    "title": "The Red Queen's Trap: Limits of Deep Evolution in High-Frequency Trading",
    "authors": [
      "Yijia Chen"
    ],
    "summary": "The integration of Deep Reinforcement Learning (DRL) and Evolutionary Computation (EC) is frequently hypothesized to be the \"Holy Grail\" of algorithmic trading, promising systems that adapt autonomously to non-stationary market regimes. This paper presents a rigorous post-mortem analysis of \"Galaxy Empire,\" a hybrid framework coupling LSTM/Transformer-based perception with a genetic \"Time-is-Life\" survival mechanism. Deploying a population of 500 autonomous agents in a high-frequency cryptocurre",
    "published": "2025-12-05",
    "url": "http://arxiv.org/abs/2512.15732v1",
    "pdf_url": "https://arxiv.org/pdf/2512.15732v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.15732v1_The_Red_Queens_Trap_Limits_of_Deep_Evolution_in_High-Frequency_Trading.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.02272v1",
    "title": "Intrusion Detection on Resource-Constrained IoT Devices with Hardware-Aware ML and DL",
    "authors": [
      "Ali Diab",
      "Adel Chehade",
      "Edoardo Ragusa",
      "Paolo Gastaldo",
      "Rodolfo Zunino",
      "Amer Baghdadi",
      "Mostafa Rizk"
    ],
    "summary": "This paper proposes a hardware-aware intrusion detection system (IDS) for Internet of Things (IoT) and Industrial IoT (IIoT) networks; it targets scenarios where classification is essential for fast, privacy-preserving, and resource-efficient threat detection. The goal is to optimize both tree-based machine learning (ML) models and compact deep neural networks (DNNs) within strict edge-device constraints. This allows for a fair comparison and reveals trade-offs between model families. We apply c",
    "published": "2025-12-01",
    "url": "http://arxiv.org/abs/2512.02272v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02272v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.02272v1_Intrusion_Detection_on_Resource-Constrained_IoT_Devices_with_Hardware-Aware_ML_and_DL.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.01392v1",
    "title": "RE-LLM: Integrating Large Language Models into Renewable Energy Systems",
    "authors": [
      "Ali Forootani",
      "Mohammad Sadr",
      "Danial Esmaeili Aliabadi",
      "Daniela Thraen"
    ],
    "summary": "Energy system models are increasingly employed to guide long-term planning in multi-sectoral environments where decisions span electricity, heat, transport, land use, and industry. While these models provide rigorous quantitative insights, their outputs are often highly technical, making them difficult to interpret for non-expert stakeholders such as policymakers, planners, and the public. This communication gap limits the accessibility and practical impact of scenario-based modeling, particular",
    "published": "2025-12-01",
    "url": "http://arxiv.org/abs/2512.01392v1",
    "pdf_url": "https://arxiv.org/pdf/2512.01392v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.01392v1_RE-LLM_Integrating_Large_Language_Models_into_Renewable_Energy_Systems.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.23148v1",
    "title": "Peer-to-Peer Energy Trading in Dairy Farms using Multi-Agent Reinforcement Learning",
    "authors": [
      "Mian Ibad Ali Shah",
      "Marcos Eduardo Cruz Victorio",
      "Maeve Duffy",
      "Enda Barrett",
      "Karl Mason"
    ],
    "summary": "The integration of renewable energy resources in rural areas, such as dairy farming communities, enables decentralized energy management through Peer-to-Peer (P2P) energy trading. This research highlights the role of P2P trading in efficient energy distribution and its synergy with advanced optimization techniques. While traditional rule-based methods perform well under stable conditions, they struggle in dynamic environments. To address this, Multi-Agent Reinforcement Learning (MARL), specifica",
    "published": "2025-11-28",
    "url": "http://arxiv.org/abs/2511.23148v1",
    "pdf_url": "https://arxiv.org/pdf/2511.23148v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.23148v1_Peer-to-Peer_Energy_Trading_in_Dairy_Farms_using_Multi-Agent_Reinforcement_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.23122v1",
    "title": "Evolutionary Discovery of Heuristic Policies for Traffic Signal Control",
    "authors": [
      "Ruibing Wang",
      "Shuhan Guo",
      "Zeen Li",
      "Zhen Wang",
      "Quanming Yao"
    ],
    "summary": "Traffic Signal Control (TSC) involves a challenging trade-off: classic heuristics are efficient but oversimplified, while Deep Reinforcement Learning (DRL) achieves high performance yet suffers from poor generalization and opaque policies. Online Large Language Models (LLMs) provide general reasoning but incur high latency and lack environment-specific optimization. To address these issues, we propose Temporal Policy Evolution for Traffic (\\textbf{\\method{}}), which uses LLMs as an evolution eng",
    "published": "2025-11-28",
    "url": "http://arxiv.org/abs/2511.23122v1",
    "pdf_url": "https://arxiv.org/pdf/2511.23122v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.23122v1_Evolutionary_Discovery_of_Heuristic_Policies_for_Traffic_Signal_Control.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.05976v1",
    "title": "Physics Enhanced Deep Surrogates for the Phonon Boltzmann Transport Equation",
    "authors": [
      "Antonio Varagnolo",
      "Giuseppe Romano",
      "Raphaël Pestourie"
    ],
    "summary": "Designing materials with controlled heat flow at the nano-scale is central to advances in microelectronics, thermoelectrics, and energy-conversion technologies. At these scales, phonon transport follows the Boltzmann Transport Equation (BTE), which captures non-diffusive (ballistic) effects but is too costly to solve repeatedly in inverse-design loops. Existing surrogate approaches trade speed for accuracy: fast macroscopic solvers can overestimate conductivities by hundreds of percent, while re",
    "published": "2025-11-25",
    "url": "http://arxiv.org/abs/2512.05976v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05976v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.05976v1_Physics_Enhanced_Deep_Surrogates_for_the_Phonon_Boltzmann_Transport_Equation.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.18422v1",
    "title": "NeuroVascU-Net: A Unified Multi-Scale and Cross-Domain Adaptive Feature Fusion U-Net for Precise 3D Segmentation of Brain Vessels in Contrast-Enhanced T1 MRI",
    "authors": [
      "Mohammad Jafari Vayeghan",
      "Niloufar Delfan",
      "Mehdi Tale Masouleh",
      "Mansour Parvaresh Rizi",
      "Behzad Moshiri"
    ],
    "summary": "Precise 3D segmentation of cerebral vasculature from T1-weighted contrast-enhanced (T1CE) MRI is crucial for safe neurosurgical planning. Manual delineation is time-consuming and prone to inter-observer variability, while current automated methods often trade accuracy for computational cost, limiting clinical use. We present NeuroVascU-Net, the first deep learning architecture specifically designed to segment cerebrovascular structures directly from clinically standard T1CE MRI in neuro-oncology",
    "published": "2025-11-23",
    "url": "http://arxiv.org/abs/2511.18422v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18422v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.18422v1_NeuroVascU-Net_A_Unified_Multi-Scale_and_Cross-Domain_Adaptive_Feature_Fusion_U-Net_for_Precise_3D_S.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.04099v1",
    "title": "Partial multivariate transformer as a tool for cryptocurrencies time series prediction",
    "authors": [
      "Andrzej Tokajuk",
      "Jarosław A. Chudziak"
    ],
    "summary": "Forecasting cryptocurrency prices is hindered by extreme volatility and a methodological dilemma between information-scarce univariate models and noise-prone full-multivariate models. This paper investigates a partial-multivariate approach to balance this trade-off, hypothesizing that a strategic subset of features offers superior predictive power. We apply the Partial-Multivariate Transformer (PMformer) to forecast daily returns for BTCUSDT and ETHUSDT, benchmarking it against eleven classical ",
    "published": "2025-11-22",
    "url": "http://arxiv.org/abs/2512.04099v1",
    "pdf_url": "https://arxiv.org/pdf/2512.04099v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.04099v1_Partial_multivariate_transformer_as_a_tool_for_cryptocurrencies_time_series_prediction.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.16854v3",
    "title": "MRI Super-Resolution with Deep Learning: A Comprehensive Survey",
    "authors": [
      "Mohammad Khateri",
      "Serge Vasylechko",
      "Morteza Ghahremani",
      "Liam Timms",
      "Deniz Kocanaogullari",
      "Simon K. Warfield",
      "Camilo Jaimes",
      "Davood Karimi",
      "Alejandra Sierra",
      "Jussi Tohka",
      "Sila Kurugol",
      "Onur Afacan"
    ],
    "summary": "High-resolution (HR) magnetic resonance imaging (MRI) is crucial for many clinical and research applications. However, achieving it remains costly and constrained by technical trade-offs and experimental limitations. Super-resolution (SR) presents a promising computational approach to overcome these challenges by generating HR images from more affordable low-resolution (LR) scans, potentially improving diagnostic accuracy and efficiency without requiring additional hardware. This survey reviews ",
    "published": "2025-11-20",
    "url": "http://arxiv.org/abs/2511.16854v3",
    "pdf_url": "https://arxiv.org/pdf/2511.16854v3",
    "pdf_path": "pdfs_articles\\arxiv\\2511.16854v3_MRI_Super-Resolution_with_Deep_Learning_A_Comprehensive_Survey.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.02037v1",
    "title": "Statistical Arbitrage in Polish Equities Market Using Deep Learning Techniques",
    "authors": [
      "Marek Adamczyk",
      "Michał Dąbrowski"
    ],
    "summary": "We study a systematic approach to a popular Statistical Arbitrage technique: Pairs Trading. Instead of relying on two highly correlated assets, we replace the second asset with a replication of the first using risk factor representations. These factors are obtained through Principal Components Analysis (PCA), exchange traded funds (ETFs), and, as our main contribution, Long Short Term Memory networks (LSTMs). Residuals between the main asset and its replication are examined for mean reversion pr",
    "published": "2025-11-20",
    "url": "http://arxiv.org/abs/2512.02037v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02037v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.02037v1_Statistical_Arbitrage_in_Polish_Equities_Market_Using_Deep_Learning_Techniques.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.02036v1",
    "title": "Integration of LSTM Networks in Random Forest Algorithms for Stock Market Trading Predictions",
    "authors": [
      "Juan C. King",
      "Jose M. Amigo"
    ],
    "summary": "The aim of this paper is the analysis and selection of stock trading systems that combine different models with data of different nature, such as financial and microeconomic information. Specifically, based on previous work by the authors and applying advanced techniques of Machine Learning and Deep Learning, our objective is to formulate trading algorithms for the stock market with empirically tested statistical advantages, thus improving results published in the literature. Our approach integr",
    "published": "2025-11-20",
    "url": "http://arxiv.org/abs/2512.02036v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02036v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.02036v1_Integration_of_LSTM_Networks_in_Random_Forest_Algorithms_for_Stock_Market_Trading_Predictions.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.15262v1",
    "title": "Reinforcement Learning in Queue-Reactive Models: Application to Optimal Execution",
    "authors": [
      "Tomas Espana",
      "Yadh Hafsi",
      "Fabrizio Lillo",
      "Edoardo Vittori"
    ],
    "summary": "We investigate the use of Reinforcement Learning for the optimal execution of meta-orders, where the objective is to execute incrementally large orders while minimizing implementation shortfall and market impact over an extended period of time. Departing from traditional parametric approaches to price dynamics and impact modeling, we adopt a model-free, data-driven framework. Since policy optimization requires counterfactual feedback that historical data cannot provide, we employ the Queue-React",
    "published": "2025-11-19",
    "url": "http://arxiv.org/abs/2511.15262v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15262v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.15262v1_Reinforcement_Learning_in_Queue-Reactive_Models_Application_to_Optimal_Execution.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.13365v1",
    "title": "InfoDecom: Decomposing Information for Defending against Privacy Leakage in Split Inference",
    "authors": [
      "Ruijun Deng",
      "Zhihui Lu",
      "Qiang Duan"
    ],
    "summary": "Split inference (SI) enables users to access deep learning (DL) services without directly transmitting raw data. However, recent studies reveal that data reconstruction attacks (DRAs) can recover the original inputs from the smashed data sent from the client to the server, leading to significant privacy leakage. While various defenses have been proposed, they often result in substantial utility degradation, particularly when the client-side model is shallow. We identify a key cause of this trade",
    "published": "2025-11-17",
    "url": "http://arxiv.org/abs/2511.13365v1",
    "pdf_url": "https://arxiv.org/pdf/2511.13365v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.13365v1_InfoDecom_Decomposing_Information_for_Defending_against_Privacy_Leakage_in_Split_Inference.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.20678v1",
    "title": "Cryptocurrency Portfolio Management with Reinforcement Learning: Soft Actor--Critic and Deep Deterministic Policy Gradient Algorithms",
    "authors": [
      "Kamal Paykan"
    ],
    "summary": "This paper proposes a reinforcement learning--based framework for cryptocurrency portfolio management using the Soft Actor--Critic (SAC) and Deep Deterministic Policy Gradient (DDPG) algorithms. Traditional portfolio optimization methods often struggle to adapt to the highly volatile and nonlinear dynamics of cryptocurrency markets. To address this, we design an agent that learns continuous trading actions directly from historical market data through interaction with a simulated trading environm",
    "published": "2025-11-16",
    "url": "http://arxiv.org/abs/2511.20678v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20678v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.20678v1_Cryptocurrency_Portfolio_Management_with_Reinforcement_Learning_Soft_Actor--Critic_and_Deep_Determin.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.12122v1",
    "title": "Dynamic Anomaly Identification in Accounting Transactions via Multi-Head Self-Attention Networks",
    "authors": [
      "Yi Wang",
      "Ruoyi Fang",
      "Anzhuo Xie",
      "Hanrui Feng",
      "Jianlin Lai"
    ],
    "summary": "This study addresses the problem of dynamic anomaly detection in accounting transactions and proposes a real-time detection method based on a Transformer to tackle the challenges of hidden abnormal behaviors and high timeliness requirements in complex trading environments. The approach first models accounting transaction data by representing multi-dimensional records as time-series matrices and uses embedding layers and positional encoding to achieve low-dimensional mapping of inputs. A sequence",
    "published": "2025-11-15",
    "url": "http://arxiv.org/abs/2511.12122v1",
    "pdf_url": "https://arxiv.org/pdf/2511.12122v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.12122v1_Dynamic_Anomaly_Identification_in_Accounting_Transactions_via_Multi-Head_Self-Attention_Networks.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.12120v1",
    "title": "Deep Reinforcement Learning for Automated Stock Trading: An Ensemble Strategy",
    "authors": [
      "Hongyang Yang",
      "Xiao-Yang Liu",
      "Shan Zhong",
      "Anwar Walid"
    ],
    "summary": "Stock trading strategies play a critical role in investment. However, it is challenging to design a profitable strategy in a complex and dynamic stock market. In this paper, we propose an ensemble strategy that employs deep reinforcement schemes to learn a stock trading strategy by maximizing investment return. We train a deep reinforcement learning agent and obtain an ensemble trading strategy using three actor-critic based algorithms: Proximal Policy Optimization (PPO), Advantage Actor Critic ",
    "published": "2025-11-15",
    "url": "http://arxiv.org/abs/2511.12120v1",
    "pdf_url": "https://arxiv.org/pdf/2511.12120v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.12120v1_Deep_Reinforcement_Learning_for_Automated_Stock_Trading_An_Ensemble_Strategy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.11880v1",
    "title": "Transformers vs. Recurrent Models for Estimating Forest Gross Primary Production",
    "authors": [
      "David Montero",
      "Miguel D. Mahecha",
      "Francesco Martinuzzi",
      "César Aybar",
      "Anne Klosterhalfen",
      "Alexander Knohl",
      "Jesús Anaya",
      "Clemens Mosig",
      "Sebastian Wieneke"
    ],
    "summary": "Monitoring the spatiotemporal dynamics of forest CO$_2$ uptake (Gross Primary Production, GPP), remains a central challenge in terrestrial ecosystem research. While Eddy Covariance (EC) towers provide high-frequency estimates, their limited spatial coverage constrains large-scale assessments. Remote sensing offers a scalable alternative, yet most approaches rely on single-sensor spectral indices and statistical models that are often unable to capture the complex temporal dynamics of GPP. Recent ",
    "published": "2025-11-14",
    "url": "http://arxiv.org/abs/2511.11880v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11880v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.11880v1_Transformers_vs_Recurrent_Models_for_Estimating_Forest_Gross_Primary_Production.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.10435v1",
    "title": "Neuronal Fluctuations: Learning Rates vs Participating Neurons",
    "authors": [
      "Darsh Pareek",
      "Umesh Kumar",
      "Ruthu Rao",
      "Ravi Janjam"
    ],
    "summary": "Deep Neural Networks (DNNs) rely on inherent fluctuations in their internal parameters (weights and biases) to effectively navigate the complex optimization landscape and achieve robust performance. While these fluctuations are recognized as crucial for escaping local minima and improving generalization, their precise relationship with fundamental hyperparameters remains underexplored. A significant knowledge gap exists concerning how the learning rate, a critical parameter governing the trainin",
    "published": "2025-11-13",
    "url": "http://arxiv.org/abs/2511.10435v1",
    "pdf_url": "https://arxiv.org/pdf/2511.10435v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.10435v1_Neuronal_Fluctuations_Learning_Rates_vs_Participating_Neurons.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.07560v1",
    "title": "EvoPS: Evolutionary Patch Selection for Whole Slide Image Analysis in Computational Pathology",
    "authors": [
      "Saya Hashemian",
      "Azam Asilian Bidgoli"
    ],
    "summary": "In computational pathology, the gigapixel scale of Whole-Slide Images (WSIs) necessitates their division into thousands of smaller patches. Analyzing these high-dimensional patch embeddings is computationally expensive and risks diluting key diagnostic signals with many uninformative patches. Existing patch selection methods often rely on random sampling or simple clustering heuristics and typically fail to explicitly manage the crucial trade-off between the number of selected patches and the ac",
    "published": "2025-11-10",
    "url": "http://arxiv.org/abs/2511.07560v1",
    "pdf_url": "https://arxiv.org/pdf/2511.07560v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.07560v1_EvoPS_Evolutionary_Patch_Selection_for_Whole_Slide_Image_Analysis_in_Computational_Pathology.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.07210v2",
    "title": "Breaking the Stealth-Potency Trade-off in Clean-Image Backdoors with Generative Trigger Optimization",
    "authors": [
      "Binyan Xu",
      "Fan Yang",
      "Di Tang",
      "Xilin Dai",
      "Kehuan Zhang"
    ],
    "summary": "Clean-image backdoor attacks, which use only label manipulation in training datasets to compromise deep neural networks, pose a significant threat to security-critical applications. A critical flaw in existing methods is that the poison rate required for a successful attack induces a proportional, and thus noticeable, drop in Clean Accuracy (CA), undermining their stealthiness. This paper presents a new paradigm for clean-image attacks that minimizes this accuracy degradation by optimizing the t",
    "published": "2025-11-10",
    "url": "http://arxiv.org/abs/2511.07210v2",
    "pdf_url": "https://arxiv.org/pdf/2511.07210v2",
    "pdf_path": "pdfs_articles\\arxiv\\2511.07210v2_Breaking_the_Stealth-Potency_Trade-off_in_Clean-Image_Backdoors_with_Generative_Trigger_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.07118v1",
    "title": "On the Joint Minimization of Regularization Loss Functions in Deep Variational Bayesian Methods for Attribute-Controlled Symbolic Music Generation",
    "authors": [
      "Matteo Pettenó",
      "Alessandro Ilic Mezza",
      "Alberto Bernardini"
    ],
    "summary": "Explicit latent variable models provide a flexible yet powerful framework for data synthesis, enabling controlled manipulation of generative factors. With latent variables drawn from a tractable probability density function that can be further constrained, these models enable continuous and semantically rich exploration of the output space by navigating their latent spaces. Structured latent representations are typically obtained through the joint minimization of regularization loss functions. I",
    "published": "2025-11-10",
    "url": "http://arxiv.org/abs/2511.07118v1",
    "pdf_url": "https://arxiv.org/pdf/2511.07118v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.07118v1_On_the_Joint_Minimization_of_Regularization_Loss_Functions_in_Deep_Variational_Bayesian_Methods_for_.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.05861v2",
    "title": "Equilibrium Portfolio Selection under Utility-Variance Analysis of Log Returns in Incomplete Markets",
    "authors": [
      "Yue Cao",
      "Zongxia Liang",
      "Sheng Wang",
      "Xiang Yu"
    ],
    "summary": "This paper investigates a time-inconsistent portfolio selection problem in the incomplete mar ket model, integrating expected utility maximization with risk control. The objective functional\n  balances the expected utility and variance on log returns, giving rise to time inconsistency and\n  motivating the search of a time-consistent equilibrium strategy. We characterize the equilibrium\n  via a coupled quadratic backward stochastic differential equation (BSDE) system and establish\n  the existence",
    "published": "2025-11-08",
    "url": "http://arxiv.org/abs/2511.05861v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05861v2",
    "pdf_path": "pdfs_articles\\arxiv\\2511.05861v2_Equilibrium_Portfolio_Selection_under_Utility-Variance_Analysis_of_Log_Returns_in_Incomplete_Markets.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.03670v1",
    "title": "DQN Performance with Epsilon Greedy Policies and Prioritized Experience Replay",
    "authors": [
      "Daniel Perkins",
      "Oscar J. Escobar",
      "Luke Green"
    ],
    "summary": "We present a detailed study of Deep Q-Networks in finite environments, emphasizing the impact of epsilon-greedy exploration schedules and prioritized experience replay. Through systematic experimentation, we evaluate how variations in epsilon decay schedules affect learning efficiency, convergence behavior, and reward optimization. We investigate how prioritized experience replay leads to faster convergence and higher returns and show empirical results comparing uniform, no replay, and prioritiz",
    "published": "2025-11-05",
    "url": "http://arxiv.org/abs/2511.03670v1",
    "pdf_url": "https://arxiv.org/pdf/2511.03670v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.03670v1_DQN_Performance_with_Epsilon_Greedy_Policies_and_Prioritized_Experience_Replay.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.05568v1",
    "title": "Adaptive Sample-Level Framework Motivated by Distributionally Robust Optimization with Variance-Based Radius Assignment for Enhanced Neural Network Generalization Under Distribution Shift",
    "authors": [
      "Aheer Sravon",
      "Devdyuti Mazumder",
      "Md. Ibrahim"
    ],
    "summary": "Distribution shifts and minority subpopulations frequently undermine the reliability of deep neural networks trained using Empirical Risk Minimization (ERM). Distributionally Robust Optimization (DRO) addresses this by optimizing for the worst-case risk within a neighborhood of the training distribution. However, conventional methods depend on a single, global robustness budget, which can lead to overly conservative models or a misallocation of robustness. We propose a variance-driven, adaptive,",
    "published": "2025-11-04",
    "url": "http://arxiv.org/abs/2511.05568v1",
    "pdf_url": "https://arxiv.org/pdf/2511.05568v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.05568v1_Adaptive_Sample-Level_Framework_Motivated_by_Distributionally_Robust_Optimization_with_Variance-Base.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.00190v1",
    "title": "Deep reinforcement learning for optimal trading with partial information",
    "authors": [
      "Andrea Macrì",
      "Sebastian Jaimungal",
      "Fabrizio Lillo"
    ],
    "summary": "Reinforcement Learning (RL) applied to financial problems has been the subject of a lively area of research. The use of RL for optimal trading strategies that exploit latent information in the market is, to the best of our knowledge, not widely tackled. In this paper we study an optimal trading problem, where a trading signal follows an Ornstein-Uhlenbeck process with regime-switching dynamics. We employ a blend of RL and Recurrent Neural Networks (RNN) in order to make the most at extracting un",
    "published": "2025-10-31",
    "url": "http://arxiv.org/abs/2511.00190v1",
    "pdf_url": "https://arxiv.org/pdf/2511.00190v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.00190v1_Deep_reinforcement_learning_for_optimal_trading_with_partial_information.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.26438v2",
    "title": "An Impulse Control Approach to Market Making in a Hawkes LOB Market",
    "authors": [
      "Konark Jain",
      "Nick Firoozye",
      "Jonathan Kochems",
      "Philip Treleaven"
    ],
    "summary": "We study the optimal Market Making problem in a Limit Order Book (LOB) market simulated using a high-fidelity, mutually exciting Hawkes process. Departing from traditional Brownian-driven mid-price models, our setup captures key microstructural properties such as queue dynamics, inter-arrival clustering, and endogenous price impact. Recognizing the realistic constraint that market makers cannot update strategies at every LOB event, we formulate the control problem within an impulse control frame",
    "published": "2025-10-30",
    "url": "http://arxiv.org/abs/2510.26438v2",
    "pdf_url": "https://arxiv.org/pdf/2510.26438v2",
    "pdf_path": "pdfs_articles\\arxiv\\2510.26438v2_An_Impulse_Control_Approach_to_Market_Making_in_a_Hawkes_LOB_Market.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.05529v2",
    "title": "Selective Diabetic Retinopathy Screening with Accuracy-Weighted Deep Ensembles and Entropy-Guided Abstention",
    "authors": [
      "Jophy Lin"
    ],
    "summary": "Diabetic retinopathy (DR), a microvascular complication of diabetes and a leading cause of preventable blindness, is projected to affect more than 130 million individuals worldwide by 2030. Early identification is essential to reduce irreversible vision loss, yet current diagnostic workflows rely on methods such as fundus photography and expert review, which remain costly and resource-intensive. This, combined with DR's asymptomatic nature, results in its underdiagnosis rate of approximately 25 ",
    "published": "2025-10-29",
    "url": "http://arxiv.org/abs/2511.05529v2",
    "pdf_url": "https://arxiv.org/pdf/2511.05529v2",
    "pdf_path": "pdfs_articles\\arxiv\\2511.05529v2_Selective_Diabetic_Retinopathy_Screening_with_Accuracy-Weighted_Deep_Ensembles_and_Entropy-Guided_Ab.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.24699v1",
    "title": "AgentFold: Long-Horizon Web Agents with Proactive Context Management",
    "authors": [
      "Rui Ye",
      "Zhongwang Zhang",
      "Kuan Li",
      "Huifeng Yin",
      "Zhengwei Tao",
      "Yida Zhao",
      "Liangcai Su",
      "Liwen Zhang",
      "Zile Qiao",
      "Xinyu Wang",
      "Pengjun Xie",
      "Fei Huang",
      "Siheng Chen",
      "Jingren Zhou",
      "Yong Jiang"
    ],
    "summary": "LLM-based web agents show immense promise for information seeking, yet their effectiveness on long-horizon tasks is hindered by a fundamental trade-off in context management. Prevailing ReAct-based agents suffer from context saturation as they accumulate noisy, raw histories, while methods that fixedly summarize the full history at each step risk the irreversible loss of critical details. Addressing these, we introduce AgentFold, a novel agent paradigm centered on proactive context management, i",
    "published": "2025-10-28",
    "url": "http://arxiv.org/abs/2510.24699v1",
    "pdf_url": "https://arxiv.org/pdf/2510.24699v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.24699v1_AgentFold_Long-Horizon_Web_Agents_with_Proactive_Context_Management.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.23507v1",
    "title": "A Deep Latent Factor Graph Clustering with Fairness-Utility Trade-off Perspective",
    "authors": [
      "Siamak Ghodsi",
      "Amjad Seyedi",
      "Tai Le Quy",
      "Fariba Karimi",
      "Eirini Ntoutsi"
    ],
    "summary": "Fair graph clustering seeks partitions that respect network structure while maintaining proportional representation across sensitive groups, with applications spanning community detection, team formation, resource allocation, and social network analysis. Many existing approaches enforce rigid constraints or rely on multi-stage pipelines (e.g., spectral embedding followed by $k$-means), limiting trade-off control, interpretability, and scalability. We introduce \\emph{DFNMF}, an end-to-end deep no",
    "published": "2025-10-27",
    "url": "http://arxiv.org/abs/2510.23507v1",
    "pdf_url": "https://arxiv.org/pdf/2510.23507v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.23507v1_A_Deep_Latent_Factor_Graph_Clustering_with_Fairness-Utility_Trade-off_Perspective.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.22685v1",
    "title": "TABL-ABM: A Hybrid Framework for Synthetic LOB Generation",
    "authors": [
      "Ollie Olby",
      "Rory Baggott",
      "Namid Stillman"
    ],
    "summary": "The recent application of deep learning models to financial trading has heightened the need for high fidelity financial time series data. This synthetic data can be used to supplement historical data to train large trading models. The state-of-the-art models for the generative application often rely on huge amounts of historical data and large, complicated models. These models range from autoregressive and diffusion-based models through to architecturally simpler models such as the temporal-atte",
    "published": "2025-10-26",
    "url": "http://arxiv.org/abs/2510.22685v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22685v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.22685v1_TABL-ABM_A_Hybrid_Framework_for_Synthetic_LOB_Generation.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.21127v1",
    "title": "Enhanced Evolutionary Multi-Objective Deep Reinforcement Learning for Reliable and Efficient Wireless Rechargeable Sensor Networks",
    "authors": [
      "Bowei Tong",
      "Hui Kang",
      "Jiahui Li",
      "Geng Sun",
      "Jiacheng Wang",
      "Yaoqi Yang",
      "Bo Xu",
      "Dusit Niyato"
    ],
    "summary": "Despite rapid advancements in sensor networks, conventional battery-powered sensor networks suffer from limited operational lifespans and frequent maintenance requirements that severely constrain their deployment in remote and inaccessible environments. As such, wireless rechargeable sensor networks (WRSNs) with mobile charging capabilities offer a promising solution to extend network lifetime. However, WRSNs face critical challenges from the inherent trade-off between maximizing the node surviv",
    "published": "2025-10-24",
    "url": "http://arxiv.org/abs/2510.21127v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21127v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.21127v1_Enhanced_Evolutionary_Multi-Objective_Deep_Reinforcement_Learning_for_Reliable_and_Efficient_Wireles.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.19352v1",
    "title": "ConvXformer: Differentially Private Hybrid ConvNeXt-Transformer for Inertial Navigation",
    "authors": [
      "Omer Tariq",
      "Muhammad Bilal",
      "Muneeb Ul Hassan",
      "Dongsoo Han",
      "Jon Crowcroft"
    ],
    "summary": "Data-driven inertial sequence learning has revolutionized navigation in GPS-denied environments, offering superior odometric resolution compared to traditional Bayesian methods. However, deep learning-based inertial tracking systems remain vulnerable to privacy breaches that can expose sensitive training data. \\hl{Existing differential privacy solutions often compromise model performance by introducing excessive noise, particularly in high-frequency inertial measurements.} In this article, we pr",
    "published": "2025-10-22",
    "url": "http://arxiv.org/abs/2510.19352v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19352v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.19352v1_ConvXformer_Differentially_Private_Hybrid_ConvNeXt-Transformer_for_Inertial_Navigation.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.19173v1",
    "title": "News-Aware Direct Reinforcement Trading for Financial Markets",
    "authors": [
      "Qing-Yu Lan",
      "Zhan-He Wang",
      "Jun-Qian Jiang",
      "Yu-Tong Wang",
      "Yun-Song Piao"
    ],
    "summary": "The financial market is known to be highly sensitive to news. Therefore, effectively incorporating news data into quantitative trading remains an important challenge. Existing approaches typically rely on manually designed rules and/or handcrafted features. In this work, we directly use the news sentiment scores derived from large language models, together with raw price and volume data, as observable inputs for reinforcement learning. These inputs are processed by sequence models such as recurr",
    "published": "2025-10-22",
    "url": "http://arxiv.org/abs/2510.19173v1",
    "pdf_url": "https://arxiv.org/pdf/2510.19173v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.19173v1_News-Aware_Direct_Reinforcement_Trading_for_Financial_Markets.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.18904v1",
    "title": "DuoLens: A Framework for Robust Detection of Machine-Generated Multilingual Text and Code",
    "authors": [
      "Shriyansh Agrawal",
      "Aidan Lau",
      "Sanyam Shah",
      "Ahan M R",
      "Kevin Zhu",
      "Sunishchal Dev",
      "Vasu Sharma"
    ],
    "summary": "The prevalence of Large Language Models (LLMs) for generating multilingual text and source code has only increased the imperative for machine-generated content detectors to be accurate and efficient across domains. Current detectors, predominantly utilizing zero-shot methods, such as Fast DetectGPT or GPTZero, either incur high computational cost or lack sufficient accuracy, often with a trade-off between the two, leaving room for further improvement. To address these gaps, we propose the fine-t",
    "published": "2025-10-21",
    "url": "http://arxiv.org/abs/2510.18904v1",
    "pdf_url": "https://arxiv.org/pdf/2510.18904v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.18904v1_DuoLens_A_Framework_for_Robust_Detection_of_Machine-Generated_Multilingual_Text_and_Code.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.20755v1",
    "title": "Bridging Efficiency and Safety: Formal Verification of Neural Networks with Early Exits",
    "authors": [
      "Yizhak Yisrael Elboher",
      "Avraham Raviv",
      "Amihay Elboher",
      "Zhouxing Shi",
      "Omri Azencot",
      "Hillel Kugler",
      "Guy Katz"
    ],
    "summary": "Ensuring the safety and efficiency of AI systems is a central goal of modern research. Formal verification provides guarantees of neural network robustness, while early exits improve inference efficiency by enabling intermediate predictions. Yet verifying networks with early exits introduces new challenges due to their conditional execution paths. In this work, we define a robustness property tailored to early exit architectures and show how off-the-shelf solvers can be used to assess it. We pre",
    "published": "2025-12-23",
    "url": "http://arxiv.org/abs/2512.20755v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20755v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.20755v1_Bridging_Efficiency_and_Safety_Formal_Verification_of_Neural_Networks_with_Early_Exits.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17968v1",
    "title": "A Critical Review of Monte Carlo Algorithms Balancing Performance and Probabilistic Accuracy with AI Augmented Framework",
    "authors": [
      "Ravi Prasad"
    ],
    "summary": "Monte Carlo algorithms are a foundational pillar of modern computational science, yet their effective application hinges on a deep understanding of their performance trade offs. This paper presents a critical analysis of the evolution of Monte Carlo algorithms, focusing on the persistent tension between statistical efficiency and computational cost. We describe the historical development from the foundational Metropolis Hastings algorithm to contemporary methods like Hamiltonian Monte Carlo. A c",
    "published": "2025-12-19",
    "url": "http://arxiv.org/abs/2512.17968v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17968v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17968v1_A_Critical_Review_of_Monte_Carlo_Algorithms_Balancing_Performance_and_Probabilistic_Accuracy_with_AI.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.11933v1",
    "title": "The Agentic Regulator: Risks for AI in Finance and a Proposed Agent-based Framework for Governance",
    "authors": [
      "Eren Kurshan",
      "Tucker Balch",
      "David Byrd"
    ],
    "summary": "Generative and agentic artificial intelligence is entering financial markets faster than existing governance can adapt. Current model-risk frameworks assume static, well-specified algorithms and one-time validations; large language models and multi-agent trading systems violate those assumptions by learning continuously, exchanging latent signals, and exhibiting emergent behavior. Drawing on complex adaptive systems theory, we model these technologies as decentralized ensembles whose risks propa",
    "published": "2025-12-12",
    "url": "http://arxiv.org/abs/2512.11933v1",
    "pdf_url": "https://arxiv.org/pdf/2512.11933v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.11933v1_The_Agentic_Regulator_Risks_for_AI_in_Finance_and_a_Proposed_Agent-based_Framework_for_Governance.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.03477v2",
    "title": "Fairness-Aware Fine-Tuning of Vision-Language Models for Medical Glaucoma Diagnosis",
    "authors": [
      "Zijian Gu",
      "Yuxi Liu",
      "Zhenhao Zhang",
      "Song Wang"
    ],
    "summary": "Vision-language models achieve expert-level performance on medical imaging tasks but exhibit significant diagnostic accuracy disparities across demographic groups. We introduce fairness-aware Low-Rank Adaptation for medical VLMs, combining parameter efficiency with explicit fairness optimization. Our key algorithmic contribution is a differentiable MaxAccGap loss that enables end-to-end optimization of accuracy parity across demographic groups. We propose three methods: FR-LoRA integrates MaxAcc",
    "published": "2025-12-03",
    "url": "http://arxiv.org/abs/2512.03477v2",
    "pdf_url": "https://arxiv.org/pdf/2512.03477v2",
    "pdf_path": "pdfs_articles\\arxiv\\2512.03477v2_Fairness-Aware_Fine-Tuning_of_Vision-Language_Models_for_Medical_Glaucoma_Diagnosis.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.02227v1",
    "title": "Orchestration Framework for Financial Agents: From Algorithmic Trading to Agentic Trading",
    "authors": [
      "Jifeng Li",
      "Arnav Grover",
      "Abraham Alpuerto",
      "Yupeng Cao",
      "Xiao-Yang Liu"
    ],
    "summary": "The financial market is a mission-critical playground for AI agents due to its temporal dynamics and low signal-to-noise ratio. Building an effective algorithmic trading system may require a professional team to develop and test over the years. In this paper, we propose an orchestration framework for financial agents, which aims to democratize financial intelligence to the general public. We map each component of the traditional algorithmic trading system to agents, including planner, orchestrat",
    "published": "2025-12-01",
    "url": "http://arxiv.org/abs/2512.02227v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02227v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.02227v1_Orchestration_Framework_for_Financial_Agents_From_Algorithmic_Trading_to_Agentic_Trading.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.21050v1",
    "title": "Breaking the Safety-Capability Tradeoff: Reinforcement Learning with Verifiable Rewards Maintains Safety Guardrails in LLMs",
    "authors": [
      "Dongkyu Derek Cho",
      "Huan Song",
      "Arijit Ghosh Chowdhury",
      "Haotian An",
      "Yawei Wang",
      "Rohit Thekkanal",
      "Negin Sokhandan",
      "Sharlina Keshava",
      "Hannah Marlowe"
    ],
    "summary": "Fine-tuning large language models (LLMs) for downstream tasks typically exhibit a fundamental safety-capability tradeoff, where improving task performance degrades safety alignment even on benign datasets. This degradation persists across standard approaches including supervised finetuning (SFT) and reinforcement learning from human feedback (RLHF). While reinforcement learning with verifiable rewards (RLVR) has emerged as a promising alternative that optimizes models on objectively measurable t",
    "published": "2025-11-26",
    "url": "http://arxiv.org/abs/2511.21050v1",
    "pdf_url": "https://arxiv.org/pdf/2511.21050v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.21050v1_Breaking_the_Safety-Capability_Tradeoff_Reinforcement_Learning_with_Verifiable_Rewards_Maintains_Saf.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.12120v1",
    "title": "Deep Reinforcement Learning for Automated Stock Trading: An Ensemble Strategy",
    "authors": [
      "Hongyang Yang",
      "Xiao-Yang Liu",
      "Shan Zhong",
      "Anwar Walid"
    ],
    "summary": "Stock trading strategies play a critical role in investment. However, it is challenging to design a profitable strategy in a complex and dynamic stock market. In this paper, we propose an ensemble strategy that employs deep reinforcement schemes to learn a stock trading strategy by maximizing investment return. We train a deep reinforcement learning agent and obtain an ensemble trading strategy using three actor-critic based algorithms: Proximal Policy Optimization (PPO), Advantage Actor Critic ",
    "published": "2025-11-15",
    "url": "http://arxiv.org/abs/2511.12120v1",
    "pdf_url": "https://arxiv.org/pdf/2511.12120v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.12120v1_Deep_Reinforcement_Learning_for_Automated_Stock_Trading_An_Ensemble_Strategy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.01737v1",
    "title": "Edge AI in Highly Volatile Environments: Is Fairness Worth the Accuracy Trade-off?",
    "authors": [
      "Obaidullah Zaland",
      "Feras M. Awaysheh",
      "Sawsan Al Zubi",
      "Abdul Rahman Safi",
      "Monowar Bhuyan"
    ],
    "summary": "Federated learning (FL) has emerged as a transformative paradigm for edge intelligence, enabling collaborative model training while preserving data privacy across distributed personal devices. However, the inherent volatility of edge environments, characterized by dynamic resource availability and heterogeneous client capabilities, poses significant challenges for achieving high accuracy and fairness in client participation. This paper investigates the fundamental trade-off between model accurac",
    "published": "2025-11-03",
    "url": "http://arxiv.org/abs/2511.01737v1",
    "pdf_url": "https://arxiv.org/pdf/2511.01737v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.01737v1_Edge_AI_in_Highly_Volatile_Environments_Is_Fairness_Worth_the_Accuracy_Trade-off.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.01923v1",
    "title": "When Assurance Undermines Intelligence: The Efficiency Costs of Data Governance in AI-Enabled Labor Markets",
    "authors": [
      "Lei Chen",
      "Chaoyue Gao",
      "Alvin Leung",
      "Xiaoning Wang"
    ],
    "summary": "Generative artificial intelligence (GenAI) like Large Language Model (LLM) is increasingly integrated into digital platforms to enhance information access, deliver personalized experiences, and improve matching efficiency. However, these algorithmic advancements rely heavily on large-scale user data, creating a fundamental tension between information assurance-the protection, integrity, and responsible use of privacy data-and artificial intelligence-the learning capacity and predictive accuracy ",
    "published": "2025-11-02",
    "url": "http://arxiv.org/abs/2511.01923v1",
    "pdf_url": "https://arxiv.org/pdf/2511.01923v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.01923v1_When_Assurance_Undermines_Intelligence_The_Efficiency_Costs_of_Data_Governance_in_AI-Enabled_Labor_M.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.26722v3",
    "title": "Non-Convex Over-the-Air Heterogeneous Federated Learning: A Bias-Variance Trade-off",
    "authors": [
      "Muhammad Faraz Ul Abrar",
      "Nicolò Michelusi"
    ],
    "summary": "Over-the-air (OTA) federated learning (FL) has been well recognized as a scalable paradigm that exploits the waveform superposition of the wireless multiple-access channel to aggregate model updates in a single use. Existing OTA-FL designs largely enforce zero-bias model updates by either assuming \\emph{homogeneous} wireless conditions (equal path loss across devices) or forcing zero-bias updates to guarantee convergence. Under \\emph{heterogeneous} wireless scenarios, however, such designs are c",
    "published": "2025-10-30",
    "url": "http://arxiv.org/abs/2510.26722v3",
    "pdf_url": "https://arxiv.org/pdf/2510.26722v3",
    "pdf_path": "pdfs_articles\\arxiv\\2510.26722v3_Non-Convex_Over-the-Air_Heterogeneous_Federated_Learning_A_Bias-Variance_Trade-off.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.25929v1",
    "title": "Multi-Agent Reinforcement Learning for Market Making: Competition without Collusion",
    "authors": [
      "Ziyi Wang",
      "Carmine Ventre",
      "Maria Polukarov"
    ],
    "summary": "Algorithmic collusion has emerged as a central question in AI: Will the interaction between different AI agents deployed in markets lead to collusion? More generally, understanding how emergent behavior, be it a cartel or market dominance from more advanced bots, affects the market overall is an important research question.\n  We propose a hierarchical multi-agent reinforcement learning framework to study algorithmic collusion in market making. The framework includes a self-interested market make",
    "published": "2025-10-29",
    "url": "http://arxiv.org/abs/2510.25929v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25929v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.25929v1_Multi-Agent_Reinforcement_Learning_for_Market_Making_Competition_without_Collusion.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.25602v1",
    "title": "INT v.s. FP: A Comprehensive Study of Fine-Grained Low-bit Quantization Formats",
    "authors": [
      "Mengzhao Chen",
      "Meng Wu",
      "Hui Jin",
      "Zhihang Yuan",
      "Jing Liu",
      "Chaoyi Zhang",
      "Yunshui Li",
      "Jie Huang",
      "Jin Ma",
      "Zeyue Xue",
      "Zhiheng Liu",
      "Xingyan Bin",
      "Ping Luo"
    ],
    "summary": "Modern AI hardware, such as Nvidia's Blackwell architecture, is increasingly embracing low-precision floating-point (FP) formats to handle the pervasive activation outliers in Large Language Models (LLMs). Despite this industry trend, a unified comparison of FP and integer (INT) quantization across varying granularities has been missing, leaving algorithm and hardware co-design without clear guidance. This paper fills that gap by systematically investigating the trade-offs between FP and INT for",
    "published": "2025-10-29",
    "url": "http://arxiv.org/abs/2510.25602v1",
    "pdf_url": "https://arxiv.org/pdf/2510.25602v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.25602v1_INT_vs_FP_A_Comprehensive_Study_of_Fine-Grained_Low-bit_Quantization_Formats.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.20621v2",
    "title": "Towards the Formalization of a Trustworthy AI for Mining Interpretable Models explOiting Sophisticated Algorithms",
    "authors": [
      "Riccardo Guidotti",
      "Martina Cinquini",
      "Marta Marchiori Manerba",
      "Mattia Setzu",
      "Francesco Spinnato"
    ],
    "summary": "Interpretable-by-design models are crucial for fostering trust, accountability, and safe adoption of automated decision-making models in real-world applications. In this paper we formalize the ground for the MIMOSA (Mining Interpretable Models explOiting Sophisticated Algorithms) framework, a comprehensive methodology for generating predictive models that balance interpretability with performance while embedding key ethical properties. We formally define here the supervised learning setting acro",
    "published": "2025-10-23",
    "url": "http://arxiv.org/abs/2510.20621v2",
    "pdf_url": "https://arxiv.org/pdf/2510.20621v2",
    "pdf_path": "pdfs_articles\\arxiv\\2510.20621v2_Towards_the_Formalization_of_a_Trustworthy_AI_for_Mining_Interpretable_Models_explOiting_Sophisticat.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.16857v2",
    "title": "DrivAerStar: An Industrial-Grade CFD Dataset for Vehicle Aerodynamic Optimization",
    "authors": [
      "Jiyan Qiu",
      "Lyulin Kuang",
      "Guan Wang",
      "Yichen Xu",
      "Leiyao Cui",
      "Shaotong Fu",
      "Yixin Zhu",
      "Ruihua Zhang"
    ],
    "summary": "Vehicle aerodynamics optimization has become critical for automotive electrification, where drag reduction directly determines electric vehicle range and energy efficiency. Traditional approaches face an intractable trade-off: computationally expensive Computational Fluid Dynamics (CFD) simulations requiring weeks per design iteration, or simplified models that sacrifice production-grade accuracy. While machine learning offers transformative potential, existing datasets exhibit fundamental limit",
    "published": "2025-10-19",
    "url": "http://arxiv.org/abs/2510.16857v2",
    "pdf_url": "https://arxiv.org/pdf/2510.16857v2",
    "pdf_path": "pdfs_articles\\arxiv\\2510.16857v2_DrivAerStar_An_Industrial-Grade_CFD_Dataset_for_Vehicle_Aerodynamic_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.15995v1",
    "title": "The Invisible Handshake: Tacit Collusion between Adaptive Market Agents",
    "authors": [
      "Luigi Foscari",
      "Emanuele Guidotti",
      "Nicolò Cesa-Bianchi",
      "Tatjana Chavdarova",
      "Alfio Ferrara"
    ],
    "summary": "We study the emergence of tacit collusion between adaptive trading agents in a stochastic market with endogenous price formation. Using a two-player repeated game between a market maker and a market taker, we characterize feasible and collusive strategy profiles that raise prices beyond competitive levels. We show that, when agents follow simple learning algorithms (e.g., gradient ascent) to maximize their own wealth, the resulting dynamics converge to collusive strategy profiles, even in highly",
    "published": "2025-10-14",
    "url": "http://arxiv.org/abs/2510.15995v1",
    "pdf_url": "https://arxiv.org/pdf/2510.15995v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.15995v1_The_Invisible_Handshake_Tacit_Collusion_between_Adaptive_Market_Agents.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.05475v1",
    "title": "From Classical Rationality to Contextual Reasoning: Quantum Logic as a New Frontier for Human-Centric AI in Finance",
    "authors": [
      "Fabio Bagarello",
      "Francesco Gargano",
      "Polina Khrennikova"
    ],
    "summary": "We consider state of the art applications of artificial intelligence (AI) in modelling human financial expectations and explore the potential of quantum logic to drive future advancements in this field. This analysis highlights the application of machine learning techniques, including reinforcement learning and deep neural networks, in financial statement analysis, algorithmic trading, portfolio management, and robo-advisory services. We further discuss the emergence and progress of quantum mach",
    "published": "2025-10-07",
    "url": "http://arxiv.org/abs/2510.05475v1",
    "pdf_url": "https://arxiv.org/pdf/2510.05475v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.05475v1_From_Classical_Rationality_to_Contextual_Reasoning_Quantum_Logic_as_a_New_Frontier_for_Human-Centric.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.04952v2",
    "title": "Safe and Compliant Cross-Market Trade Execution via Constrained RL and Zero-Knowledge Audits",
    "authors": [
      "Ailiya Borjigin",
      "Cong He"
    ],
    "summary": "We present a cross-market algorithmic trading system that balances execution quality with rigorous compliance enforcement. The architecture comprises a high-level planner, a reinforcement learning execution agent, and an independent compliance agent. We formulate trade execution as a constrained Markov decision process with hard constraints on participation limits, price bands, and self-trading avoidance. The execution agent is trained with proximal policy optimization, while a runtime action-sh",
    "published": "2025-10-06",
    "url": "http://arxiv.org/abs/2510.04952v2",
    "pdf_url": "https://arxiv.org/pdf/2510.04952v2",
    "pdf_path": "pdfs_articles\\arxiv\\2510.04952v2_Safe_and_Compliant_Cross-Market_Trade_Execution_via_Constrained_RL_and_Zero-Knowledge_Audits.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.01451v1",
    "title": "Financial Stability Implications of Generative AI: Taming the Animal Spirits",
    "authors": [
      "Anne Lundgaard Hansen",
      "Seung Jung Lee"
    ],
    "summary": "This paper investigates the impact of the adoption of generative AI on financial stability. We conduct laboratory-style experiments using large language models to replicate classic studies on herd behavior in trading decisions. Our results show that AI agents make more rational decisions than humans, relying predominantly on private information over market trends. Increased reliance on AI-powered trading advice could therefore potentially lead to fewer asset price bubbles arising from animal spi",
    "published": "2025-10-01",
    "url": "http://arxiv.org/abs/2510.01451v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01451v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.01451v1_Financial_Stability_Implications_of_Generative_AI_Taming_the_Animal_Spirits.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.26150v1",
    "title": "Bubble, Bubble, AI's Rumble: Why Global Financial Regulatory Incident Reporting is Our Shield Against Systemic Stumbles",
    "authors": [
      "Anchal Gupta",
      "Gleb Pappyshev",
      "James T Kwok"
    ],
    "summary": "\"Double, double toil and trouble; Fire burn and cauldron bubble.\" As Shakespeare's witches foretold chaos through cryptic prophecies, modern capital markets grapple with systemic risks concealed by opaque AI systems. According to IMF, the August 5, 2024, plunge in Japanese and U.S. equities can be linked to algorithmic trading yet ab-sent from existing AI incidents database exemplifies this transparency crisis. Current AI incident databases, reliant on crowdsourcing or news scraping, systematica",
    "published": "2025-09-30",
    "url": "http://arxiv.org/abs/2509.26150v1",
    "pdf_url": "https://arxiv.org/pdf/2509.26150v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.26150v1_Bubble_Bubble_AIs_Rumble_Why_Global_Financial_Regulatory_Incident_Reporting_is_Our_Shield_Against_Sy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.00078v1",
    "title": "Adaptive and Resource-efficient Agentic AI Systems for Mobile and Embedded Devices: A Survey",
    "authors": [
      "Sicong Liu",
      "Weiye Wu",
      "Xiangrui Xu",
      "Teng Li",
      "Bowen Pang",
      "Bin Guo",
      "Zhiwen Yu"
    ],
    "summary": "Foundation models have reshaped AI by unifying fragmented architectures into scalable backbones with multimodal reasoning and contextual adaptation. In parallel, the long-standing notion of AI agents, defined by the sensing-decision-action loop, is entering a new paradigm: with FMs as their cognitive core, agents transcend rule-based behaviors to achieve autonomy, generalization, and self-reflection. This dual shift is reinforced by real-world demands such as autonomous driving, robotics, virtua",
    "published": "2025-09-30",
    "url": "http://arxiv.org/abs/2510.00078v1",
    "pdf_url": "https://arxiv.org/pdf/2510.00078v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.00078v1_Adaptive_and_Resource-efficient_Agentic_AI_Systems_for_Mobile_and_Embedded_Devices_A_Survey.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.19128v2",
    "title": "PipelineRL: Faster On-policy Reinforcement Learning for Long Sequence Generation",
    "authors": [
      "Alexandre Piché",
      "Ehsan Kamalloo",
      "Rafael Pardinas",
      "Xiaoyin Chen",
      "Dzmitry Bahdanau"
    ],
    "summary": "Reinforcement Learning (RL) is increasingly utilized to enhance the reasoning capabilities of Large Language Models (LLMs). However, effectively scaling these RL methods presents significant challenges, primarily due to the difficulty in maintaining high AI accelerator utilization without generating stale, off-policy data that harms common RL algorithms. This paper introduces PipelineRL, an approach designed to achieve a superior trade-off between hardware efficiency and data on-policyness for L",
    "published": "2025-09-23",
    "url": "http://arxiv.org/abs/2509.19128v2",
    "pdf_url": "https://arxiv.org/pdf/2509.19128v2",
    "pdf_path": "pdfs_articles\\arxiv\\2509.19128v2_PipelineRL_Faster_On-policy_Reinforcement_Learning_for_Long_Sequence_Generation.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.12053v1",
    "title": "LEGO: Spatial Accelerator Generation and Optimization for Tensor Applications",
    "authors": [
      "Yujun Lin",
      "Zhekai Zhang",
      "Song Han"
    ],
    "summary": "Modern tensor applications, especially foundation models and generative AI applications require multiple input modalities (both vision and language), which increases the demand for flexible accelerator architecture. Existing frameworks suffer from the trade-off between design flexibility and productivity of RTL generation: either limited to very few hand-written templates or cannot automatically generate the RTL. To address this challenge, we propose the LEGO framework, which targets tensor appl",
    "published": "2025-09-15",
    "url": "http://arxiv.org/abs/2509.12053v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12053v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.12053v1_LEGO_Spatial_Accelerator_Generation_and_Optimization_for_Tensor_Applications.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.04541v1",
    "title": "Finance-Grounded Optimization For Algorithmic Trading",
    "authors": [
      "Kasymkhan Khubiev",
      "Mikhail Semenov",
      "Irina Podlipnova"
    ],
    "summary": "Deep Learning is evolving fast and integrates into various domains. Finance is a challenging field for deep learning, especially in the case of interpretable artificial intelligence (AI). Although classical approaches perform very well with natural language processing, computer vision, and forecasting, they are not perfect for the financial world, in which specialists use different metrics to evaluate model performance.\n  We first introduce financially grounded loss functions derived from key qu",
    "published": "2025-09-04",
    "url": "http://arxiv.org/abs/2509.04541v1",
    "pdf_url": "https://arxiv.org/pdf/2509.04541v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.04541v1_Finance-Grounded_Optimization_For_Algorithmic_Trading.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.18526v2",
    "title": "Quantifying The Limits of AI Reasoning: Systematic Neural Network Representations of Algorithms",
    "authors": [
      "Anastasis Kratsios",
      "Dennis Zvigelsky",
      "Bradd Hart"
    ],
    "summary": "A main open question in contemporary AI research is quantifying the forms of reasoning neural networks can perform when perfectly trained. This paper answers this by interpreting reasoning tasks as circuit emulation, where the gates define the type of reasoning; e.g. Boolean gates for predicate logic, tropical circuits for dynamic programming, arithmetic and analytic gates for symbolic mathematical representation, and hybrids thereof for deeper reasoning; e.g. higher-order logic.\n  We present a ",
    "published": "2025-08-25",
    "url": "http://arxiv.org/abs/2508.18526v2",
    "pdf_url": "https://arxiv.org/pdf/2508.18526v2",
    "pdf_path": "pdfs_articles\\arxiv\\2508.18526v2_Quantifying_The_Limits_of_AI_Reasoning_Systematic_Neural_Network_Representations_of_Algorithms.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.13213v1",
    "title": "AI sustains higher strategic tension than humans in chess",
    "authors": [
      "Adamo Cerioli",
      "Edward D. Lee",
      "Vito D. P. Servedio"
    ],
    "summary": "Strategic decision-making involves managing the tension between immediate opportunities and long-term objectives. We study this trade-off in chess by characterizing and comparing dynamics between human vs human and AI vs AI games. We propose a network-based metric of piece-to-piece interaction to quantify the ongoing strategic tension on the board. Its evolution in games reveals that the most competitive AI players sustain higher levels of strategic tension for longer durations than elite human ",
    "published": "2025-08-16",
    "url": "http://arxiv.org/abs/2508.13213v1",
    "pdf_url": "https://arxiv.org/pdf/2508.13213v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.13213v1_AI_sustains_higher_strategic_tension_than_humans_in_chess.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.10173v1",
    "title": "Benchmark-Driven Selection of AI: Evidence from DeepSeek-R1",
    "authors": [
      "Petr Spelda",
      "Vit Stritecky"
    ],
    "summary": "Evaluation of reasoning language models gained importance after it was observed that they can combine their existing capabilities into novel traces of intermediate steps before task completion and that the traces can sometimes help them to generalize better than past models. As reasoning becomes the next scaling dimension of large language models, careful study of their capabilities in critical tasks is needed. We show that better performance is not always caused by test-time algorithmic improve",
    "published": "2025-08-13",
    "url": "http://arxiv.org/abs/2508.10173v1",
    "pdf_url": "https://arxiv.org/pdf/2508.10173v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.10173v1_Benchmark-Driven_Selection_of_AI_Evidence_from_DeepSeek-R1.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.02292v2",
    "title": "FinWorld: An All-in-One Open-Source Platform for End-to-End Financial AI Research and Deployment",
    "authors": [
      "Wentao Zhang",
      "Yilei Zhao",
      "Chuqiao Zong",
      "Xinrun Wang",
      "Bo An"
    ],
    "summary": "Financial AI holds great promise for transforming modern finance, with the potential to support a wide range of tasks such as market forecasting, portfolio management, quantitative trading, and automated analysis. However, existing platforms remain limited in task coverage, lack robust multimodal data integration, and offer insufficient support for the training and deployment of large language models (LLMs). In response to these limitations, we present FinWorld, an all-in-one open-source platfor",
    "published": "2025-08-04",
    "url": "http://arxiv.org/abs/2508.02292v2",
    "pdf_url": "https://arxiv.org/pdf/2508.02292v2",
    "pdf_path": "pdfs_articles\\arxiv\\2508.02292v2_FinWorld_An_All-in-One_Open-Source_Platform_for_End-to-End_Financial_AI_Research_and_Deployment.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.18417v1",
    "title": "FinDPO: Financial Sentiment Analysis for Algorithmic Trading through Preference Optimization of LLMs",
    "authors": [
      "Giorgos Iacovides",
      "Wuyang Zhou",
      "Danilo Mandic"
    ],
    "summary": "Opinions expressed in online finance-related textual data are having an increasingly profound impact on trading decisions and market movements. This trend highlights the vital role of sentiment analysis as a tool for quantifying the nature and strength of such opinions. With the rapid development of Generative AI (GenAI), supervised fine-tuned (SFT) large language models (LLMs) have become the de facto standard for financial sentiment analysis. However, the SFT paradigm can lead to memorization ",
    "published": "2025-07-24",
    "url": "http://arxiv.org/abs/2507.18417v1",
    "pdf_url": "https://arxiv.org/pdf/2507.18417v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.18417v1_FinDPO_Financial_Sentiment_Analysis_for_Algorithmic_Trading_through_Preference_Optimization_of_LLMs.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.11506v2",
    "title": "ELK: Exploring the Efficiency of Inter-core Connected AI Chips with Deep Learning Compiler Techniques",
    "authors": [
      "Yiqi Liu",
      "Yuqi Xue",
      "Noelle Crawford",
      "Jilong Xue",
      "Jian Huang"
    ],
    "summary": "To meet the increasing demand of deep learning (DL) models, AI chips are employing both off-chip memory (e.g., HBM) and high-bandwidth low-latency interconnect for direct inter-core data exchange. However, it is not easy to explore the efficiency of these inter-core connected AI (ICCA) chips, due to a fundamental tussle among compute (per-core execution), communication (inter-core data exchange), and I/O (off-chip data access).\n  In this paper, we develop Elk, a DL compiler framework to maximize",
    "published": "2025-07-15",
    "url": "http://arxiv.org/abs/2507.11506v2",
    "pdf_url": "https://arxiv.org/pdf/2507.11506v2",
    "pdf_path": "pdfs_articles\\arxiv\\2507.11506v2_ELK_Exploring_the_Efficiency_of_Inter-core_Connected_AI_Chips_with_Deep_Learning_Compiler_Techniques.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.19383v1",
    "title": "Explainable Artificial Intelligence Credit Risk Assessment using Machine Learning",
    "authors": [
      " Shreya",
      "Harsh Pathak"
    ],
    "summary": "This paper presents an intelligent and transparent AI-driven system for Credit Risk Assessment using three state-of-the-art ensemble machine learning models combined with Explainable AI (XAI) techniques. The system leverages XGBoost, LightGBM, and Random Forest algorithms for predictive analysis of loan default risks, addressing the challenges of model interpretability using SHAP and LIME. Preprocessing steps include custom imputation, one-hot encoding, and standardization. Class imbalance is ma",
    "published": "2025-06-24",
    "url": "http://arxiv.org/abs/2506.19383v1",
    "pdf_url": "https://arxiv.org/pdf/2506.19383v1",
    "pdf_path": "pdfs_articles\\arxiv\\2506.19383v1_Explainable_Artificial_Intelligence_Credit_Risk_Assessment_using_Machine_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.08164v2",
    "title": "BLUR: A Bi-Level Optimization Approach for LLM Unlearning",
    "authors": [
      "Hadi Reisizadeh",
      "Jinghan Jia",
      "Zhiqi Bu",
      "Bhanukiran Vinzamuri",
      "Anil Ramakrishna",
      "Kai-Wei Chang",
      "Volkan Cevher",
      "Sijia Liu",
      "Mingyi Hong"
    ],
    "summary": "Enabling large language models (LLMs) to unlearn knowledge and capabilities acquired during training has proven vital for ensuring compliance with data regulations and promoting ethical practices in generative AI. Although there are growing interests in developing various unlearning algorithms, it remains unclear how to best formulate the unlearning problem. The most popular formulation uses a weighted sum of forget and retain loss, but it often leads to performance degradation due to the inhere",
    "published": "2025-06-09",
    "url": "http://arxiv.org/abs/2506.08164v2",
    "pdf_url": "https://arxiv.org/pdf/2506.08164v2",
    "pdf_path": "pdfs_articles\\arxiv\\2506.08164v2_BLUR_A_Bi-Level_Optimization_Approach_for_LLM_Unlearning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.24612v1",
    "title": "Multi-criteria Rank-based Aggregation for Explainable AI",
    "authors": [
      "Sujoy Chatterjee",
      "Everton Romanzini Colombo",
      "Marcos Medeiros Raimundo"
    ],
    "summary": "Explainability is crucial for improving the transparency of black-box machine learning models. With the advancement of explanation methods such as LIME and SHAP, various XAI performance metrics have been developed to evaluate the quality of explanations. However, different explainers can provide contrasting explanations for the same prediction, introducing trade-offs across conflicting quality metrics. Although available aggregation approaches improve robustness, reducing explanations' variabili",
    "published": "2025-05-30",
    "url": "http://arxiv.org/abs/2505.24612v1",
    "pdf_url": "https://arxiv.org/pdf/2505.24612v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.24612v1_Multi-criteria_Rank-based_Aggregation_for_Explainable_AI.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2504.17006v1",
    "title": "A Systematic Approach to Design Real-World Human-in-the-Loop Deep Reinforcement Learning: Salient Features, Challenges and Trade-offs",
    "authors": [
      "Jalal Arabneydi",
      "Saiful Islam",
      "Srijita Das",
      "Sai Krishna Gottipati",
      "William Duguay",
      "Cloderic Mars",
      "Matthew E. Taylor",
      "Matthew Guzdial",
      "Antoine Fagette",
      "Younes Zerouali"
    ],
    "summary": "With the growing popularity of deep reinforcement learning (DRL), human-in-the-loop (HITL) approach has the potential to revolutionize the way we approach decision-making problems and create new opportunities for human-AI collaboration. In this article, we introduce a novel multi-layered hierarchical HITL DRL algorithm that comprises three types of learning: self learning, imitation learning and transfer learning. In addition, we consider three forms of human inputs: reward, action and demonstra",
    "published": "2025-04-23",
    "url": "http://arxiv.org/abs/2504.17006v1",
    "pdf_url": "https://arxiv.org/pdf/2504.17006v1",
    "pdf_path": "pdfs_articles\\arxiv\\2504.17006v1_A_Systematic_Approach_to_Design_Real-World_Human-in-the-Loop_Deep_Reinforcement_Learning_Salient_Fea.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2503.18826v2",
    "title": "Interpretable and Fair Mechanisms for Abstaining Classifiers",
    "authors": [
      "Daphne Lenders",
      "Andrea Pugnana",
      "Roberto Pellungrini",
      "Toon Calders",
      "Dino Pedreschi",
      "Fosca Giannotti"
    ],
    "summary": "Abstaining classifiers have the option to refrain from providing a prediction for instances that are difficult to classify. The abstention mechanism is designed to trade off the classifier's performance on the accepted data while ensuring a minimum number of predictions. In this setting, often fairness concerns arise when the abstention mechanism solely reduces errors for the majority groups of the data, resulting in increased performance differences across demographic groups. While there exist ",
    "published": "2025-03-24",
    "url": "http://arxiv.org/abs/2503.18826v2",
    "pdf_url": "https://arxiv.org/pdf/2503.18826v2",
    "pdf_path": "pdfs_articles\\arxiv\\2503.18826v2_Interpretable_and_Fair_Mechanisms_for_Abstaining_Classifiers.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2503.14541v1",
    "title": "Regulating Ai In Financial Services: Legal Frameworks And Compliance Challenges",
    "authors": [
      "Shahmar Mirishli"
    ],
    "summary": "This article examines the evolving landscape of artificial intelligence (AI) regulation in financial services, detailing the legal frameworks and compliance challenges posed by rapid technological adoption. By reviewing current legislation, industry guidelines, and real-world use cases, it highlights how AI-driven processes, from fraud detection to algorithmic trading, offer efficiency gains yet introduce significant risks, including algorithmic bias, data privacy breaches, and lack of transpare",
    "published": "2025-03-17",
    "url": "http://arxiv.org/abs/2503.14541v1",
    "pdf_url": "https://arxiv.org/pdf/2503.14541v1",
    "pdf_path": "pdfs_articles\\arxiv\\2503.14541v1_Regulating_Ai_In_Financial_Services_Legal_Frameworks_And_Compliance_Challenges.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2503.03612v4",
    "title": "Large language models in finance : what is financial sentiment?",
    "authors": [
      "Kemal Kirtac",
      "Guido Germano"
    ],
    "summary": "Financial sentiment has become a crucial yet complex concept in finance, increasingly used in market forecasting and investment strategies. Despite its growing importance, there remains a need to define and understand what financial sentiment truly represents and how it can be effectively measured. We explore the nature of financial sentiment and investigate how large language models (LLMs) contribute to its estimation. We trace the evolution of sentiment measurement in finance, from market-base",
    "published": "2025-03-05",
    "url": "http://arxiv.org/abs/2503.03612v4",
    "pdf_url": "https://arxiv.org/pdf/2503.03612v4",
    "pdf_path": "pdfs_articles\\arxiv\\2503.03612v4_Large_language_models_in_finance_what_is_financial_sentiment.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2503.05728v2",
    "title": "Political Neutrality in AI Is Impossible- But Here Is How to Approximate It",
    "authors": [
      "Jillian Fisher",
      "Ruth E. Appel",
      "Chan Young Park",
      "Yujin Potter",
      "Liwei Jiang",
      "Taylor Sorensen",
      "Shangbin Feng",
      "Yulia Tsvetkov",
      "Margaret E. Roberts",
      "Jennifer Pan",
      "Dawn Song",
      "Yejin Choi"
    ],
    "summary": "AI systems often exhibit political bias, influencing users' opinions and decisions. While political neutrality-defined as the absence of bias-is often seen as an ideal solution for fairness and safety, this position paper argues that true political neutrality is neither feasible nor universally desirable due to its subjective nature and the biases inherent in AI training data, algorithms, and user interactions. However, inspired by Joseph Raz's philosophical insight that \"neutrality [...] can be",
    "published": "2025-02-18",
    "url": "http://arxiv.org/abs/2503.05728v2",
    "pdf_url": "https://arxiv.org/pdf/2503.05728v2",
    "pdf_path": "pdfs_articles\\arxiv\\2503.05728v2_Political_Neutrality_in_AI_Is_Impossible-_But_Here_Is_How_to_Approximate_It.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.09724v2",
    "title": "Navigating the Social Welfare Frontier: Portfolios for Multi-objective Reinforcement Learning",
    "authors": [
      "Cheol Woo Kim",
      "Jai Moondra",
      "Shresth Verma",
      "Madeleine Pollack",
      "Lingkai Kong",
      "Milind Tambe",
      "Swati Gupta"
    ],
    "summary": "In many real-world applications of reinforcement learning (RL), deployed policies have varied impacts on different stakeholders, creating challenges in reaching consensus on how to effectively aggregate their preferences. Generalized $p$-means form a widely used class of social welfare functions for this purpose, with broad applications in fair resource allocation, AI alignment, and decision-making. This class includes well-known welfare functions such as Egalitarian, Nash, and Utilitarian welfa",
    "published": "2025-02-13",
    "url": "http://arxiv.org/abs/2502.09724v2",
    "pdf_url": "https://arxiv.org/pdf/2502.09724v2",
    "pdf_path": "pdfs_articles\\arxiv\\2502.09724v2_Navigating_the_Social_Welfare_Frontier_Portfolios_for_Multi-objective_Reinforcement_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.08542v3",
    "title": "Beyond Predictions: A Participatory Framework for Multi-Stakeholder Decision-Making",
    "authors": [
      "Vittoria Vineis",
      "Giuseppe Perelli",
      "Gabriele Tolomei"
    ],
    "summary": "Conventional automated decision-support systems often prioritize predictive accuracy, overlooking the complexities of real-world settings where stakeholders' preferences may diverge or conflict. This can lead to outcomes that disadvantage vulnerable groups and erode trust in algorithmic processes. Participatory AI approaches aim to address these issues but remain largely context-specific, limiting their broader applicability and scalability. To address these gaps, we propose a participatory fram",
    "published": "2025-02-12",
    "url": "http://arxiv.org/abs/2502.08542v3",
    "pdf_url": "https://arxiv.org/pdf/2502.08542v3",
    "pdf_path": "pdfs_articles\\arxiv\\2502.08542v3_Beyond_Predictions_A_Participatory_Framework_for_Multi-Stakeholder_Decision-Making.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.07214v1",
    "title": "Pareto Optimal Algorithmic Recourse in Multi-cost Function",
    "authors": [
      "Wen-Ling Chen",
      "Hong-Chang Huang",
      "Kai-Hung Lin",
      "Shang-Wei Hwang",
      "Hao-Tsung Yang"
    ],
    "summary": "In decision-making systems, algorithmic recourse aims to identify minimal-cost actions to alter an individual features, thereby obtaining a desired outcome. This empowers individuals to understand, question, or alter decisions that negatively affect them. However, due to the variety and sensitivity of system environments and individual personalities, quantifying the cost of a single function is nearly impossible while considering multiple criteria situations. Most current recourse mechanisms use",
    "published": "2025-02-11",
    "url": "http://arxiv.org/abs/2502.07214v1",
    "pdf_url": "https://arxiv.org/pdf/2502.07214v1",
    "pdf_path": "pdfs_articles\\arxiv\\2502.07214v1_Pareto_Optimal_Algorithmic_Recourse_in_Multi-cost_Function.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.06775v2",
    "title": "Enhancing Performance of Explainable AI Models with Constrained Concept Refinement",
    "authors": [
      "Geyu Liang",
      "Senne Michielssen",
      "Salar Fattahi"
    ],
    "summary": "The trade-off between accuracy and interpretability has long been a challenge in machine learning (ML). This tension is particularly significant for emerging interpretable-by-design methods, which aim to redesign ML algorithms for trustworthy interpretability but often sacrifice accuracy in the process. In this paper, we address this gap by investigating the impact of deviations in concept representations-an essential component of interpretable models-on prediction performance and propose a nove",
    "published": "2025-02-10",
    "url": "http://arxiv.org/abs/2502.06775v2",
    "pdf_url": "https://arxiv.org/pdf/2502.06775v2",
    "pdf_path": "pdfs_articles\\arxiv\\2502.06775v2_Enhancing_Performance_of_Explainable_AI_Models_with_Constrained_Concept_Refinement.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2412.20377v1",
    "title": "Impact of Data Distribution on Fairness Guarantees in Equitable Deep Learning",
    "authors": [
      "Yan Luo",
      "Congcong Wen",
      "Min Shi",
      "Hao Huang",
      "Yi Fang",
      "Mengyu Wang"
    ],
    "summary": "We present a comprehensive theoretical framework analyzing the relationship between data distributions and fairness guarantees in equitable deep learning. Our work establishes novel theoretical bounds that explicitly account for data distribution heterogeneity across demographic groups, while introducing a formal analysis framework that minimizes expected loss differences across these groups. We derive comprehensive theoretical bounds for fairness errors and convergence rates, and characterize h",
    "published": "2024-12-29",
    "url": "http://arxiv.org/abs/2412.20377v1",
    "pdf_url": "https://arxiv.org/pdf/2412.20377v1",
    "pdf_path": "pdfs_articles\\arxiv\\2412.20377v1_Impact_of_Data_Distribution_on_Fairness_Guarantees_in_Equitable_Deep_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2412.16641v5",
    "title": "A Systems Thinking Approach to Algorithmic Fairness",
    "authors": [
      "Chris Lam"
    ],
    "summary": "Systems thinking provides us with a way to model the algorithmic fairness problem by allowing us to encode prior knowledge and assumptions about where we believe bias might exist in the data generating process. We can then encode these beliefs as a series of causal graphs, enabling us to link AI/ML systems to politics and the law. This allows us to combine techniques from machine learning, causal inference, and system dynamics in order to capture different emergent aspects of the fairness proble",
    "published": "2024-12-21",
    "url": "http://arxiv.org/abs/2412.16641v5",
    "pdf_url": "https://arxiv.org/pdf/2412.16641v5",
    "pdf_path": "pdfs_articles\\arxiv\\2412.16641v5_A_Systems_Thinking_Approach_to_Algorithmic_Fairness.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2411.17900v1",
    "title": "Pretrained LLM Adapted with LoRA as a Decision Transformer for Offline RL in Quantitative Trading",
    "authors": [
      "Suyeol Yun"
    ],
    "summary": "Developing effective quantitative trading strategies using reinforcement learning (RL) is challenging due to the high risks associated with online interaction with live financial markets. Consequently, offline RL, which leverages historical market data without additional exploration, becomes essential. However, existing offline RL methods often struggle to capture the complex temporal dependencies inherent in financial time series and may overfit to historical patterns. To address these challeng",
    "published": "2024-11-26",
    "url": "http://arxiv.org/abs/2411.17900v1",
    "pdf_url": "https://arxiv.org/pdf/2411.17900v1",
    "pdf_path": "pdfs_articles\\arxiv\\2411.17900v1_Pretrained_LLM_Adapted_with_LoRA_as_a_Decision_Transformer_for_Offline_RL_in_Quantitative_Trading.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2410.20229v1",
    "title": "Modelling of Economic Implications of Bias in AI-Powered Health Emergency Response Systems",
    "authors": [
      "Katsiaryna Bahamazava"
    ],
    "summary": "We present a theoretical framework assessing the economic implications of bias in AI-powered emergency response systems. Integrating health economics, welfare economics, and artificial intelligence, we analyze how algorithmic bias affects resource allocation, health outcomes, and social welfare. By incorporating a bias function into health production and social welfare models, we quantify its impact on demographic groups, showing that bias leads to suboptimal resource distribution, increased cos",
    "published": "2024-10-26",
    "url": "http://arxiv.org/abs/2410.20229v1",
    "pdf_url": "https://arxiv.org/pdf/2410.20229v1",
    "pdf_path": "pdfs_articles\\arxiv\\2410.20229v1_Modelling_of_Economic_Implications_of_Bias_in_AI-Powered_Health_Emergency_Response_Systems.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2410.14807v1",
    "title": "Aligning AI Agents via Information-Directed Sampling",
    "authors": [
      "Hong Jun Jeon",
      "Benjamin Van Roy"
    ],
    "summary": "The staggering feats of AI systems have brought to attention the topic of AI Alignment: aligning a \"superintelligent\" AI agent's actions with humanity's interests. Many existing frameworks/algorithms in alignment study the problem on a myopic horizon or study learning from human feedback in isolation, relying on the contrived assumption that the agent has already perfectly identified the environment. As a starting point to address these limitations, we define a class of bandit alignment problems",
    "published": "2024-10-18",
    "url": "http://arxiv.org/abs/2410.14807v1",
    "pdf_url": "https://arxiv.org/pdf/2410.14807v1",
    "pdf_path": "pdfs_articles\\arxiv\\2410.14807v1_Aligning_AI_Agents_via_Information-Directed_Sampling.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2410.04772v1",
    "title": "From Transparency to Accountability and Back: A Discussion of Access and Evidence in AI Auditing",
    "authors": [
      "Sarah H. Cen",
      "Rohan Alur"
    ],
    "summary": "Artificial intelligence (AI) is increasingly intervening in our lives, raising widespread concern about its unintended and undeclared side effects. These developments have brought attention to the problem of AI auditing: the systematic evaluation and analysis of an AI system, its development, and its behavior relative to a set of predetermined criteria. Auditing can take many forms, including pre-deployment risk assessments, ongoing monitoring, and compliance testing. It plays a critical role in",
    "published": "2024-10-07",
    "url": "http://arxiv.org/abs/2410.04772v1",
    "pdf_url": "https://arxiv.org/pdf/2410.04772v1",
    "pdf_path": "pdfs_articles\\arxiv\\2410.04772v1_From_Transparency_to_Accountability_and_Back_A_Discussion_of_Access_and_Evidence_in_AI_Auditing.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2409.18664v1",
    "title": "How green is continual learning, really? Analyzing the energy consumption in continual training of vision foundation models",
    "authors": [
      "Tomaso Trinci",
      "Simone Magistri",
      "Roberto Verdecchia",
      "Andrew D. Bagdanov"
    ],
    "summary": "With the ever-growing adoption of AI, its impact on the environment is no longer negligible. Despite the potential that continual learning could have towards Green AI, its environmental sustainability remains relatively uncharted. In this work we aim to gain a systematic understanding of the energy efficiency of continual learning algorithms. To that end, we conducted an extensive set of empirical experiments comparing the energy consumption of recent representation-, prompt-, and exemplar-based",
    "published": "2024-09-27",
    "url": "http://arxiv.org/abs/2409.18664v1",
    "pdf_url": "https://arxiv.org/pdf/2409.18664v1",
    "pdf_path": "pdfs_articles\\arxiv\\2409.18664v1_How_green_is_continual_learning_really_Analyzing_the_energy_consumption_in_continual_training_of_vis.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2409.17201v2",
    "title": "Immersion and Invariance-based Coding for Privacy-Preserving Federated Learning",
    "authors": [
      "Haleh Hayati",
      "Carlos Murguia",
      "Nathan van de Wouw"
    ],
    "summary": "Federated learning (FL) has emerged as a method to preserve privacy in collaborative distributed learning. In FL, clients train AI models directly on their devices rather than sharing data with a centralized server, which can pose privacy risks. However, it has been shown that despite FL's partial protection of local data privacy, information about clients' data can still be inferred from shared model updates during training. In recent years, several privacy-preserving approaches have been devel",
    "published": "2024-09-25",
    "url": "http://arxiv.org/abs/2409.17201v2",
    "pdf_url": "https://arxiv.org/pdf/2409.17201v2",
    "pdf_path": "pdfs_articles\\arxiv\\2409.17201v2_Immersion_and_Invariance-based_Coding_for_Privacy-Preserving_Federated_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2409.14747v5",
    "title": "Distribution-Level Feature Distancing for Machine Unlearning: Towards a Better Trade-off Between Model Utility and Forgetting",
    "authors": [
      "Dasol Choi",
      "Dongbin Na"
    ],
    "summary": "With the explosive growth of deep learning applications and increasing privacy concerns, the right to be forgotten has become a critical requirement in various AI industries. For example, given a facial recognition system, some individuals may wish to remove their personal data that might have been used in the training phase. Unfortunately, deep neural networks sometimes unexpectedly leak personal identities, making this removal challenging. While recent machine unlearning algorithms aim to enab",
    "published": "2024-09-23",
    "url": "http://arxiv.org/abs/2409.14747v5",
    "pdf_url": "https://arxiv.org/pdf/2409.14747v5",
    "pdf_path": "pdfs_articles\\arxiv\\2409.14747v5_Distribution-Level_Feature_Distancing_for_Machine_Unlearning_Towards_a_Better_Trade-off_Between_Mode.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.21804v1",
    "title": "S&P 500 Stock's Movement Prediction using CNN",
    "authors": [
      "Rahul Gupta"
    ],
    "summary": "This paper is about predicting the movement of stock consist of S&P 500 index. Historically there are many approaches have been tried using various methods to predict the stock movement and being used in the market currently for algorithm trading and alpha generating systems using traditional mathematical approaches [1, 2].\n  The success of artificial neural network recently created a lot of interest and paved the way to enable prediction using cutting-edge research in the machine learning and d",
    "published": "2025-12-25",
    "url": "http://arxiv.org/abs/2512.21804v1",
    "pdf_url": "https://arxiv.org/pdf/2512.21804v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.21804v1_SP_500_Stocks_Movement_Prediction_using_CNN.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.20216v1",
    "title": "Quantitative Financial Modeling for Sri Lankan Markets: Approach Combining NLP, Clustering and Time-Series Forecasting",
    "authors": [
      "Linuk Perera"
    ],
    "summary": "This research introduces a novel quantitative methodology tailored for quantitative finance applications, enabling banks, stockbrokers, and investors to predict economic regimes and market signals in emerging markets, specifically Sri Lankan stock indices (S&P SL20 and ASPI) by integrating Environmental, Social, and Governance (ESG) sentiment analysis with macroeconomic indicators and advanced time-series forecasting. Designed to leverage quantitative techniques for enhanced risk assessment, por",
    "published": "2025-12-23",
    "url": "http://arxiv.org/abs/2512.20216v1",
    "pdf_url": "https://arxiv.org/pdf/2512.20216v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.20216v1_Quantitative_Financial_Modeling_for_Sri_Lankan_Markets_Approach_Combining_NLP_Clustering_and_Time-Se.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.17936v1",
    "title": "Risk-Aware Financial Forecasting Enhanced by Machine Learning and Intuitionistic Fuzzy Multi-Criteria Decision-Making",
    "authors": [
      "Safiye Turgay",
      "Serkan Erdoğan",
      "Željko Stević",
      "Orhan Emre Elma",
      "Tevfik Eren",
      "Zhiyuan Wang",
      "Mahmut Baydaş"
    ],
    "summary": "In the face of increasing financial uncertainty and market complexity, this study presents a novel risk-aware financial forecasting framework that integrates advanced machine learning techniques with intuitionistic fuzzy multi-criteria decision-making (MCDM). Tailored to the BIST 100 index and validated through a case study of a major defense company in Türkiye, the framework fuses structured financial data, unstructured text data, and macroeconomic indicators to enhance predictive accuracy and ",
    "published": "2025-12-11",
    "url": "http://arxiv.org/abs/2512.17936v1",
    "pdf_url": "https://arxiv.org/pdf/2512.17936v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.17936v1_Risk-Aware_Financial_Forecasting_Enhanced_by_Machine_Learning_and_Intuitionistic_Fuzzy_Multi-Criteri.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08805v1",
    "title": "Identifying counterfactual probabilities using bivariate distributions and uplift modeling",
    "authors": [
      "Théo Verhelst",
      "Gianluca Bontempi"
    ],
    "summary": "Uplift modeling estimates the causal effect of an intervention as the difference between potential outcomes under treatment and control, whereas counterfactual identification aims to recover the joint distribution of these potential outcomes (e.g., \"Would this customer still have churned had we given them a marketing offer?\"). This joint counterfactual distribution provides richer information than the uplift but is harder to estimate. However, the two approaches are synergistic: uplift models ca",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08805v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08805v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08805v1_Identifying_counterfactual_probabilities_using_bivariate_distributions_and_uplift_modeling.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08567v1",
    "title": "A Hybrid Model for Stock Market Forecasting: Integrating News Sentiment and Time Series Data with Graph Neural Networks",
    "authors": [
      "Nader Sadek",
      "Mirette Moawad",
      "Christina Naguib",
      "Mariam Elzahaby"
    ],
    "summary": "Stock market prediction is a long-standing challenge in finance, as accurate forecasts support informed investment decisions. Traditional models rely mainly on historical prices, but recent work shows that financial news can provide useful external signals. This paper investigates a multimodal approach that integrates companies' news articles with their historical stock data to improve prediction performance. We compare a Graph Neural Network (GNN) model with a baseline LSTM model. Historical da",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08567v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08567v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08567v1_A_Hybrid_Model_for_Stock_Market_Forecasting_Integrating_News_Sentiment_and_Time_Series_Data_with_Gra.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08124v1",
    "title": "Long-only cryptocurrency portfolio management by ranking the assets: a neural network approach",
    "authors": [
      "Zijiang Yang"
    ],
    "summary": "This paper will propose a novel machine learning based portfolio management method in the context of the cryptocurrency market. Previous researchers mainly focus on the prediction of the movement for specific cryptocurrency such as the bitcoin(BTC) and then trade according to the prediction. In contrast to the previous work that treats the cryptocurrencies independently, this paper manages a group of cryptocurrencies by analyzing the relative relationship. Specifically, in each time step, we uti",
    "published": "2025-12-09",
    "url": "http://arxiv.org/abs/2512.08124v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08124v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08124v1_Long-only_cryptocurrency_portfolio_management_by_ranking_the_assets_a_neural_network_approach.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.06648v2",
    "title": "Financial Fraud Identification and Interpretability Study for Listed Companies Based on Convolutional Neural Network",
    "authors": [
      "Xiao Li"
    ],
    "summary": "Since the emergence of joint-stock companies, financial fraud by listed firms has repeatedly undermined capital markets. Fraud is difficult to detect because of covert tactics and the high labor and time costs of audits. Traditional statistical models are interpretable but struggle with nonlinear feature interactions, while machine learning models are powerful but often opaque. In addition, most existing methods judge fraud only for the current year based on current year data, limiting timelines",
    "published": "2025-12-07",
    "url": "http://arxiv.org/abs/2512.06648v2",
    "pdf_url": "https://arxiv.org/pdf/2512.06648v2",
    "pdf_path": "pdfs_articles\\arxiv\\2512.06648v2_Financial_Fraud_Identification_and_Interpretability_Study_for_Listed_Companies_Based_on_Convolutiona.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.06630v1",
    "title": "Quantum Temporal Convolutional Neural Networks for Cross-Sectional Equity Return Prediction: A Comparative Benchmark Study",
    "authors": [
      "Chi-Sheng Chen",
      "Xinyu Zhang",
      "Rong Fu",
      "Qiuzhe Xie",
      "Fan Zhang"
    ],
    "summary": "Quantum machine learning offers a promising pathway for enhancing stock market prediction, particularly under complex, noisy, and highly dynamic financial environments. However, many classical forecasting models struggle with noisy input, regime shifts, and limited generalization capacity. To address these challenges, we propose a Quantum Temporal Convolutional Neural Network (QTCNN) that combines a classical temporal encoder with parameter-efficient quantum convolution circuits for cross-sectio",
    "published": "2025-12-07",
    "url": "http://arxiv.org/abs/2512.06630v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06630v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.06630v1_Quantum_Temporal_Convolutional_Neural_Networks_for_Cross-Sectional_Equity_Return_Prediction_A_Compar.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.05734v1",
    "title": "KANFormer for Predicting Fill Probabilities via Survival Analysis in Limit Order Books",
    "authors": [
      "Jinfeng Zhong",
      "Emmanuel Bacry",
      "Agathe Guilloux",
      "Jean-François Muzy"
    ],
    "summary": "This paper introduces KANFormer, a novel deep-learning-based model for predicting the time-to-fill of limit orders by leveraging both market- and agent-level information. KANFormer combines a Dilated Causal Convolutional network with a Transformer encoder, enhanced by Kolmogorov-Arnold Networks (KANs), which improve nonlinear approximation. Unlike existing models that rely solely on a series of snapshots of the limit order book, KANFormer integrates the actions of agents related to LOB dynamics ",
    "published": "2025-12-05",
    "url": "http://arxiv.org/abs/2512.05734v1",
    "pdf_url": "https://arxiv.org/pdf/2512.05734v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.05734v1_KANFormer_for_Predicting_Fill_Probabilities_via_Survival_Analysis_in_Limit_Order_Books.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.02092v1",
    "title": "Opening the Black Box: Nowcasting Singapore's GDP Growth and its Explainability",
    "authors": [
      "Luca Attolico"
    ],
    "summary": "Timely assessment of current conditions is essential especially for small, open economies such as Singapore, where external shocks transmit rapidly to domestic activity. We develop a real-time nowcasting framework for quarterly GDP growth using a high-dimensional panel of approximately 70 indicators, encompassing economic and financial indicators over 1990Q1-2023Q2. The analysis covers penalized regressions, dimensionality-reduction methods, ensemble learning algorithms, and neural architectures",
    "published": "2025-12-01",
    "url": "http://arxiv.org/abs/2512.02092v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02092v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.02092v1_Opening_the_Black_Box_Nowcasting_Singapores_GDP_Growth_and_its_Explainability.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.22314v1",
    "title": "DeXposure: A Dataset and Benchmarks for Inter-protocol Credit Exposure in Decentralized Financial Networks",
    "authors": [
      "Wenbin Wu",
      "Kejiang Qian",
      "Alexis Lui",
      "Christopher Jack",
      "Yue Wu",
      "Peter McBurney",
      "Fengxiang He",
      "Bryan Zhang"
    ],
    "summary": "We curate the DeXposure dataset, the first large-scale dataset for inter-protocol credit exposure in decentralized financial networks, covering global markets of 43.7 million entries across 4.3 thousand protocols, 602 blockchains, and 24.3 thousand tokens, from 2020 to 2025. A new measure, value-linked credit exposure between protocols, is defined as the inferred financial dependency relationships derived from changes in Total Value Locked (TVL). We develop a token-to-protocol model using DefiLl",
    "published": "2025-11-27",
    "url": "http://arxiv.org/abs/2511.22314v1",
    "pdf_url": "https://arxiv.org/pdf/2511.22314v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.22314v1_DeXposure_A_Dataset_and_Benchmarks_for_Inter-protocol_Credit_Exposure_in_Decentralized_Financial_Net.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.17892v1",
    "title": "Arbitrage-Free Bond and Yield Curve Forecasting with Neural Filters under HJM Constraints",
    "authors": [
      "Xiang Gao",
      "Cody Hyndman"
    ],
    "summary": "We develop an arbitrage-free deep learning framework for yield curve and bond price forecasting based on the Heath-Jarrow-Morton (HJM) term-structure model and a dynamic Nelson-Siegel parameterization of forward rates. Our approach embeds a no-arbitrage drift restriction into a neural state-space architecture by combining Kalman, extended Kalman, and particle filters with recurrent neural networks (LSTM/CLSTM), and introduces an explicit arbitrage error regularization (AER) term during training.",
    "published": "2025-11-22",
    "url": "http://arxiv.org/abs/2511.17892v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17892v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.17892v1_Arbitrage-Free_Bond_and_Yield_Curve_Forecasting_with_Neural_Filters_under_HJM_Constraints.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.15960v1",
    "title": "Machine Learning vs. Randomness: Challenges in Predicting Binary Options Movements",
    "authors": [
      "Gabriel M. Arantes",
      "Richard F. Pinto",
      "Bruno L. Dalmazo",
      "Eduardo N. Borges",
      "Giancarlo Lucca",
      "Viviane L. D. de Mattos",
      "Fabian C. Cardoso",
      "Rafael A. Berri"
    ],
    "summary": "Binary options trading is often marketed as a field where predictive models can generate consistent profits. However, the inherent randomness and stochastic nature of binary options make price movements highly unpredictable, posing significant challenges for any forecasting approach. This study demonstrates that machine learning algorithms struggle to outperform a simple baseline in predicting binary options movements. Using a dataset of EUR/USD currency pairs from 2021 to 2023, we tested multip",
    "published": "2025-11-20",
    "url": "http://arxiv.org/abs/2511.15960v1",
    "pdf_url": "https://arxiv.org/pdf/2511.15960v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.15960v1_Machine_Learning_vs_Randomness_Challenges_in_Predicting_Binary_Options_Movements.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.09962v1",
    "title": "AI-Integrated Decision Support System for Real-Time Market Growth Forecasting and Multi-Source Content Diffusion Analytics",
    "authors": [
      "Ziqing Yin",
      "Xuanjing Chen",
      "Xi Zhang"
    ],
    "summary": "The rapid proliferation of AI-generated content (AIGC) has reshaped the dynamics of digital marketing and online consumer behavior. However, predicting the diffusion trajectory and market impact of such content remains challenging due to data heterogeneity, non linear propagation mechanisms, and evolving consumer interactions. This study proposes an AI driven Decision Support System (DSS) that integrates multi source data including social media streams, marketing expenditure records, consumer en",
    "published": "2025-11-13",
    "url": "http://arxiv.org/abs/2511.09962v1",
    "pdf_url": "https://arxiv.org/pdf/2511.09962v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.09962v1_AI-Integrated_Decision_Support_System_for_Real-Time_Market_Growth_Forecasting_and_Multi-Source_Conte.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.11701v1",
    "title": "Bayesian Neural Networks with Monte Carlo Dropout for Probabilistic Electricity Price Forecasting",
    "authors": [
      "Abhinav Das",
      "Stephan Schlüter"
    ],
    "summary": "Accurate electricity price forecasting is critical for strategic decision-making in deregulated electricity markets, where volatility stems from complex supply-demand dynamics and external factors. Traditional point forecasts often fail to capture inherent uncertainties, limiting their utility for risk management. This work presents a framework for probabilistic electricity price forecasting using Bayesian neural networks (BNNs) with Monte Carlo (MC) dropout, training separate models for each ho",
    "published": "2025-11-12",
    "url": "http://arxiv.org/abs/2511.11701v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11701v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.11701v1_Bayesian_Neural_Networks_with_Monte_Carlo_Dropout_for_Probabilistic_Electricity_Price_Forecasting.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.08658v1",
    "title": "\"It Looks All the Same to Me\": Cross-index Training for Long-term Financial Series Prediction",
    "authors": [
      "Stanislav Selitskiy"
    ],
    "summary": "We investigate a number of Artificial Neural Network architectures (well-known and more ``exotic'') in application to the long-term financial time-series forecasts of indexes on different global markets. The particular area of interest of this research is to examine the correlation of these indexes' behaviour in terms of Machine Learning algorithms cross-training. Would training an algorithm on an index from one global market produce similar or even better accuracy when such a model is applied f",
    "published": "2025-11-11",
    "url": "http://arxiv.org/abs/2511.08658v1",
    "pdf_url": "https://arxiv.org/pdf/2511.08658v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.08658v1_It_Looks_All_the_Same_to_Me_Cross-index_Training_for_Long-term_Financial_Series_Prediction.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.06273v1",
    "title": "COTN: A Chaotic Oscillatory Transformer Network for Complex Volatile Systems under Extreme Conditions",
    "authors": [
      "Boyan Tang",
      "Yilong Zeng",
      "Xuanhao Ren",
      "Peng Xiao",
      "Yuhan Zhao",
      "Raymond Lee",
      "Jianghua Wu"
    ],
    "summary": "Accurate prediction of financial and electricity markets, especially under extreme conditions, remains a significant challenge due to their intrinsic nonlinearity, rapid fluctuations, and chaotic patterns. To address these limitations, we propose the Chaotic Oscillatory Transformer Network (COTN). COTN innovatively combines a Transformer architecture with a novel Lee Oscillator activation function, processed through Max-over-Time pooling and a lambda-gating mechanism. This design is specifically",
    "published": "2025-11-09",
    "url": "http://arxiv.org/abs/2511.06273v1",
    "pdf_url": "https://arxiv.org/pdf/2511.06273v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.06273v1_COTN_A_Chaotic_Oscillatory_Transformer_Network_for_Complex_Volatile_Systems_under_Extreme_Conditions.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.05569v1",
    "title": "Data-driven jet fuel demand forecasting: A case study of Copenhagen Airport",
    "authors": [
      "Alessandro Contini",
      "Davide Cacciarelli",
      "Murat Kulahci"
    ],
    "summary": "Accurate forecasting of jet fuel demand is crucial for optimizing supply chain operations in the aviation market. Fuel distributors specifically require precise estimates to avoid inventory shortages or excesses. However, there is a lack of studies that analyze the jet fuel demand forecasting problem using machine learning models. Instead, many industry practitioners rely on deterministic or expertise-based models. In this research, we evaluate the performance of data-driven approaches using a s",
    "published": "2025-11-04",
    "url": "http://arxiv.org/abs/2511.05569v1",
    "pdf_url": "https://arxiv.org/pdf/2511.05569v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.05569v1_Data-driven_jet_fuel_demand_forecasting_A_case_study_of_Copenhagen_Airport.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.01570v1",
    "title": "Gated Fusion Enhanced Multi-Scale Hierarchical Graph Convolutional Network for Stock Movement Prediction",
    "authors": [
      "Xiaosha Xue",
      "Peibo Duan",
      "Zhipeng Liu",
      "Qi Chu",
      "Changsheng Zhang",
      "Bin zhang"
    ],
    "summary": "Accurately predicting stock market movements remains a formidable challenge due to the inherent volatility and complex interdependencies among stocks. Although multi-scale Graph Neural Networks (GNNs) hold potential for modeling these relationships, they frequently neglect two key points: the subtle intra-attribute patterns within each stock affecting inter-stock correlation, and the biased attention to coarse- and fine-grained features during multi-scale sampling. To overcome these challenges, ",
    "published": "2025-11-03",
    "url": "http://arxiv.org/abs/2511.01570v1",
    "pdf_url": "https://arxiv.org/pdf/2511.01570v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.01570v1_Gated_Fusion_Enhanced_Multi-Scale_Hierarchical_Graph_Convolutional_Network_for_Stock_Movement_Predic.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.22348v1",
    "title": "Causal and Predictive Modeling of Short-Horizon Market Risk and Systematic Alpha Generation Using Hybrid Machine Learning Ensembles",
    "authors": [
      "Aryan Ranjan"
    ],
    "summary": "We present a systematic trading framework that forecasts short-horizon market risk, identifies its underlying drivers, and generates alpha using a hybrid machine learning ensemble built to trade on the resulting signal. The framework integrates neural networks with tree-based voting models to predict five-day drawdowns in the S&P 500 ETF, leveraging a cross-asset feature set spanning equities, fixed income, foreign exchange, commodities, and volatility markets. Interpretable feature attribution ",
    "published": "2025-10-25",
    "url": "http://arxiv.org/abs/2510.22348v1",
    "pdf_url": "https://arxiv.org/pdf/2510.22348v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.22348v1_Causal_and_Predictive_Modeling_of_Short-Horizon_Market_Risk_and_Systematic_Alpha_Generation_Using_Hy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.10775v1",
    "title": "Structure Over Signal: A Globalized Approach to Multi-relational GNNs for Stock Prediction",
    "authors": [
      "Amber Li",
      "Aruzhan Abil",
      "Juno Marques Oda"
    ],
    "summary": "In financial markets, Graph Neural Networks have been successfully applied to modeling relational data, effectively capturing nonlinear inter-stock dependencies. Yet, existing models often fail to efficiently propagate messages during macroeconomic shocks. In this paper, we propose OmniGNN, an attention-based multi-relational dynamic GNN that integrates macroeconomic context via heterogeneous node and edge types for robust message passing. Central to OmniGNN is a sector node acting as a global i",
    "published": "2025-10-12",
    "url": "http://arxiv.org/abs/2510.10775v1",
    "pdf_url": "https://arxiv.org/pdf/2510.10775v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.10775v1_Structure_Over_Signal_A_Globalized_Approach_to_Multi-relational_GNNs_for_Stock_Prediction.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.07661v2",
    "title": "IKNet: Interpretable Stock Price Prediction via Keyword-Guided Integration of News and Technical Indicators",
    "authors": [
      "Jinwoong Kim",
      "Sangjin Park"
    ],
    "summary": "The increasing influence of unstructured external information, such as news articles, on stock prices has attracted growing attention in financial markets. Despite recent advances, most existing newsbased forecasting models represent all articles using sentiment scores or average embeddings that capture the general tone but fail to provide quantitative, context-aware explanations of the impacts of public sentiment on predictions. To address this limitation, we propose an interpretable keyword-gu",
    "published": "2025-10-09",
    "url": "http://arxiv.org/abs/2510.07661v2",
    "pdf_url": "https://arxiv.org/pdf/2510.07661v2",
    "pdf_path": "pdfs_articles\\arxiv\\2510.07661v2_IKNet_Interpretable_Stock_Price_Prediction_via_Keyword-Guided_Integration_of_News_and_Technical_Indi.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.01446v1",
    "title": "Can Machine Learning Algorithms Outperform Traditional Models for Option Pricing?",
    "authors": [
      "Georgy Milyushkov"
    ],
    "summary": "This study investigates the application of machine learning techniques, specifically Neural Networks, Random Forests, and CatBoost for option pricing, in comparison to traditional models such as Black-Scholes and Heston Model. Using both synthetically generated data and real market option data, each model is evaluated in predicting the option price. The results show that machine learning models can capture complex, non-linear relationships in option prices and, in several cases, outperform both ",
    "published": "2025-10-01",
    "url": "http://arxiv.org/abs/2510.01446v1",
    "pdf_url": "https://arxiv.org/pdf/2510.01446v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.01446v1_Can_Machine_Learning_Algorithms_Outperform_Traditional_Models_for_Option_Pricing.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.21567v2",
    "title": "EEG-Based Consumer Behaviour Prediction: An Exploration from Classical Machine Learning to Graph Neural Networks",
    "authors": [
      "Mohammad Parsa Afshar",
      "Aryan Azimi"
    ],
    "summary": "Prediction of consumer behavior is one of the important purposes in marketing, cognitive neuroscience, and human-computer interaction. The electroencephalography (EEG) data can help analyze the decision process by providing detailed information about the brain's neural activity. In this research, a comparative approach is utilized for predicting consumer behavior by EEG data. In the first step, the features of the EEG data from the NeuMa dataset were extracted and cleaned. For the Graph Neural N",
    "published": "2025-09-25",
    "url": "http://arxiv.org/abs/2509.21567v2",
    "pdf_url": "https://arxiv.org/pdf/2509.21567v2",
    "pdf_path": "pdfs_articles\\arxiv\\2509.21567v2_EEG-Based_Consumer_Behaviour_Prediction_An_Exploration_from_Classical_Machine_Learning_to_Graph_Neur.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.19417v3",
    "title": "Analyzing Uncertainty Quantification in Statistical and Deep Learning Models for Probabilistic Electricity Price Forecasting",
    "authors": [
      "Andreas Lebedev",
      "Abhinav Das",
      "Sven Pappert",
      "Stephan Schlüter"
    ],
    "summary": "Precise probabilistic forecasts are fundamental for energy risk management, and there is a wide range of both statistical and machine learning models for this purpose. Inherent to these probabilistic models is some form of uncertainty quantification. However, most models do not capture the full extent of uncertainty, which arises not only from the data itself but also from model and distributional choices. In this study, we examine uncertainty quantification in state-of-the-art statistical and d",
    "published": "2025-09-23",
    "url": "http://arxiv.org/abs/2509.19417v3",
    "pdf_url": "https://arxiv.org/pdf/2509.19417v3",
    "pdf_path": "pdfs_articles\\arxiv\\2509.19417v3_Analyzing_Uncertainty_Quantification_in_Statistical_and_Deep_Learning_Models_for_Probabilistic_Elect.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.06697v1",
    "title": "Neural ARFIMA model for forecasting BRIC exchange rates with long memory under oil shocks and policy uncertainties",
    "authors": [
      "Tanujit Chakraborty",
      "Donia Besher",
      "Madhurima Panja",
      "Shovon Sengupta"
    ],
    "summary": "Accurate forecasting of exchange rates remains a persistent challenge, particularly for emerging economies such as Brazil, Russia, India, and China (BRIC). These series exhibit long memory, nonlinearity, and non-stationarity properties that conventional time series models struggle to capture. Additionally, there exist several key drivers of exchange rate dynamics, including global economic policy uncertainty, US equity market volatility, US monetary policy uncertainty, oil price growth rates, an",
    "published": "2025-09-08",
    "url": "http://arxiv.org/abs/2509.06697v1",
    "pdf_url": "https://arxiv.org/pdf/2509.06697v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.06697v1_Neural_ARFIMA_model_for_forecasting_BRIC_exchange_rates_with_long_memory_under_oil_shocks_and_policy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.05911v1",
    "title": "Deep Learning Option Pricing with Market Implied Volatility Surfaces",
    "authors": [
      "Lijie Ding",
      "Egang Lu",
      "Kin Cheung"
    ],
    "summary": "We present a deep learning framework for pricing options based on market-implied volatility surfaces. Using end-of-day S\\&P 500 index options quotes from 2018-2023, we construct arbitrage-free volatility surfaces and generate training data for American puts and arithmetic Asian options using QuantLib. To address the high dimensionality of volatility surfaces, we employ a variational autoencoder (VAE) that compresses volatility surfaces across maturities and strikes into a 10-dimensional latent r",
    "published": "2025-09-07",
    "url": "http://arxiv.org/abs/2509.05911v1",
    "pdf_url": "https://arxiv.org/pdf/2509.05911v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.05911v1_Deep_Learning_Option_Pricing_with_Market_Implied_Volatility_Surfaces.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.11372v1",
    "title": "Stealing Accuracy: Predicting Day-ahead Electricity Prices with Temporal Hierarchy Forecasting (THieF)",
    "authors": [
      "Arkadiusz Lipiecki",
      "Kaja Bilinska",
      "Nicolaos Kourentzes",
      "Rafal Weron"
    ],
    "summary": "We introduce the concept of temporal hierarchy forecasting (THieF) in predicting day-ahead electricity prices and show that reconciling forecasts for hourly products, 2- to 12-hour blocks, and baseload contracts significantly (up to 13%) improves accuracy at all levels. These results remain consistent throughout a challenging 4-year test period (2021-2024) in the German power market and across model architectures, including linear regression, a shallow neural network, gradient boosting, and a st",
    "published": "2025-08-15",
    "url": "http://arxiv.org/abs/2508.11372v1",
    "pdf_url": "https://arxiv.org/pdf/2508.11372v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.11372v1_Stealing_Accuracy_Predicting_Day-ahead_Electricity_Prices_with_Temporal_Hierarchy_Forecasting_THieF.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.20108v2",
    "title": "Mitigating Distribution Shift in Stock Price Data via Return-Volatility Normalization for Accurate Prediction",
    "authors": [
      "Hyunwoo Lee",
      "Jihyeong Jeon",
      "Jaemin Hong",
      "U Kang"
    ],
    "summary": "How can we address distribution shifts in stock price data to improve stock price prediction accuracy? Stock price prediction has attracted attention from both academia and industry, driven by its potential to uncover complex market patterns and enhance decisionmaking. However, existing methods often fail to handle distribution shifts effectively, focusing on scaling or representation adaptation without fully addressing distributional discrepancies and shape misalignments between training and te",
    "published": "2025-08-13",
    "url": "http://arxiv.org/abs/2508.20108v2",
    "pdf_url": "https://arxiv.org/pdf/2508.20108v2",
    "pdf_path": "pdfs_articles\\arxiv\\2508.20108v2_Mitigating_Distribution_Shift_in_Stock_Price_Data_via_Return-Volatility_Normalization_for_Accurate_P.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.05416v1",
    "title": "Echo State Networks for Bitcoin Time Series Prediction",
    "authors": [
      "Mansi Sharma",
      "Enrico Sartor",
      "Marc Cavazza",
      "Helmut Prendinger"
    ],
    "summary": "Forecasting stock and cryptocurrency prices is challenging due to high volatility and non-stationarity, influenced by factors like economic changes and market sentiment. Previous research shows that Echo State Networks (ESNs) can effectively model short-term stock market movements, capturing nonlinear patterns in dynamic data. To the best of our knowledge, this work is among the first to explore ESNs for cryptocurrency forecasting, especially during extreme volatility. We also conduct chaos anal",
    "published": "2025-08-07",
    "url": "http://arxiv.org/abs/2508.05416v1",
    "pdf_url": "https://arxiv.org/pdf/2508.05416v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.05416v1_Echo_State_Networks_for_Bitcoin_Time_Series_Prediction.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.02356v1",
    "title": "Neural Network-Based Algorithmic Trading Systems: Multi-Timeframe Analysis and High-Frequency Execution in Cryptocurrency Markets",
    "authors": [
      "Wěi Zhāng"
    ],
    "summary": "This paper explores neural network-based approaches for algorithmic trading in cryptocurrency markets. Our approach combines multi-timeframe trend analysis with high-frequency direction prediction networks, achieving positive risk-adjusted returns through statistical modeling and systematic market exploitation. The system integrates diverse data sources including market data, on-chain metrics, and orderbook dynamics, translating these into unified buy/sell pressure signals. We demonstrate how ma",
    "published": "2025-08-04",
    "url": "http://arxiv.org/abs/2508.02356v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02356v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.02356v1_Neural_Network-Based_Algorithmic_Trading_Systems_Multi-Timeframe_Analysis_and_High-Frequency_Executi.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.01419v1",
    "title": "Cryptocurrency Price Forecasting Using Machine Learning: Building Intelligent Financial Prediction Models",
    "authors": [
      "Md Zahidul Islam",
      "Md Shafiqur Rahman",
      "Md Sumsuzoha",
      "Babul Sarker",
      "Md Rafiqul Islam",
      "Mahfuz Alam",
      "Sanjib Kumar Shil"
    ],
    "summary": "Cryptocurrency markets are experiencing rapid growth, but this expansion comes with significant challenges, particularly in predicting cryptocurrency prices for traders in the U.S. In this study, we explore how deep learning and machine learning models can be used to forecast the closing prices of the XRP/USDT trading pair. While many existing cryptocurrency prediction models focus solely on price and volume patterns, they often overlook market liquidity, a crucial factor in price predictability",
    "published": "2025-08-02",
    "url": "http://arxiv.org/abs/2508.01419v1",
    "pdf_url": "https://arxiv.org/pdf/2508.01419v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.01419v1_Cryptocurrency_Price_Forecasting_Using_Machine_Learning_Building_Intelligent_Financial_Prediction_Mo.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.00040v1",
    "title": "Regime-Aware Conditional Neural Processes with Multi-Criteria Decision Support for Operational Electricity Price Forecasting",
    "authors": [
      "Abhinav Das",
      "Stephan Schlüter"
    ],
    "summary": "This work integrates Bayesian regime detection with conditional neural processes for 24-hour electricity price prediction in the German market. Our methodology integrates regime detection using a disentangled sticky hierarchical Dirichlet process hidden Markov model (DS-HDP-HMM) applied to daily electricity prices. Each identified regime is subsequently modeled by an independent conditional neural process (CNP), trained to learn localized mappings from input contexts to 24-dimensional hourly pri",
    "published": "2025-07-31",
    "url": "http://arxiv.org/abs/2508.00040v1",
    "pdf_url": "https://arxiv.org/pdf/2508.00040v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.00040v1_Regime-Aware_Conditional_Neural_Processes_with_Multi-Criteria_Decision_Support_for_Operational_Elect.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.21710v1",
    "title": "PREIG: Physics-informed and Reinforcement-driven Interpretable GRU for Commodity Demand Forecasting",
    "authors": [
      "Hongwei Ma",
      "Junbin Gao",
      "Minh-Ngoc Tran"
    ],
    "summary": "Accurately forecasting commodity demand remains a critical challenge due to volatile market dynamics, nonlinear dependencies, and the need for economically consistent predictions. This paper introduces PREIG, a novel deep learning framework tailored for commodity demand forecasting. The model uniquely integrates a Gated Recurrent Unit (GRU) architecture with physics-informed neural network (PINN) principles by embedding a domain-specific economic constraint: the negative elasticity between price",
    "published": "2025-07-29",
    "url": "http://arxiv.org/abs/2507.21710v1",
    "pdf_url": "https://arxiv.org/pdf/2507.21710v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.21710v1_PREIG_Physics-informed_and_Reinforcement-driven_Interpretable_GRU_for_Commodity_Demand_Forecasting.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.02686v1",
    "title": "Adaptive Market Intelligence: A Mixture of Experts Framework for Volatility-Sensitive Stock Forecasting",
    "authors": [
      "Diego Vallarino"
    ],
    "summary": "This study develops and empirically validates a Mixture of Experts (MoE) framework for stock price prediction across heterogeneous volatility regimes using real market data. The proposed model combines a Recurrent Neural Network (RNN) optimized for high-volatility stocks with a linear regression model tailored to stable equities. A volatility-aware gating mechanism dynamically weights the contributions of each expert based on asset classification. Using a dataset of 30 publicly traded U.S. stock",
    "published": "2025-07-22",
    "url": "http://arxiv.org/abs/2508.02686v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02686v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.02686v1_Adaptive_Market_Intelligence_A_Mixture_of_Experts_Framework_for_Volatility-Sensitive_Stock_Forecasti.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.02685v1",
    "title": "Benchmarking Classical and Quantum Models for DeFi Yield Prediction on Curve Finance",
    "authors": [
      "Chi-Sheng Chen",
      "Aidan Hung-Wen Tsai"
    ],
    "summary": "The rise of decentralized finance (DeFi) has created a growing demand for accurate yield and performance forecasting to guide liquidity allocation strategies. In this study, we benchmark six models, XGBoost, Random Forest, LSTM, Transformer, quantum neural networks (QNN), and quantum support vector machines with quantum feature maps (QSVM-QNN), on one year of historical data from 28 Curve Finance pools. We evaluate model performance on test MAE, RMSE, and directional accuracy. Our results show t",
    "published": "2025-07-22",
    "url": "http://arxiv.org/abs/2508.02685v1",
    "pdf_url": "https://arxiv.org/pdf/2508.02685v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.02685v1_Benchmarking_Classical_and_Quantum_Models_for_DeFi_Yield_Prediction_on_Curve_Finance.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.12787v1",
    "title": "Multi-Channel Graph Neural Network for Financial Risk Prediction of NEEQ Enterprises",
    "authors": [
      "Jianyu Zhu"
    ],
    "summary": "With the continuous evolution of China's multi-level capital market, the National Equities Exchange and Quotations (NEEQ), also known as the \"New Third Board,\" has become a critical financing platform for small and medium-sized enterprises (SMEs). However, due to their limited scale and financial resilience, many NEEQ-listed companies face elevated risks of financial distress. To address this issue, we propose a multi-channel deep learning framework that integrates structured financial indicator",
    "published": "2025-07-17",
    "url": "http://arxiv.org/abs/2507.12787v1",
    "pdf_url": "https://arxiv.org/pdf/2507.12787v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.12787v1_Multi-Channel_Graph_Neural_Network_for_Financial_Risk_Prediction_of_NEEQ_Enterprises.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.12369v2",
    "title": "Catching Bid-rigging Cartels with Graph Attention Neural Networks",
    "authors": [
      "David Imhof",
      "Emanuel W Viklund",
      "Martin Huber"
    ],
    "summary": "We propose a novel application of graph attention networks (GATs), a type of graph neural network enhanced with attention mechanisms, to develop a deep learning algorithm for detecting collusive behavior, leveraging predictive features suggested in prior research. We test our approach on a large dataset covering 13 markets across seven countries. Our results show that predictive models based on GATs, trained on a subset of the markets, can be effectively transferred to other markets, achieving a",
    "published": "2025-07-16",
    "url": "http://arxiv.org/abs/2507.12369v2",
    "pdf_url": "https://arxiv.org/pdf/2507.12369v2",
    "pdf_path": "pdfs_articles\\arxiv\\2507.12369v2_Catching_Bid-rigging_Cartels_with_Graph_Attention_Neural_Networks.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.10701v1",
    "title": "Kernel Learning for Mean-Variance Trading Strategies",
    "authors": [
      "Owen Futter",
      "Nicola Muca Cirone",
      "Blanka Horvath"
    ],
    "summary": "In this article, we develop a kernel-based framework for constructing dynamic, pathdependent trading strategies under a mean-variance optimisation criterion. Building on the theoretical results of (Muca Cirone and Salvi, 2025), we parameterise trading strategies as functions in a reproducing kernel Hilbert space (RKHS), enabling a flexible and non-Markovian approach to optimal portfolio problems. We compare this with the signature-based framework of (Futter, Horvath, Wiese, 2023) and demonstrate",
    "published": "2025-07-14",
    "url": "http://arxiv.org/abs/2507.10701v1",
    "pdf_url": "https://arxiv.org/pdf/2507.10701v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.10701v1_Kernel_Learning_for_Mean-Variance_Trading_Strategies.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.08184v1",
    "title": "EP-GAT: Energy-based Parallel Graph Attention Neural Network for Stock Trend Classification",
    "authors": [
      "Zhuodong Jiang",
      "Pengju Zhang",
      "Peter Martin"
    ],
    "summary": "Graph neural networks have shown remarkable performance in forecasting stock movements, which arises from learning complex inter-dependencies between stocks and intra-dynamics of stocks. Existing approaches based on graph neural networks typically rely on static or manually defined factors to model changing inter-dependencies between stocks. Furthermore, these works often struggle to preserve hierarchical features within stocks. To bridge these gaps, this work presents the Energy-based Parallel ",
    "published": "2025-07-10",
    "url": "http://arxiv.org/abs/2507.08184v1",
    "pdf_url": "https://arxiv.org/pdf/2507.08184v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.08184v1_EP-GAT_Energy-based_Parallel_Graph_Attention_Neural_Network_for_Stock_Trend_Classification.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.09851v1",
    "title": "Advancing Exchange Rate Forecasting: Leveraging Machine Learning and AI for Enhanced Accuracy in Global Financial Markets",
    "authors": [
      "Md. Yeasin Rahat",
      "Rajan Das Gupta",
      "Nur Raisa Rahman",
      "Sudipto Roy Pritom",
      "Samiur Rahman Shakir",
      "Md Imrul Hasan Showmick",
      "Md. Jakir Hossen"
    ],
    "summary": "The prediction of foreign exchange rates, such as the US Dollar (USD) to Bangladeshi Taka (BDT), plays a pivotal role in global financial markets, influencing trade, investments, and economic stability. This study leverages historical USD/BDT exchange rate data from 2018 to 2023, sourced from Yahoo Finance, to develop advanced machine learning models for accurate forecasting. A Long Short-Term Memory (LSTM) neural network is employed, achieving an exceptional accuracy of 99.449%, a Root Mean Squ",
    "published": "2025-06-11",
    "url": "http://arxiv.org/abs/2506.09851v1",
    "pdf_url": "https://arxiv.org/pdf/2506.09851v1",
    "pdf_path": "pdfs_articles\\arxiv\\2506.09851v1_Advancing_Exchange_Rate_Forecasting_Leveraging_Machine_Learning_and_AI_for_Enhanced_Accuracy_in_Glob.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.05764v2",
    "title": "Exploring Microstructural Dynamics in Cryptocurrency Limit Order Books: Better Inputs Matter More Than Stacking Another Hidden Layer",
    "authors": [
      "Haochuan Wang"
    ],
    "summary": "Cryptocurrency price dynamics are driven largely by microstructural supply demand imbalances in the limit order book (LOB), yet the highly noisy nature of LOB data complicates the signal extraction process. Prior research has demonstrated that deep-learning architectures can yield promising predictive performance on pre-processed equity and futures LOB data, but they often treat model complexity as an unqualified virtue. In this paper, we aim to examine whether adding extra hidden layers or para",
    "published": "2025-06-06",
    "url": "http://arxiv.org/abs/2506.05764v2",
    "pdf_url": "https://arxiv.org/pdf/2506.05764v2",
    "pdf_path": "pdfs_articles\\arxiv\\2506.05764v2_Exploring_Microstructural_Dynamics_in_Cryptocurrency_Limit_Order_Books_Better_Inputs_Matter_More_Tha.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.05565v1",
    "title": "Applying Informer for Option Pricing: A Transformer-Based Approach",
    "authors": [
      "Feliks Bańka",
      "Jarosław A. Chudziak"
    ],
    "summary": "Accurate option pricing is essential for effective trading and risk management in financial markets, yet it remains challenging due to market volatility and the limitations of traditional models like Black-Scholes. In this paper, we investigate the application of the Informer neural network for option pricing, leveraging its ability to capture long-term dependencies and dynamically adjust to market fluctuations. This research contributes to the field of financial forecasting by introducing Infor",
    "published": "2025-06-05",
    "url": "http://arxiv.org/abs/2506.05565v1",
    "pdf_url": "https://arxiv.org/pdf/2506.05565v1",
    "pdf_path": "pdfs_articles\\arxiv\\2506.05565v1_Applying_Informer_for_Option_Pricing_A_Transformer-Based_Approach.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.01945v1",
    "title": "Stock Market Telepathy: Graph Neural Networks Predicting the Secret Conversations between MINT and G7 Countries",
    "authors": [
      "Nurbanu Bursa"
    ],
    "summary": "Emerging economies, particularly the MINT countries (Mexico, Indonesia, Nigeria, and Türkiye), are gaining influence in global stock markets, although they remain susceptible to the economic conditions of developed countries like the G7 (Canada, France, Germany, Italy, Japan, the United Kingdom, and the United States). This interconnectedness and sensitivity of financial markets make understanding these relationships crucial for investors and policymakers to predict stock price movements accurat",
    "published": "2025-06-02",
    "url": "http://arxiv.org/abs/2506.01945v1",
    "pdf_url": "https://arxiv.org/pdf/2506.01945v1",
    "pdf_path": "pdfs_articles\\arxiv\\2506.01945v1_Stock_Market_Telepathy_Graph_Neural_Networks_Predicting_the_Secret_Conversations_between_MINT_and_G7.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.23084v1",
    "title": "Gradient Boosting Decision Tree with LSTM for Investment Prediction",
    "authors": [
      "Chang Yu",
      "Fang Liu",
      "Jie Zhu",
      "Shaobo Guo",
      "Yifan Gao",
      "Zhongheng Yang",
      "Meiwei Liu",
      "Qianwen Xing"
    ],
    "summary": "This paper proposes a hybrid framework combining LSTM (Long Short-Term Memory) networks with LightGBM and CatBoost for stock price prediction. The framework processes time-series financial data and evaluates performance using seven models: Artificial Neural Networks (ANNs), Convolutional Neural Networks (CNNs), Bidirectional LSTM (BiLSTM), vanilla LSTM, XGBoost, LightGBM, and standard Neural Networks (NNs). Key metrics, including MAE, R-squared, MSE, and RMSE, are used to establish benchmarks ac",
    "published": "2025-05-29",
    "url": "http://arxiv.org/abs/2505.23084v1",
    "pdf_url": "https://arxiv.org/pdf/2505.23084v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.23084v1_Gradient_Boosting_Decision_Tree_with_LSTM_for_Investment_Prediction.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.01964v1",
    "title": "Forecasting Nigerian Equity Stock Returns Using Long Short-Term Memory Technique",
    "authors": [
      "Adebola K. Ojo",
      "Ifechukwude Jude Okafor"
    ],
    "summary": "Investors and stock market analysts face major challenges in predicting stock returns and making wise investment decisions. The predictability of equity stock returns can boost investor confidence, but it remains a difficult task. To address this issue, a study was conducted using a Long Short-term Memory (LSTM) model to predict future stock market movements. The study used a historical dataset from the Nigerian Stock Exchange (NSE), which was cleaned and normalized to design the LSTM model. The",
    "published": "2025-05-27",
    "url": "http://arxiv.org/abs/2507.01964v1",
    "pdf_url": "https://arxiv.org/pdf/2507.01964v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.01964v1_Forecasting_Nigerian_Equity_Stock_Returns_Using_Long_Short-Term_Memory_Technique.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.19243v1",
    "title": "Comparative analysis of financial data differentiation techniques using LSTM neural network",
    "authors": [
      "Dominik Stempień",
      "Janusz Gajda"
    ],
    "summary": "We compare traditional approach of computing logarithmic returns with the fractional differencing method and its tempered extension as methods of data preparation before their usage in advanced machine learning models. Differencing parameters are estimated using multiple techniques. The empirical investigation is conducted on data from four major stock indices covering the most recent 10-year period. The set of explanatory variables is additionally extended with technical indicators. The effecti",
    "published": "2025-05-25",
    "url": "http://arxiv.org/abs/2505.19243v1",
    "pdf_url": "https://arxiv.org/pdf/2505.19243v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.19243v1_Comparative_analysis_of_financial_data_differentiation_techniques_using_LSTM_neural_network.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2506.06293v1",
    "title": "Prediction of Bank Credit Ratings using Heterogeneous Topological Graph Neural Networks",
    "authors": [
      "Junyi Liu",
      "Stanley Kok"
    ],
    "summary": "Agencies such as Standard & Poor's and Moody's provide bank credit ratings that influence economic stability and decision-making by stakeholders. Accurate and timely predictions support informed decision-making, regulatory actions, and investor protection. However, a complete interbank connection graph is often unavailable due to privacy concerns, complicating the direct application of Graph Neural Networks (GNNs) for rating prediction. our research utilizes persistent homology to construct a ne",
    "published": "2025-05-17",
    "url": "http://arxiv.org/abs/2506.06293v1",
    "pdf_url": "https://arxiv.org/pdf/2506.06293v1",
    "pdf_path": "pdfs_articles\\arxiv\\2506.06293v1_Prediction_of_Bank_Credit_Ratings_using_Heterogeneous_Topological_Graph_Neural_Networks.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.01402v1",
    "title": "Predicting the Price of Gold in the Financial Markets Using Hybrid Models",
    "authors": [
      "Mohammadhossein Rashidi",
      "Mohammad Modarres"
    ],
    "summary": "Predicting the price that has the least error and can provide the best and highest accuracy has been one of the most challenging issues and one of the most critical concerns among capital market activists and researchers. Therefore, a model that can solve problems and provide results with high accuracy is one of the topics of interest among researchers. In this project, using time series prediction models such as ARIMA to estimate the price, variables, and indicators related to technical analysi",
    "published": "2025-05-02",
    "url": "http://arxiv.org/abs/2505.01402v1",
    "pdf_url": "https://arxiv.org/pdf/2505.01402v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.01402v1_Predicting_the_Price_of_Gold_in_the_Financial_Markets_Using_Hybrid_Models.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2504.19309v1",
    "title": "Bridging Short- and Long-Term Dependencies: A CNN-Transformer Hybrid for Financial Time Series Forecasting",
    "authors": [
      "Tiantian Tu"
    ],
    "summary": "Time series forecasting is crucial for decision-making across various domains, particularly in financial markets where stock prices exhibit complex and non-linear behaviors. Accurately predicting future price movements is challenging due to the difficulty of capturing both short-term fluctuations and long-term dependencies in the data. Convolutional Neural Networks (CNNs) are well-suited for modeling localized, short-term patterns but struggle with long-range dependencies due to their limited re",
    "published": "2025-04-27",
    "url": "http://arxiv.org/abs/2504.19309v1",
    "pdf_url": "https://arxiv.org/pdf/2504.19309v1",
    "pdf_path": "pdfs_articles\\arxiv\\2504.19309v1_Bridging_Short-_and_Long-Term_Dependencies_A_CNN-Transformer_Hybrid_for_Financial_Time_Series_Foreca.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.14992v1",
    "title": "Multi-Objective Bayesian Optimization of Deep Reinforcement Learning for Environmental, Social, and Governance (ESG) Financial Portfolio Management",
    "authors": [
      "M. Coronado-Vaca"
    ],
    "summary": "DRL agents circumvent the issue of classic models in the sense that they do not make assumptions like the financial returns being normally distributed and are able to deal with any information like the ESG score if they are configured to gain a reward that makes an objective better. However, the performance of DRL agents has high variability and it is very sensible to the value of their hyperparameters. Bayesian optimization is a class of methods that are suited to the optimization of black-box ",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.14992v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14992v1",
    "pdf_path": null
  },
  {
    "source": "arXiv",
    "article_id": "2512.14991v1",
    "title": "Adaptive Partitioning and Learning for Stochastic Control of Diffusion Processes",
    "authors": [
      "Hanqing Jin",
      "Renyuan Xu",
      "Yanzhao Yang"
    ],
    "summary": "We study reinforcement learning for controlled diffusion processes with unbounded continuous state spaces, bounded continuous actions, and polynomially growing rewards: settings that arise naturally in finance, economics, and operations research. To overcome the challenges of continuous and high-dimensional domains, we introduce a model-based algorithm that adaptively partitions the joint state-action space. The algorithm maintains estimators of drift, volatility, and rewards within each partiti",
    "published": "2025-12-17",
    "url": "http://arxiv.org/abs/2512.14991v1",
    "pdf_url": "https://arxiv.org/pdf/2512.14991v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.14991v1_Adaptive_Partitioning_and_Learning_for_Stochastic_Control_of_Diffusion_Processes.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.12922v1",
    "title": "LLM-based Personalized Portfolio Recommender: Integrating Large Language Models and Reinforcement Learning for Intelligent Investment Strategy Optimization",
    "authors": [
      "Bangyu Li",
      "Boping Gu",
      "Ziyang Ding"
    ],
    "summary": "In modern financial markets, investors increasingly seek personalized and adaptive portfolio strategies that reflect their individual risk preferences and respond to dynamic market conditions. Traditional rule-based or static optimization approaches often fail to capture the nonlinear interactions among investor behavior, market volatility, and evolving financial objectives. To address these limitations, this paper introduces the LLM-based Personalized Portfolio Recommender , an integrated frame",
    "published": "2025-12-15",
    "url": "http://arxiv.org/abs/2512.12922v1",
    "pdf_url": "https://arxiv.org/pdf/2512.12922v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.12922v1_LLM-based_Personalized_Portfolio_Recommender_Integrating_Large_Language_Models_and_Reinforcement_Lea.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.10913v1",
    "title": "Reinforcement Learning in Financial Decision Making: A Systematic Review of Performance, Challenges, and Implementation Strategies",
    "authors": [
      "Mohammad Rezoanul Hoque",
      "Md Meftahul Ferdaus",
      "M. Kabir Hassan"
    ],
    "summary": "Reinforcement learning (RL) is an innovative approach to financial decision making, offering specialized solutions to complex investment problems where traditional methods fail. This review analyzes 167 articles from 2017--2025, focusing on market making, portfolio optimization, and algorithmic trading. It identifies key performance issues and challenges in RL for finance. Generally, RL offers advantages over traditional methods, particularly in market making. This study proposes a unified frame",
    "published": "2025-12-11",
    "url": "http://arxiv.org/abs/2512.10913v1",
    "pdf_url": "https://arxiv.org/pdf/2512.10913v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.10913v1_Reinforcement_Learning_in_Financial_Decision_Making_A_Systematic_Review_of_Performance_Challenges_an.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.09224v1",
    "title": "Exploratory Mean-Variance with Jumps: An Equilibrium Approach",
    "authors": [
      "Yuling Max Chen",
      "Bin Li",
      "David Saunders"
    ],
    "summary": "Revisiting the continuous-time Mean-Variance (MV) Portfolio Optimization problem, we model the market dynamics with a jump-diffusion process and apply Reinforcement Learning (RL) techniques to facilitate informed exploration within the control space. We recognize the time-inconsistency of the MV problem and adopt the time-inconsistent control (TIC) approach to analytically solve for an exploratory equilibrium investment policy, which is a Gaussian distribution centered on the equilibrium control",
    "published": "2025-12-10",
    "url": "http://arxiv.org/abs/2512.09224v1",
    "pdf_url": "https://arxiv.org/pdf/2512.09224v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.09224v1_Exploratory_Mean-Variance_with_Jumps_An_Equilibrium_Approach.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.06639v1",
    "title": "Learning to Hedge Swaptions",
    "authors": [
      "Zaniar Ahmadi",
      "Frédéric Godin"
    ],
    "summary": "This paper investigates the deep hedging framework, based on reinforcement learning (RL), for the dynamic hedging of swaptions, contrasting its performance with traditional sensitivity-based rho-hedging. We design agents under three distinct objective functions (mean squared error, downside risk, and Conditional Value-at-Risk) to capture alternative risk preferences and evaluate how these objectives shape hedging styles. Relying on a three-factor arbitrage-free dynamic Nelson-Siegel model for ou",
    "published": "2025-12-07",
    "url": "http://arxiv.org/abs/2512.06639v1",
    "pdf_url": "https://arxiv.org/pdf/2512.06639v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.06639v1_Learning_to_Hedge_Swaptions.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.02386v1",
    "title": "Risk-Sensitive Q-Learning in Continuous Time with Application to Dynamic Portfolio Selection",
    "authors": [
      "Chuhan Xie"
    ],
    "summary": "This paper studies the problem of risk-sensitive reinforcement learning (RSRL) in continuous time, where the environment is characterized by a controllable stochastic differential equation (SDE) and the objective is a potentially nonlinear functional of cumulative rewards. We prove that when the functional is an optimized certainty equivalent (OCE), the optimal policy is Markovian with respect to an augmented environment. We also propose \\textit{CT-RS-q}, a risk-sensitive q-learning algorithm ba",
    "published": "2025-12-02",
    "url": "http://arxiv.org/abs/2512.02386v1",
    "pdf_url": "https://arxiv.org/pdf/2512.02386v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.02386v1_Risk-Sensitive_Q-Learning_in_Continuous_Time_with_Application_to_Dynamic_Portfolio_Selection.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2512.08948v1",
    "title": "Online Inference of Constrained Optimization: Primal-Dual Optimality and Sequential Quadratic Programming",
    "authors": [
      "Yihang Gao",
      "Michael K. Ng",
      "Michael W. Mahoney",
      "Sen Na"
    ],
    "summary": "We study online statistical inference for the solutions of stochastic optimization problems with equality and inequality constraints. Such problems are prevalent in statistics and machine learning, encompassing constrained $M$-estimation, physics-informed models, safe reinforcement learning, and algorithmic fairness. We develop a stochastic sequential quadratic programming (SSQP) method to solve these problems, where the step direction is computed by sequentially performing a quadratic approxima",
    "published": "2025-11-27",
    "url": "http://arxiv.org/abs/2512.08948v1",
    "pdf_url": "https://arxiv.org/pdf/2512.08948v1",
    "pdf_path": "pdfs_articles\\arxiv\\2512.08948v1_Online_Inference_of_Constrained_Optimization_Primal-Dual_Optimality_and_Sequential_Quadratic_Program.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.19701v1",
    "title": "Optimal dividend and capital injection under self-exciting claims",
    "authors": [
      "Paulin Aubert",
      "Etienne Chevalier",
      "Vathana Ly Vath"
    ],
    "summary": "In this paper, we study an optimal dividend and capital-injection problem in a Cramér--Lundberg model where claim arrivals follow a Hawkes process, capturing clustering effects often observed in insurance portfolios. We establish key analytical properties of the value function and characterise the optimal capital-injection strategy through an explicit threshold. We also show that the value function is the unique viscosity solution of the associated HJB variational inequality. For numerical purpo",
    "published": "2025-11-24",
    "url": "http://arxiv.org/abs/2511.19701v1",
    "pdf_url": "https://arxiv.org/pdf/2511.19701v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.19701v1_Optimal_dividend_and_capital_injection_under_self-exciting_claims.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.18076v1",
    "title": "Reinforcement Learning for Portfolio Optimization with a Financial Goal and Defined Time Horizons",
    "authors": [
      "Fermat Leukam",
      "Rock Stephane Koffi",
      "Prudence Djagba"
    ],
    "summary": "This research proposes an enhancement to the innovative portfolio optimization approach using the G-Learning algorithm, combined with parametric optimization via the GIRL algorithm (G-learning approach to the setting of Inverse Reinforcement Learning) as presented by. The goal is to maximize portfolio value by a target date while minimizing the investor's periodic contributions. Our model operates in a highly volatile market with a well-diversified portfolio, ensuring a low-risk level for the in",
    "published": "2025-11-22",
    "url": "http://arxiv.org/abs/2511.18076v1",
    "pdf_url": "https://arxiv.org/pdf/2511.18076v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.18076v1_Reinforcement_Learning_for_Portfolio_Optimization_with_a_Financial_Goal_and_Defined_Time_Horizons.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.17963v1",
    "title": "Hybrid LSTM and PPO Networks for Dynamic Portfolio Optimization",
    "authors": [
      "Jun Kevin",
      "Pujianto Yugopuspito"
    ],
    "summary": "This paper introduces a hybrid framework for portfolio optimization that fuses Long Short-Term Memory (LSTM) forecasting with a Proximal Policy Optimization (PPO) reinforcement learning strategy. The proposed system leverages the predictive power of deep recurrent networks to capture temporal dependencies, while the PPO agent adaptively refines portfolio allocations in continuous action spaces, allowing the system to anticipate trends while adjusting dynamically to market shifts. Using multi-ass",
    "published": "2025-11-22",
    "url": "http://arxiv.org/abs/2511.17963v1",
    "pdf_url": "https://arxiv.org/pdf/2511.17963v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.17963v1_Hybrid_LSTM_and_PPO_Networks_for_Dynamic_Portfolio_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.20678v1",
    "title": "Cryptocurrency Portfolio Management with Reinforcement Learning: Soft Actor--Critic and Deep Deterministic Policy Gradient Algorithms",
    "authors": [
      "Kamal Paykan"
    ],
    "summary": "This paper proposes a reinforcement learning--based framework for cryptocurrency portfolio management using the Soft Actor--Critic (SAC) and Deep Deterministic Policy Gradient (DDPG) algorithms. Traditional portfolio optimization methods often struggle to adapt to the highly volatile and nonlinear dynamics of cryptocurrency markets. To address this, we design an agent that learns continuous trading actions directly from historical market data through interaction with a simulated trading environm",
    "published": "2025-11-16",
    "url": "http://arxiv.org/abs/2511.20678v1",
    "pdf_url": "https://arxiv.org/pdf/2511.20678v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.20678v1_Cryptocurrency_Portfolio_Management_with_Reinforcement_Learning_Soft_Actor--Critic_and_Deep_Determin.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.12120v1",
    "title": "Deep Reinforcement Learning for Automated Stock Trading: An Ensemble Strategy",
    "authors": [
      "Hongyang Yang",
      "Xiao-Yang Liu",
      "Shan Zhong",
      "Anwar Walid"
    ],
    "summary": "Stock trading strategies play a critical role in investment. However, it is challenging to design a profitable strategy in a complex and dynamic stock market. In this paper, we propose an ensemble strategy that employs deep reinforcement schemes to learn a stock trading strategy by maximizing investment return. We train a deep reinforcement learning agent and obtain an ensemble trading strategy using three actor-critic based algorithms: Proximal Policy Optimization (PPO), Advantage Actor Critic ",
    "published": "2025-11-15",
    "url": "http://arxiv.org/abs/2511.12120v1",
    "pdf_url": "https://arxiv.org/pdf/2511.12120v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.12120v1_Deep_Reinforcement_Learning_for_Automated_Stock_Trading_An_Ensemble_Strategy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.11481v1",
    "title": "Risk-Aware Deep Reinforcement Learning for Dynamic Portfolio Optimization",
    "authors": [
      "Emmanuel Lwele",
      "Sabuni Emmanuel",
      "Sitali Gabriel Sitali"
    ],
    "summary": "This paper presents a deep reinforcement learning (DRL) framework for dynamic portfolio optimization under market uncertainty and risk. The proposed model integrates a Sharpe ratio-based reward function with direct risk control mechanisms, including maximum drawdown and volatility constraints. Proximal Policy Optimization (PPO) is employed to learn adaptive asset allocation strategies over historical financial time series. Model performance is benchmarked against mean-variance and equal-weight p",
    "published": "2025-11-14",
    "url": "http://arxiv.org/abs/2511.11481v1",
    "pdf_url": "https://arxiv.org/pdf/2511.11481v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.11481v1_Risk-Aware_Deep_Reinforcement_Learning_for_Dynamic_Portfolio_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.26165v1",
    "title": "Learning to Manage Investment Portfolios beyond Simple Utility Functions",
    "authors": [
      "Maarten P. Scholl",
      "Mahmoud Mahfouz",
      "Anisoara Calinescu",
      "J. Doyne Farmer"
    ],
    "summary": "While investment funds publicly disclose their objectives in broad terms, their managers optimize for complex combinations of competing goals that go beyond simple risk-return trade-offs. Traditional approaches attempt to model this through multi-objective utility functions, but face fundamental challenges in specification and parameterization. We propose a generative framework that learns latent representations of fund manager strategies without requiring explicit utility specification.\n  Our a",
    "published": "2025-10-30",
    "url": "http://arxiv.org/abs/2510.26165v1",
    "pdf_url": "https://arxiv.org/pdf/2510.26165v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.26165v1_Learning_to_Manage_Investment_Portfolios_beyond_Simple_Utility_Functions.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2511.00039v1",
    "title": "Graph-Attentive MAPPO for Dynamic Retail Pricing",
    "authors": [
      "Krishna Kumar Neelakanta Pillai Santha Kumari Amma"
    ],
    "summary": "Dynamic pricing in retail requires policies that adapt to shifting demand while coordinating decisions across related products. We present a systematic empirical study of multi-agent reinforcement learning for retail price optimization, comparing a strong MAPPO baseline with a graph-attention-augmented variant (MAPPO+GAT) that leverages learned interactions among products. Using a simulated pricing environment derived from real transaction data, we evaluate profit, stability across random seeds,",
    "published": "2025-10-28",
    "url": "http://arxiv.org/abs/2511.00039v1",
    "pdf_url": "https://arxiv.org/pdf/2511.00039v1",
    "pdf_path": "pdfs_articles\\arxiv\\2511.00039v1_Graph-Attentive_MAPPO_for_Dynamic_Retail_Pricing.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.21147v1",
    "title": "Hierarchical AI Multi-Agent Fundamental Investing: Evidence from China's A-Share Market",
    "authors": [
      "Chujun He",
      "Zhonghao Huang",
      "Xiangguo Li",
      "Ye Luo",
      "Kewei Ma",
      "Yuxuan Xiong",
      "Xiaowei Zhang",
      "Mingyang Zhao"
    ],
    "summary": "We present a multi-agent, AI-driven framework for fundamental investing that integrates macro indicators, industry-level and firm-specific information to construct optimized equity portfolios. The architecture comprises: (i) a Macro agent that dynamically screens and weights sectors based on evolving economic indicators and industry performance; (ii) four firm-level agents -- Fundamental, Technical, Report, and News -- that conduct in-depth analyses of individual firms to ensure both breadth and",
    "published": "2025-10-24",
    "url": "http://arxiv.org/abs/2510.21147v1",
    "pdf_url": "https://arxiv.org/pdf/2510.21147v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.21147v1_Hierarchical_AI_Multi-Agent_Fundamental_Investing_Evidence_from_Chinas_A-Share_Market.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.12725v1",
    "title": "(Non-Parametric) Bootstrap Robust Optimization for Portfolios and Trading Strategies",
    "authors": [
      "Daniel Cunha Oliveira",
      "Grover Guzman",
      "Nick Firoozye"
    ],
    "summary": "Robust optimization provides a principled framework for decision-making under uncertainty, with broad applications in finance, engineering, and operations research. In portfolio optimization, uncertainty in expected returns and covariances demands methods that mitigate estimation error, parameter instability, and model misspecification. Traditional approaches, including parametric, bootstrap-based, and Bayesian methods, enhance stability by relying on confidence intervals or probabilistic priors",
    "published": "2025-10-14",
    "url": "http://arxiv.org/abs/2510.12725v1",
    "pdf_url": "https://arxiv.org/pdf/2510.12725v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.12725v1_Non-Parametric_Bootstrap_Robust_Optimization_for_Portfolios_and_Trading_Strategies.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.07099v1",
    "title": "Diffusion-Augmented Reinforcement Learning for Robust Portfolio Optimization under Stress Scenarios",
    "authors": [
      "Himanshu Choudhary",
      "Arishi Orra",
      "Manoj Thakur"
    ],
    "summary": "In the ever-changing and intricate landscape of financial markets, portfolio optimisation remains a formidable challenge for investors and asset managers. Conventional methods often struggle to capture the complex dynamics of market behaviour and align with diverse investor preferences. To address this, we propose an innovative framework, termed Diffusion-Augmented Reinforcement Learning (DARL), which synergistically integrates Denoising Diffusion Probabilistic Models (DDPMs) with Deep Reinforce",
    "published": "2025-10-08",
    "url": "http://arxiv.org/abs/2510.07099v1",
    "pdf_url": "https://arxiv.org/pdf/2510.07099v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.07099v1_Diffusion-Augmented_Reinforcement_Learning_for_Robust_Portfolio_Optimization_under_Stress_Scenarios.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.04563v1",
    "title": "Stochastic Approximation Methods for Distortion Risk Measure Optimization",
    "authors": [
      "Jinyang Jiang",
      "Bernd Heidergott",
      "Jiaqiao Hu",
      "Yijie Peng"
    ],
    "summary": "Distortion Risk Measures (DRMs) capture risk preferences in decision-making and serve as general criteria for managing uncertainty. This paper proposes gradient descent algorithms for DRM optimization based on two dual representations: the Distortion-Measure (DM) form and Quantile-Function (QF) form. The DM-form employs a three-timescale algorithm to track quantiles, compute their gradients, and update decision variables, utilizing the Generalized Likelihood Ratio and kernel-based density estima",
    "published": "2025-10-06",
    "url": "http://arxiv.org/abs/2510.04563v1",
    "pdf_url": "https://arxiv.org/pdf/2510.04563v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.04563v1_Stochastic_Approximation_Methods_for_Distortion_Risk_Measure_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.02986v1",
    "title": "FR-LUX: Friction-Aware, Regime-Conditioned Policy Optimization for Implementable Portfolio Management",
    "authors": [
      "Jian'an Zhang"
    ],
    "summary": "Transaction costs and regime shifts are major reasons why paper portfolios fail in live trading. We introduce FR-LUX (Friction-aware, Regime-conditioned Learning under eXecution costs), a reinforcement learning framework that learns after-cost trading policies and remains robust across volatility-liquidity regimes. FR-LUX integrates three ingredients: (i) a microstructure-consistent execution model combining proportional and impact costs, directly embedded in the reward; (ii) a trade-space trust",
    "published": "2025-10-03",
    "url": "http://arxiv.org/abs/2510.02986v1",
    "pdf_url": "https://arxiv.org/pdf/2510.02986v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.02986v1_FR-LUX_Friction-Aware_Regime-Conditioned_Policy_Optimization_for_Implementable_Portfolio_Management.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.25592v1",
    "title": "Machine Learning Algorithms for Improving Black Box Optimization Solvers",
    "authors": [
      "Morteza Kimiaei",
      "Vyacheslav Kungurtsev"
    ],
    "summary": "Black-box optimization (BBO) addresses problems where objectives are accessible only through costly queries without gradients or explicit structure. Classical derivative-free methods -- line search, direct search, and model-based solvers such as Bayesian optimization -- form the backbone of BBO, yet often struggle in high-dimensional, noisy, or mixed-integer settings.\n  Recent advances use machine learning (ML) and reinforcement learning (RL) to enhance BBO: ML provides expressive surrogates, ad",
    "published": "2025-09-29",
    "url": "http://arxiv.org/abs/2509.25592v1",
    "pdf_url": "https://arxiv.org/pdf/2509.25592v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.25592v1_Machine_Learning_Algorithms_for_Improving_Black_Box_Optimization_Solvers.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.25055v2",
    "title": "AlphaSAGE: Structure-Aware Alpha Mining via GFlowNets for Robust Exploration",
    "authors": [
      "Binqi Chen",
      "Hongjun Ding",
      "Ning Shen",
      "Jinsheng Huang",
      "Taian Guo",
      "Luchen Liu",
      "Ming Zhang"
    ],
    "summary": "The automated mining of predictive signals, or alphas, is a central challenge in quantitative finance. While Reinforcement Learning (RL) has emerged as a promising paradigm for generating formulaic alphas, existing frameworks are fundamentally hampered by a triad of interconnected issues. First, they suffer from reward sparsity, where meaningful feedback is only available upon the completion of a full formula, leading to inefficient and unstable exploration. Second, they rely on semantically ina",
    "published": "2025-09-29",
    "url": "http://arxiv.org/abs/2509.25055v2",
    "pdf_url": "https://arxiv.org/pdf/2509.25055v2",
    "pdf_path": "pdfs_articles\\arxiv\\2509.25055v2_AlphaSAGE_Structure-Aware_Alpha_Mining_via_GFlowNets_for_Robust_Exploration.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.14385v1",
    "title": "Adaptive and Regime-Aware RL for Portfolio Optimization",
    "authors": [
      "Gabriel Nixon Raj"
    ],
    "summary": "This study proposes a regime-aware reinforcement learning framework for long-horizon portfolio optimization. Moving beyond traditional feedforward and GARCH-based models, we design realistic environments where agents dynamically reallocate capital in response to latent macroeconomic regime shifts. Agents receive hybrid observations and are trained using constrained reward functions that incorporate volatility penalties, capital resets, and tail-risk shocks. We benchmark multiple architectures, i",
    "published": "2025-09-17",
    "url": "http://arxiv.org/abs/2509.14385v1",
    "pdf_url": "https://arxiv.org/pdf/2509.14385v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.14385v1_Adaptive_and_Regime-Aware_RL_for_Portfolio_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.12764v1",
    "title": "Myopic Optimality: why reinforcement learning portfolio management strategies lose money",
    "authors": [
      "Yuming Ma"
    ],
    "summary": "Myopic optimization (MO) outperforms reinforcement learning (RL) in portfolio management: RL yields lower or negative returns, higher variance, larger costs, heavier CVaR, lower profitability, and greater model risk. We model execution/liquidation frictions with mark-to-market accounting. Using Malliavin calculus (Clark-Ocone/BEL), we derive policy gradients and risk shadow price, unifying HJB and KKT. This gives dual gap and convergence results: geometric MO vs. RL floors. We quantify phantom p",
    "published": "2025-09-16",
    "url": "http://arxiv.org/abs/2509.12764v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12764v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.12764v1_Myopic_Optimality_why_reinforcement_learning_portfolio_management_strategies_lose_money.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.12753v1",
    "title": "DeltaHedge: A Multi-Agent Framework for Portfolio Options Optimization",
    "authors": [
      "Feliks Bańka",
      "Jarosław A. Chudziak"
    ],
    "summary": "In volatile financial markets, balancing risk and return remains a significant challenge. Traditional approaches often focus solely on equity allocation, overlooking the strategic advantages of options trading for dynamic risk hedging. This work presents DeltaHedge, a multi-agent framework that integrates options trading with AI-driven portfolio management. By combining advanced reinforcement learning techniques with an ensembled options-based hedging strategy, DeltaHedge enhances risk-adjusted ",
    "published": "2025-09-16",
    "url": "http://arxiv.org/abs/2509.12753v1",
    "pdf_url": "https://arxiv.org/pdf/2509.12753v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.12753v1_DeltaHedge_A_Multi-Agent_Framework_for_Portfolio_Options_Optimization.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.09585v2",
    "title": "Causal PDE-Control for Adaptive Portfolio Optimization under Partial Information",
    "authors": [
      "Alejandro Rodriguez Dominguez"
    ],
    "summary": "Classical portfolio models tend to degrade under structural breaks, whereas flexible machine-learning allocators often lack arbitrage consistency and interpretability. We propose Causal PDE-Control Models (CPCMs), a framework that links structural causal drivers, nonlinear filtering, and forward-backward PDE control to produce robust, transparent allocation rules under partial information. The main contributions are: (i) construction of scenario-conditional risk-neutral measures on the observabl",
    "published": "2025-09-11",
    "url": "http://arxiv.org/abs/2509.09585v2",
    "pdf_url": "https://arxiv.org/pdf/2509.09585v2",
    "pdf_path": "pdfs_articles\\arxiv\\2509.09585v2_Causal_PDE-Control_for_Adaptive_Portfolio_Optimization_under_Partial_Information.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2510.14985v1",
    "title": "DeepAries: Adaptive Rebalancing Interval Selection for Enhanced Portfolio Selection",
    "authors": [
      "Jinkyu Kim",
      "Hyunjung Yi",
      "Mogan Gim",
      "Donghee Choi",
      "Jaewoo Kang"
    ],
    "summary": "We propose DeepAries , a novel deep reinforcement learning framework for dynamic portfolio management that jointly optimizes the timing and allocation of rebalancing decisions. Unlike prior reinforcement learning methods that employ fixed rebalancing intervals regardless of market conditions, DeepAries adaptively selects optimal rebalancing intervals along with portfolio weights to reduce unnecessary transaction costs and maximize risk-adjusted returns. Our framework integrates a Transformer-bas",
    "published": "2025-09-11",
    "url": "http://arxiv.org/abs/2510.14985v1",
    "pdf_url": "https://arxiv.org/pdf/2510.14985v1",
    "pdf_path": "pdfs_articles\\arxiv\\2510.14985v1_DeepAries_Adaptive_Rebalancing_Interval_Selection_for_Enhanced_Portfolio_Selection.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.10531v1",
    "title": "FinXplore: An Adaptive Deep Reinforcement Learning Framework for Balancing and Discovering Investment Opportunities",
    "authors": [
      "Himanshu Choudhary",
      "Arishi Orra",
      "Manoj Thakur"
    ],
    "summary": "Portfolio optimization is essential for balancing risk and return in financial decision-making. Deep Reinforcement Learning (DRL) has stood out as a cutting-edge tool for portfolio optimization that learns dynamic asset allocation using trial-and-error interactions. However, most DRL-based methods are restricted to allocating assets within a pre-defined investment universe and overlook exploring new opportunities. This study introduces an investment landscape that integrates exploiting existing ",
    "published": "2025-09-05",
    "url": "http://arxiv.org/abs/2509.10531v1",
    "pdf_url": "https://arxiv.org/pdf/2509.10531v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.10531v1_FinXplore_An_Adaptive_Deep_Reinforcement_Learning_Framework_for_Balancing_and_Discovering_Investment.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2509.01393v1",
    "title": "Adaptive Alpha Weighting with PPO: Enhancing Prompt-Based LLM-Generated Alphas in Quant Trading",
    "authors": [
      "Qizhao Chen",
      "Hiroaki Kawashima"
    ],
    "summary": "This paper proposes a reinforcement learning framework that employs Proximal Policy Optimization (PPO) to dynamically optimize the weights of multiple large language model (LLM)-generated formulaic alphas for stock trading strategies. Formulaic alphas are mathematically defined trading signals derived from price, volume, sentiment, and other data. Although recent studies have shown that LLMs can generate diverse and effective alphas, a critical challenge lies in how to adaptively integrate them ",
    "published": "2025-09-01",
    "url": "http://arxiv.org/abs/2509.01393v1",
    "pdf_url": "https://arxiv.org/pdf/2509.01393v1",
    "pdf_path": "pdfs_articles\\arxiv\\2509.01393v1_Adaptive_Alpha_Weighting_with_PPO_Enhancing_Prompt-Based_LLM-Generated_Alphas_in_Quant_Trading.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.11856v1",
    "title": "Optimal Portfolio Construction -- A Reinforcement Learning Embedded Bayesian Hierarchical Risk Parity (RL-BHRP) Approach",
    "authors": [
      "Shaofeng Kang",
      "Zeying Tian"
    ],
    "summary": "We propose a two-level, learning-based portfolio method (RL-BHRP) that spreads risk across sectors and stocks, and adjusts exposures as market conditions change. Using U.S. Equities from 2012 to mid-2025, we design the model using 2012 to 2019 data, and evaluate it out-of-sample from 2020 to 2025 against a sector index built from exchange-traded funds and a static risk-balanced portfolio. Over the test window, the adaptive portfolio compounds wealth by approximately 120 percent, compared with 10",
    "published": "2025-08-16",
    "url": "http://arxiv.org/abs/2508.11856v1",
    "pdf_url": "https://arxiv.org/pdf/2508.11856v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.11856v1_Optimal_Portfolio_Construction_--_A_Reinforcement_Learning_Embedded_Bayesian_Hierarchical_Risk_Parit.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.20103v1",
    "title": "Deep Reinforcement Learning for Optimal Asset Allocation Using DDPG with TiDE",
    "authors": [
      "Rongwei Liu",
      "Jin Zheng",
      "John Cartlidge"
    ],
    "summary": "The optimal asset allocation between risky and risk-free assets is a persistent challenge due to the inherent volatility in financial markets. Conventional methods rely on strict distributional assumptions or non-additive reward ratios, which limit their robustness and applicability to investment goals. To overcome these constraints, this study formulates the optimal two-asset allocation problem as a sequential decision-making task within a Markov Decision Process (MDP). This framework enables t",
    "published": "2025-08-12",
    "url": "http://arxiv.org/abs/2508.20103v1",
    "pdf_url": "https://arxiv.org/pdf/2508.20103v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.20103v1_Deep_Reinforcement_Learning_for_Optimal_Asset_Allocation_Using_DDPG_with_TiDE.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2508.03910v1",
    "title": "Comparing Normalization Methods for Portfolio Optimization with Reinforcement Learning",
    "authors": [
      "Caio de Souza Barbosa Costa",
      "Anna Helena Reali Costa"
    ],
    "summary": "Recently, reinforcement learning has achieved remarkable results in various domains, including robotics, games, natural language processing, and finance. In the financial domain, this approach has been applied to tasks such as portfolio optimization, where an agent continuously adjusts the allocation of assets within a financial portfolio to maximize profit. Numerous studies have introduced new simulation environments, neural network architectures, and training algorithms for this purpose. Among",
    "published": "2025-08-05",
    "url": "http://arxiv.org/abs/2508.03910v1",
    "pdf_url": "https://arxiv.org/pdf/2508.03910v1",
    "pdf_path": "pdfs_articles\\arxiv\\2508.03910v1_Comparing_Normalization_Methods_for_Portfolio_Optimization_with_Reinforcement_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.20202v2",
    "title": "Technical Indicator Networks (TINs): An Interpretable Neural Architecture Modernizing Classic al Technical Analysis for Adaptive Algorithmic Trading",
    "authors": [
      "Longfei Lu"
    ],
    "summary": "Deep neural networks (DNNs) have transformed fields such as computer vision and natural language processing by employing architectures aligned with domain-specific structural patterns. In algorithmic trading, however, there remains a lack of architectures that directly incorporate the logic of traditional technical indicators. This study introduces Technical Indicator Networks (TINs), a structured neural design that reformulates rule-based financial heuristics into trainable and interpretable mo",
    "published": "2025-07-27",
    "url": "http://arxiv.org/abs/2507.20202v2",
    "pdf_url": "https://arxiv.org/pdf/2507.20202v2",
    "pdf_path": "pdfs_articles\\arxiv\\2507.20202v2_Technical_Indicator_Networks_TINs_An_Interpretable_Neural_Architecture_Modernizing_Classic_al_Techni.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.18560v1",
    "title": "HARLF: Hierarchical Reinforcement Learning and Lightweight LLM-Driven Sentiment Integration for Financial Portfolio Optimization",
    "authors": [
      "Benjamin Coriat",
      "Eric Benhamou"
    ],
    "summary": "This paper presents a novel hierarchical framework for portfolio optimization, integrating lightweight Large Language Models (LLMs) with Deep Reinforcement Learning (DRL) to combine sentiment signals from financial news with traditional market indicators. Our three-tier architecture employs base RL agents to process hybrid data, meta-agents to aggregate their decisions, and a super-agent to merge decisions based on market data and sentiment analysis. Evaluated on data from 2018 to 2024, after tr",
    "published": "2025-07-24",
    "url": "http://arxiv.org/abs/2507.18560v1",
    "pdf_url": "https://arxiv.org/pdf/2507.18560v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.18560v1_HARLF_Hierarchical_Reinforcement_Learning_and_Lightweight_LLM-Driven_Sentiment_Integration_for_Finan.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.22932v1",
    "title": "FinMarBa: A Market-Informed Dataset for Financial Sentiment Classification",
    "authors": [
      "Baptiste Lefort",
      "Eric Benhamou",
      "Beatrice Guez",
      "Jean-Jacques Ohana",
      "Ethan Setrouk",
      "Alban Etienne"
    ],
    "summary": "This paper presents a novel hierarchical framework for portfolio optimization, integrating lightweight Large Language Models (LLMs) with Deep Reinforcement Learning (DRL) to combine sentiment signals from financial news with traditional market indicators. Our three-tier architecture employs base RL agents to process hybrid data, meta-agents to aggregate their decisions, and a super-agent to merge decisions based on market data and sentiment analysis. Evaluated on data from 2018 to 2024, after tr",
    "published": "2025-07-24",
    "url": "http://arxiv.org/abs/2507.22932v1",
    "pdf_url": "https://arxiv.org/pdf/2507.22932v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.22932v1_FinMarBa_A_Market-Informed_Dataset_for_Financial_Sentiment_Classification.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2507.01972v1",
    "title": "Accelerated Portfolio Optimization and Option Pricing with Reinforcement Learning",
    "authors": [
      "Hadi Keramati",
      "Samaneh Jazayeri"
    ],
    "summary": "We present a reinforcement learning (RL)-driven framework for optimizing block-preconditioner sizes in iterative solvers used in portfolio optimization and option pricing. The covariance matrix in portfolio optimization or the discretization of differential operators in option pricing models lead to large linear systems of the form $\\mathbf{A}\\textbf{x}=\\textbf{b}$. Direct inversion of high-dimensional portfolio or fine-grid option pricing incurs a significant computational cost. Therefore, iter",
    "published": "2025-06-23",
    "url": "http://arxiv.org/abs/2507.01972v1",
    "pdf_url": "https://arxiv.org/pdf/2507.01972v1",
    "pdf_path": "pdfs_articles\\arxiv\\2507.01972v1_Accelerated_Portfolio_Optimization_and_Option_Pricing_with_Reinforcement_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.12759v1",
    "title": "Your Offline Policy is Not Trustworthy: Bilevel Reinforcement Learning for Sequential Portfolio Optimization",
    "authors": [
      "Haochen Yuan",
      "Minting Pan",
      "Yunbo Wang",
      "Siyu Gao",
      "Philip S. Yu",
      "Xiaokang Yang"
    ],
    "summary": "Reinforcement learning (RL) has shown significant promise for sequential portfolio optimization tasks, such as stock trading, where the objective is to maximize cumulative returns while minimizing risks using historical data. However, traditional RL approaches often produce policies that merely memorize the optimal yet impractical buying and selling behaviors within the fixed dataset. These offline policies are less generalizable as they fail to account for the non-stationary nature of the marke",
    "published": "2025-05-19",
    "url": "http://arxiv.org/abs/2505.12759v1",
    "pdf_url": "https://arxiv.org/pdf/2505.12759v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.12759v1_Your_Offline_Policy_is_Not_Trustworthy_Bilevel_Reinforcement_Learning_for_Sequential_Portfolio_Optim.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.07537v1",
    "title": "The Exploratory Multi-Asset Mean-Variance Portfolio Selection using Reinforcement Learning",
    "authors": [
      "Yu Li",
      "Yuhan Wu",
      "Shuhua Zhang"
    ],
    "summary": "In this paper, we study the continuous-time multi-asset mean-variance (MV) portfolio selection using a reinforcement learning (RL) algorithm, specifically the soft actor-critic (SAC) algorithm, in the time-varying financial market. A family of Gaussian portfolio selections is derived, and a policy iteration process is crafted to learn the optimal exploratory portfolio selection. We prove the convergence of the policy iteration process theoretically, based on which the SAC algorithm is developed.",
    "published": "2025-05-12",
    "url": "http://arxiv.org/abs/2505.07537v1",
    "pdf_url": "https://arxiv.org/pdf/2505.07537v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.07537v1_The_Exploratory_Multi-Asset_Mean-Variance_Portfolio_Selection_using_Reinforcement_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2505.03760v1",
    "title": "Deep Reinforcement Learning for Investor-Specific Portfolio Optimization: A Volatility-Guided Asset Selection Approach",
    "authors": [
      "Arishi Orra",
      "Aryan Bhambu",
      "Himanshu Choudhary",
      "Manoj Thakur",
      "Selvaraju Natarajan"
    ],
    "summary": "Portfolio optimization requires dynamic allocation of funds by balancing the risk and return tradeoff under dynamic market conditions. With the recent advancements in AI, Deep Reinforcement Learning (DRL) has gained prominence in providing adaptive and scalable strategies for portfolio optimization. However, the success of these strategies depends not only on their ability to adapt to market dynamics but also on the careful pre-selection of assets that influence overall portfolio performance. In",
    "published": "2025-04-20",
    "url": "http://arxiv.org/abs/2505.03760v1",
    "pdf_url": "https://arxiv.org/pdf/2505.03760v1",
    "pdf_path": "pdfs_articles\\arxiv\\2505.03760v1_Deep_Reinforcement_Learning_for_Investor-Specific_Portfolio_Optimization_A_Volatility-Guided_Asset_S.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2504.11874v1",
    "title": "Factor-MCLS: Multi-agent learning system with reward factor matrix and multi-critic framework for dynamic portfolio optimization",
    "authors": [
      "Ruoyu Sun",
      "Angelos Stefanidis",
      "Zhengyong Jiang",
      "Jionglong Su"
    ],
    "summary": "Typical deep reinforcement learning (DRL) agents for dynamic portfolio optimization learn the factors influencing portfolio return and risk by analyzing the output values of the reward function while adjusting portfolio weights within the training environment. However, it faces a major limitation where it is difficult for investors to intervene in the training based on different levels of risk aversion towards each portfolio asset. This difficulty arises from another limitation: existing DRL age",
    "published": "2025-04-16",
    "url": "http://arxiv.org/abs/2504.11874v1",
    "pdf_url": "https://arxiv.org/pdf/2504.11874v1",
    "pdf_path": "pdfs_articles\\arxiv\\2504.11874v1_Factor-MCLS_Multi-agent_learning_system_with_reward_factor_matrix_and_multi-critic_framework_for_dyn.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.17777v1",
    "title": "Adaptive Nesterov Accelerated Distributional Deep Hedging for Efficient Volatility Risk Management",
    "authors": [
      "Lei Zhao",
      "Lin Cai",
      "Wu-Sheng Lu"
    ],
    "summary": "In the field of financial derivatives trading, managing volatility risk is crucial for protecting investment portfolios from market changes. Traditional Vega hedging strategies, which often rely on basic and rule-based models, are hard to adapt well to rapidly changing market conditions. We introduce a new framework for dynamic Vega hedging, the Adaptive Nesterov Accelerated Distributional Deep Hedging (ANADDH), which combines distributional reinforcement learning with a tailored design based on",
    "published": "2025-02-25",
    "url": "http://arxiv.org/abs/2502.17777v1",
    "pdf_url": "https://arxiv.org/pdf/2502.17777v1",
    "pdf_path": "pdfs_articles\\arxiv\\2502.17777v1_Adaptive_Nesterov_Accelerated_Distributional_Deep_Hedging_for_Efficient_Volatility_Risk_Management.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.09724v2",
    "title": "Navigating the Social Welfare Frontier: Portfolios for Multi-objective Reinforcement Learning",
    "authors": [
      "Cheol Woo Kim",
      "Jai Moondra",
      "Shresth Verma",
      "Madeleine Pollack",
      "Lingkai Kong",
      "Milind Tambe",
      "Swati Gupta"
    ],
    "summary": "In many real-world applications of reinforcement learning (RL), deployed policies have varied impacts on different stakeholders, creating challenges in reaching consensus on how to effectively aggregate their preferences. Generalized $p$-means form a widely used class of social welfare functions for this purpose, with broad applications in fair resource allocation, AI alignment, and decision-making. This class includes well-known welfare functions such as Egalitarian, Nash, and Utilitarian welfa",
    "published": "2025-02-13",
    "url": "http://arxiv.org/abs/2502.09724v2",
    "pdf_url": "https://arxiv.org/pdf/2502.09724v2",
    "pdf_path": "pdfs_articles\\arxiv\\2502.09724v2_Navigating_the_Social_Welfare_Frontier_Portfolios_for_Multi-objective_Reinforcement_Learning.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2502.02619v1",
    "title": "Regret-Optimized Portfolio Enhancement through Deep Reinforcement Learning and Future Looking Rewards",
    "authors": [
      "Daniil Karzanov",
      "Rubén Garzón",
      "Mikhail Terekhov",
      "Caglar Gulcehre",
      "Thomas Raffinot",
      "Marcin Detyniecki"
    ],
    "summary": "This paper introduces a novel agent-based approach for enhancing existing portfolio strategies using Proximal Policy Optimization (PPO). Rather than focusing solely on traditional portfolio construction, our approach aims to improve an already high-performing strategy through dynamic rebalancing driven by PPO and Oracle agents. Our target is to enhance the traditional 60/40 benchmark (60% stocks, 40% bonds) by employing the Regret-based Sharpe reward function. To address the impact of transactio",
    "published": "2025-02-04",
    "url": "http://arxiv.org/abs/2502.02619v1",
    "pdf_url": "https://arxiv.org/pdf/2502.02619v1",
    "pdf_path": "pdfs_articles\\arxiv\\2502.02619v1_Regret-Optimized_Portfolio_Enhancement_through_Deep_Reinforcement_Learning_and_Future_Looking_Reward.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2501.17992v1",
    "title": "Reinforcement-Learning Portfolio Allocation with Dynamic Embedding of Market Information",
    "authors": [
      "Jinghai He",
      "Cheng Hua",
      "Chunyang Zhou",
      "Zeyu Zheng"
    ],
    "summary": "We develop a portfolio allocation framework that leverages deep learning techniques to address challenges arising from high-dimensional, non-stationary, and low-signal-to-noise market information. Our approach includes a dynamic embedding method that reduces the non-stationary, high-dimensional state space into a lower-dimensional representation. We design a reinforcement learning (RL) framework that integrates generative autoencoders and online meta-learning to dynamically embed market informat",
    "published": "2025-01-29",
    "url": "http://arxiv.org/abs/2501.17992v1",
    "pdf_url": "https://arxiv.org/pdf/2501.17992v1",
    "pdf_path": "pdfs_articles\\arxiv\\2501.17992v1_Reinforcement-Learning_Portfolio_Allocation_with_Dynamic_Embedding_of_Market_Information.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2501.16659v1",
    "title": "Exploratory Mean-Variance Portfolio Optimization with Regime-Switching Market Dynamics",
    "authors": [
      "Yuling Max Chen",
      "Bin Li",
      "David Saunders"
    ],
    "summary": "Considering the continuous-time Mean-Variance (MV) portfolio optimization problem, we study a regime-switching market setting and apply reinforcement learning (RL) techniques to assist informed exploration within the control space. We introduce and solve the Exploratory Mean Variance with Regime Switching (EMVRS) problem. We also present a Policy Improvement Theorem. Further, we recognize that the widely applied Temporal Difference (TD) learning is not adequate for the EMVRS context, hence we co",
    "published": "2025-01-28",
    "url": "http://arxiv.org/abs/2501.16659v1",
    "pdf_url": "https://arxiv.org/pdf/2501.16659v1",
    "pdf_path": "pdfs_articles\\arxiv\\2501.16659v1_Exploratory_Mean-Variance_Portfolio_Optimization_with_Regime-Switching_Market_Dynamics.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2501.08528v1",
    "title": "Dynamic Portfolio Optimization via Augmented DDPG with Quantum Price Levels-Based Trading Strategy",
    "authors": [
      "Runsheng Lin",
      "Zihan Xing",
      "Mingze Ma",
      "Raymond S. T. Lee"
    ],
    "summary": "With the development of deep learning, Dynamic Portfolio Optimization (DPO) problem has received a lot of attention in recent years, not only in the field of finance but also in the field of deep learning. Some advanced research in recent years has proposed the application of Deep Reinforcement Learning (DRL) to the DPO problem, which demonstrated to be more advantageous than supervised learning in solving the DPO problem. However, there are still certain unsolved issues: 1) DRL algorithms usual",
    "published": "2025-01-15",
    "url": "http://arxiv.org/abs/2501.08528v1",
    "pdf_url": "https://arxiv.org/pdf/2501.08528v1",
    "pdf_path": "pdfs_articles\\arxiv\\2501.08528v1_Dynamic_Portfolio_Optimization_via_Augmented_DDPG_with_Quantum_Price_Levels-Based_Trading_Strategy.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2501.06832v1",
    "title": "A novel multi-agent dynamic portfolio optimization learning system based on hierarchical deep reinforcement learning",
    "authors": [
      "Ruoyu Sun",
      "Yue Xi",
      "Angelos Stefanidis",
      "Zhengyong Jiang",
      "Jionglong Su"
    ],
    "summary": "Deep Reinforcement Learning (DRL) has been extensively used to address portfolio optimization problems. The DRL agents acquire knowledge and make decisions through unsupervised interactions with their environment without requiring explicit knowledge of the joint dynamics of portfolio assets. Among these DRL algorithms, the combination of actor-critic algorithms and deep function approximators is the most widely used DRL algorithm. Here, we find that training the DRL agent using the actor-critic ",
    "published": "2025-01-12",
    "url": "http://arxiv.org/abs/2501.06832v1",
    "pdf_url": "https://arxiv.org/pdf/2501.06832v1",
    "pdf_path": "pdfs_articles\\arxiv\\2501.06832v1_A_novel_multi-agent_dynamic_portfolio_optimization_learning_system_based_on_hierarchical_deep_reinfo.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2501.06404v1",
    "title": "A Hybrid Framework for Reinsurance Optimization: Integrating Generative Models and Reinforcement Learning",
    "authors": [
      "Stella C. Dong",
      "James R. Finlay"
    ],
    "summary": "Reinsurance optimization is critical for insurers to manage risk exposure, ensure financial stability, and maintain solvency. Traditional approaches often struggle with dynamic claim distributions, high-dimensional constraints, and evolving market conditions. This paper introduces a novel hybrid framework that integrates {Generative Models}, specifically Variational Autoencoders (VAEs), with {Reinforcement Learning (RL)} using Proximal Policy Optimization (PPO). The framework enables dynamic and",
    "published": "2025-01-11",
    "url": "http://arxiv.org/abs/2501.06404v1",
    "pdf_url": "https://arxiv.org/pdf/2501.06404v1",
    "pdf_path": "pdfs_articles\\arxiv\\2501.06404v1_A_Hybrid_Framework_for_Reinsurance_Optimization_Integrating_Generative_Models_and_Reinforcement_Lear.pdf"
  },
  {
    "source": "arXiv",
    "article_id": "2412.18563v3",
    "title": "A Deep Reinforcement Learning Framework for Dynamic Portfolio Optimization: Evidence from China's Stock Market",
    "authors": [
      "Gang Huang",
      "Xiaohua Zhou",
      "Qingyang Song"
    ],
    "summary": "Artificial intelligence is transforming financial investment decision-making frameworks, with deep reinforcement learning demonstrating substantial potential in robo-advisory applications. This paper addresses the limitations of traditional portfolio optimization methods in dynamic asset weight adjustment through the development of a deep reinforcement learning-based dynamic optimization model grounded in practical trading processes. The research advances two key innovations: first, the introduc",
    "published": "2024-12-24",
    "url": "http://arxiv.org/abs/2412.18563v3",
    "pdf_url": "https://arxiv.org/pdf/2412.18563v3",
    "pdf_path": "pdfs_articles\\arxiv\\2412.18563v3_A_Deep_Reinforcement_Learning_Framework_for_Dynamic_Portfolio_Optimization_Evidence_from_Chinas_Stoc.pdf"
  }
]